{
  "aatrox": {
    "fullName": "Aatrox, the Darkin Blade",
    "title": "the Darkin Blade",
    "id": "aatrox",
    "name": "Aatrox",
    "abilities": {
      "P": [
        {
          "name": "Deathbringer Stance",
          "description": "Periodically, Aatrox's next basic attack deals bonus physical damage and heals him, depending on the target's max health."
        }
      ],
      "Q": [
        {
          "name": "The Darkin Blade",
          "description": "Aatrox slams his greatsword down, dealing physical damage. He can swing three times, each with a different area of effect."
        }
      ],
      "W": [
        {
          "name": "Infernal Chains",
          "description": "Aatrox smashes the ground, dealing damage to the first enemy hit. Champions and large monsters have to leave the impact area quickly or they will be dragged to the center and take the damage again."
        }
      ],
      "E": [
        {
          "name": "Umbral Dash",
          "description": "Passively, Aatrox heals when damaging enemy champions. On activation, he dashes in a direction."
        }
      ],
      "R": [
        {
          "name": "World Ender",
          "description": "Aatrox unleashes his demonic form, fearing nearby enemy minions and gaining attack damage, increased healing, and movement speed. If he gets a takedown, this effect is extended."
        }
      ]
    }
  },
  "ahri": {
    "fullName": "Ahri, the Nine-Tailed Fox",
    "title": "the Nine-Tailed Fox",
    "id": "ahri",
    "name": "Ahri",
    "abilities": {
      "P": [
        {
          "name": "Essence Theft",
          "description": "When Ahri strikes 9 enemies with her abilities, her next ability also heals her for each enemy hit."
        }
      ],
      "Q": [
        {
          "name": "Orb of Deception",
          "description": "Ahri sends out and pulls back her orb, dealing magic damage on the way out and true damage on the way back."
        }
      ],
      "W": [
        {
          "name": "Fox-Fire",
          "description": "Ahri gains a brief burst of movement speed and releases three fox-fires, that lock onto and attack nearby enemies."
        }
      ],
      "E": [
        {
          "name": "Charm",
          "description": "Ahri blows a kiss that damages and charms an enemy it encounters, instantly stopping movement abilities and causing them to walk harmlessly towards her."
        }
      ],
      "R": [
        {
          "name": "Spirit Rush",
          "description": "Ahri dashes forward and fires essence bolts, damaging nearby enemies. Spirit Rush can be cast up to three times before going on cooldown, and gains additional recasts when taking down enemy champions."
        }
      ]
    }
  },
  "akali": {
    "fullName": "Akali, the Rogue Assassin",
    "title": "the Rogue Assassin",
    "id": "akali",
    "name": "Akali",
    "abilities": {
      "P": [
        {
          "name": "Assassin's Mark",
          "description": "Dealing spell damage to a champion creates a ring of energy around them. Exiting that ring empowers Akali's next autoattack with bonus range and damage."
        }
      ],
      "Q": [
        {
          "name": "Five Point Strike",
          "description": "Akali throws out five kunai, dealing damage depending on her bonus attack damage and ability power and slowing."
        }
      ],
      "W": [
        {
          "name": "Twilight Shroud",
          "description": "Akali drops a cover of smoke and briefly gains movement speed. While inside the shroud, Akali becomes invisible and unable to be selected by enemy spells and attacks. Attacking or using abilities will briefly reveal her."
        }
      ],
      "E": [
        {
          "name": "Shuriken Flip",
          "description": "Flip backward and fire a shuriken forward, dealing magic damage. The first enemy or smoke cloud hit is marked. Re-cast to dash to the marked target, dealing additional damage."
        }
      ],
      "R": [
        {
          "name": "Perfect Execution",
          "description": "Akali leaps in a direction, damaging enemies she strikes. Re-cast: Akali dashes in a direction, executing all enemies she strikes."
        }
      ]
    }
  },
  "akshan": {
    "fullName": "Akshan, the Rogue Sentinel",
    "title": "the Rogue Sentinel",
    "id": "akshan",
    "name": "Akshan",
    "abilities": {
      "P": [
        {
          "name": "Dirty Fighting",
          "description": "Every three hits from Akshan's attacks and abilities deals bonus damage and grants him a shield if the target was a champion. When Akshan attacks, he fires an additional attack for reduced damage. If he cancels the additional attack, he instead gains movement speed."
        }
      ],
      "Q": [
        {
          "name": "Avengerang",
          "description": "Akshan throws a boomerang that deals damage going out and coming back, extending its range each time it hits an enemy."
        }
      ],
      "W": [
        {
          "name": "Going Rogue",
          "description": "Akshan passively marks enemy champions as Scoundrels when they kill his ally champions. If Akshan kills a Scoundrel, he resurrects the allies they killed, gains bonus gold, and clears all marks. When activated, Akshan enters camouflage and gains movement speed and mana regeneration while moving towards Scoundrels. Akshan loses the camouflage quickly while he is not in brush or near terrain."
        }
      ],
      "E": [
        {
          "name": "Heroic Swing",
          "description": "Akshan fires a grappling hook into terrain then swings around it, repeatedly firing at the nearest enemy while swinging. He can jump off early or gets knocked off when colliding with champions or terrain."
        }
      ],
      "R": [
        {
          "name": "Comeuppance",
          "description": "Akshan locks onto an enemy champion and starts storing bullets. When released, he fires all stored bullets, dealing damage depending on missing health to the first champion, minion, or structure hit."
        }
      ]
    }
  },
  "alistar": {
    "fullName": "Alistar, the Minotaur",
    "title": "the Minotaur",
    "id": "alistar",
    "name": "Alistar",
    "abilities": {
      "P": [
        {
          "name": "Triumphant Roar",
          "description": "Alistar charges his roar by stunning or displacing enemy champions or when nearby enemies die. When fully charged he heals himself all nearby allied champions."
        }
      ],
      "Q": [
        {
          "name": "Pulverize",
          "description": "Alistar smashes the ground, dealing damage to nearby enemies and tossing them into the air."
        }
      ],
      "W": [
        {
          "name": "Headbutt",
          "description": "Alistar rams a target with his head, dealing damage and knocking the target back."
        }
      ],
      "E": [
        {
          "name": "Trample",
          "description": "Alistar tramples nearby enemy units, ignoring unit collision and gaining stacks if he damages an enemy champion. At full stacks Alistar's next basic attack against an enemy champion deals additional magic damage and stuns them."
        }
      ],
      "R": [
        {
          "name": "Unbreakable Will",
          "description": "Alistar lets out a wild roar, removing all crowd control effects on himself, and reducing incoming physical and magical damage for the duration."
        }
      ]
    }
  },
  "amumu": {
    "fullName": "Amumu, the Sad Mummy",
    "title": "the Sad Mummy",
    "id": "amumu",
    "name": "Amumu",
    "abilities": {
      "P": [
        {
          "name": "Cursed Touch",
          "description": "Amumu's basic attacks Curse his enemies, causing them to take bonus true damage from incoming magic damage."
        }
      ],
      "Q": [
        {
          "name": "Bandage Toss",
          "description": "Amumu tosses a sticky bandage at a target, stunning and damaging the target while he pulls himself to them."
        }
      ],
      "W": [
        {
          "name": "Despair",
          "description": "Overcome by anguish, nearby enemies lose a percentage of their maximum Health each second and have their Curses refreshed."
        }
      ],
      "E": [
        {
          "name": "Tantrum",
          "description": "Permanently reduces the physical damage Amumu would take. Amumu can unleash his rage, dealing damage to surrounding enemies. Each time Amumu is hit, the cooldown on Tantrum is reduced by half a second."
        }
      ],
      "R": [
        {
          "name": "Curse of the Sad Mummy",
          "description": "Amumu entangles surrounding enemy units in bandages, applying his Curse, damaging and stunning them."
        }
      ]
    }
  },
  "anivia": {
    "fullName": "Anivia, the Cryophoenix",
    "title": "the Cryophoenix",
    "id": "anivia",
    "name": "Anivia",
    "abilities": {
      "P": [
        {
          "name": "Rebirth",
          "description": "Upon dying, Anivia will revert into an egg. If the egg can survive for six seconds, she is gloriously reborn."
        }
      ],
      "Q": [
        {
          "name": "Flash Frost",
          "description": "Anivia brings her wings together and summons a sphere of ice that flies towards her opponents, chilling and damaging anyone in its path. When the sphere explodes it does moderate damage in a radius, stunning anyone in the area."
        }
      ],
      "W": [
        {
          "name": "Crystallize",
          "description": "Anivia condenses the moisture in the air into an impassable wall of ice to block all movement. The wall only lasts a short duration before it melts."
        }
      ],
      "E": [
        {
          "name": "Frostbite",
          "description": "With a flap of her wings, Anivia blasts a freezing gust of wind at her target, dealing damage. If the target was recently hit by Flash Frost or damaged by a fully formed Glacial Storm, the damage they take is doubled."
        }
      ],
      "R": [
        {
          "name": "Glacial Storm",
          "description": "Anivia summons a driving rain of ice and hail to damage her enemies and slow their advance."
        }
      ]
    }
  },
  "annie": {
    "fullName": "Annie, the Dark Child",
    "title": "the Dark Child",
    "id": "annie",
    "name": "Annie",
    "abilities": {
      "P": [
        {
          "name": "Pyromania",
          "description": "After casting 4 spells, Annie's next offensive spell will stun the target."
        }
      ],
      "Q": [
        {
          "name": "Disintegrate",
          "description": "Annie hurls a mana infused fireball, dealing damage and refunding the mana cost if it destroys the target."
        }
      ],
      "W": [
        {
          "name": "Incinerate",
          "description": "Annie casts a blazing cone of fire, dealing damage to all enemies in the area."
        }
      ],
      "E": [
        {
          "name": "Molten Shield",
          "description": "Grants Annie or an ally a shield, a burst of movement speed, and damages enemies who attack her with basic attacks."
        }
      ],
      "R": [
        {
          "name": "Summon: Tibbers",
          "description": "Annie wills her bear Tibbers to life, dealing damage to units in the area. Tibbers can attack and also burns enemies that stand near him."
        }
      ]
    }
  },
  "aphelios": {
    "fullName": "Aphelios, the Weapon of the Faithful",
    "title": "the Weapon of the Faithful",
    "id": "aphelios",
    "name": "Aphelios",
    "abilities": {
      "P": [
        {
          "name": "Calibrum, the Sniper Rifle",
          "description": "Passive: Aphelios gains bonus attack range. Abilities that use Calibrum mark targets for a few seconds, revealing them. Aphelios can attack a marked target from long range with his off-hand weapon, causing all nearby marks to be consumed, dealing additional physical damage each to the main target. When Calibrum is assigned, Aphelios can use Moonshot."
        },
        {
          "name": "Crescendum, the Chakram",
          "description": "Passive: Aphelios attacks ricochet off their target and back to Aphelios. Aphelios can attack again immediately after he catches the ricochet. Other abilities that use Crescendum create mirror Chakram which each deal bonus damage when Aphelios attacks. When Crescendum is assigned, Aphelios can use Sentry."
        },
        {
          "name": "Gravitum, the Gravity Cannon",
          "description": "Aphelios' attacks slow targets, decaying over a few seconds. When Gravitum is assigned, Aphelios can use Binding Eclipse."
        },
        {
          "name": "Infernum, the Flamethrower",
          "description": "Aphelios' attacks deal physical damage to the primary target and reduced damage to enemies behind them. This ability is reduced by against minions. When Infernum is assigned, Aphelios can use Duskwave."
        },
        {
          "name": "Severum, the Scythe Pistol",
          "description": "Severum Passive: Attacks and abilities using this weapon restores health. This weapon can heal Aphelios over his max health, granting him a shield for thirty seconds. When Severum is assigned, Aphelios can use Onslaught."
        },
        {
          "name": "The Hitman and the Seer",
          "description": "Aphelios wields 5 Lunari Weapons made by his sister Alune. He has access to two at a time: one main-hand and one off-hand. Each weapon has a unique basic attack and ability. Attacks and abilities consume a weapon's ammo. When out of ammo, Aphelios discards the weapon and Alune summons the next of the 5."
        }
      ],
      "Q": [
        {
          "name": "Binding Eclipse",
          "description": "Aphelios triggers a gravity field on enemies he has slowed with gravitum, rooting for a second and dealing magic damage."
        },
        {
          "name": "Duskwave",
          "description": "Aphelios spouts a wave of flame, dealing physical damage. Then he attacks each enemy hit with his off-hand weapon."
        },
        {
          "name": "Moonshot",
          "description": "Aphelios fires a long range shot, dealing physical damage to the first enemy hit and marking them."
        },
        {
          "name": "Onslaught",
          "description": "Aphelios gains bonus movement speed and fires both weapons at the nearest enemy for the next a few seconds. Deals physical damage over six shots, prioritizing champions."
        },
        {
          "name": "Sentry",
          "description": "Aphelios deploys a lunar sentry equipped with Aphelios' off-hand weapon that lasts for twenty seconds. Sentries activate when an enemy approaches and fire at them, dealing physical damage per shot over four seconds."
        }
      ],
      "W": [
        {
          "name": "Phase",
          "description": "Aphelios swaps between his main-hand and off-hand weapons."
        }
      ],
      "E": [],
      "R": [
        {
          "name": "Moonlight Vigil",
          "description": "Aphelios fires a concentrated blast of moonlight that explodes when it hits a champion, dealing physical damage to surrounding enemies. Then, Aphelios attacks all champions hit with his main-hand weapon, applies the unique effect of Aphelios' main-han weapon."
        },
        {
          "name": "Moonlight Vigil, Calibrum",
          "description": "Marks added this way deal additional physical damage each when consumed."
        },
        {
          "name": "Moonlight Vigil, Crescendum",
          "description": "Summons an additional 5 mirror Chakrams."
        },
        {
          "name": "Moonlight Vigil, Gravitum",
          "description": "Slow strength increased. Binding Eclipse's Root effect is increased against these targets."
        },
        {
          "name": "Moonlight Vigil, Infernum",
          "description": "The moonlight blast deals additional physical damage, and the subsequent attacks explode, each dealing a percentage of their damage to surrounding targets."
        },
        {
          "name": "Moonlight Vigil, Severum",
          "description": "Aphelios restores health when damaging targets."
        }
      ]
    }
  },
  "ashe": {
    "fullName": "Ashe, the Frost Archer",
    "title": "the Frost Archer",
    "id": "ashe",
    "name": "Ashe",
    "abilities": {
      "P": [
        {
          "name": "Frost Shot",
          "description": "Ashe's attacks slow their target, causing her to deal increased damage to these targets. Ashe's critical strikes deal no bonus damage but apply an empowered slow to the target."
        }
      ],
      "Q": [
        {
          "name": "Ranger's Focus",
          "description": "Ashe builds up Focus by attacking. At maximum Focus, Ashe can cast Ranger's Focus to consume all stacks of Focus, temporarily increasing her attack speed and transforming her basic attack into a powerful flurry attack for the duration."
        }
      ],
      "W": [
        {
          "name": "Volley",
          "description": "Ashe fires arrows in a cone for increased damage. Also applies Frost Shot."
        }
      ],
      "E": [
        {
          "name": "Hawkshot",
          "description": "Ashe sends her Hawk Spirit on a scouting mission anywhere on the map."
        }
      ],
      "R": [
        {
          "name": "Enchanted Crystal Arrow",
          "description": "Ashe fires a missile of ice in a straight line. If the arrow collides with an enemy champion, it deals damage and stuns the champion, stunning for longer the farther arrow has traveled. In addition, surrounding enemy units take damage and are slowed."
        }
      ]
    }
  },
  "aurelion_sol": {
    "fullName": "Aurelion Sol, The Star Forger",
    "title": "The Star Forger",
    "id": "aurelion_sol",
    "name": "Aurelion Sol",
    "abilities": {
      "P": [
        {
          "name": "Center of the Universe",
          "description": "Stars orbit Aurelion Sol, dealing magic damage when they hit an enemy."
        }
      ],
      "Q": [
        {
          "name": "Starsurge",
          "description": "Aurelion Sol creates an expanding disk, which explodes to stun and damage enemies when it moves too far away from him."
        }
      ],
      "W": [
        {
          "name": "Celestial Expansion",
          "description": "Aurelion Sol pushes his stars farther out, increasing their damage and speed."
        }
      ],
      "E": [
        {
          "name": "Comet of Legend",
          "description": "Aurelion Sol takes off flying for a long distance."
        }
      ],
      "R": [
        {
          "name": "Voice of Light",
          "description": "Aurelion Sol projects a blast of pure starfire, damaging and slowing all enemies caught in it and knocking nearby enemies back to a safer distance."
        }
      ]
    }
  },
  "azir": {
    "fullName": "Azir, the Emperor of the Sands",
    "title": "the Emperor of the Sands",
    "id": "azir",
    "name": "Azir",
    "abilities": {
      "P": [
        {
          "name": "Shurima's Legacy",
          "description": "Azir can summon the Disc of the Sun from the ruins of allied or enemy turrets."
        }
      ],
      "Q": [
        {
          "name": "Conquering Sands",
          "description": "Azir sends all Sand Soldiers towards a location. Sand Soldiers deal magic damage to enemies they pass through and apply a slow for a second."
        }
      ],
      "W": [
        {
          "name": "Arise!",
          "description": "Azir summons a Sand Soldier to attack nearby targets for him, replacing his basic attack against targets within the soldier's range. Their attacks deal magic damage to enemies in a line. Arise! also passively grants attack speed to Azir and his Sand Soldiers."
        }
      ],
      "E": [
        {
          "name": "Shifting Sands",
          "description": "Azir shields himself briefly and dashes to one of his Sand Soldiers, damaging enemies. If he hits an enemy champion, he instantly readies a new Sand Soldier for deployment and halts his dash."
        }
      ],
      "R": [
        {
          "name": "Emperor's Divide",
          "description": "Azir summons a wall of soldiers which charge forward, knocking back and damaging enemies."
        }
      ]
    }
  },
  "bard": {
    "fullName": "Bard, the Wandering Caretaker",
    "title": "the Wandering Caretaker",
    "id": "bard",
    "name": "Bard",
    "abilities": {
      "P": [
        {
          "name": "Traveler's Call",
          "description": "Meeps: Bard attracts lesser spirits that assist with his basic attacks to deal extra magic damage. When Bard has collected enough Chimes, his meeps will also deal damage in an area and slow enemies hit. Chimes: Ancient chimes randomly appear for Bard to collect. These grant experience, restore mana, and provide out of combat movement speed."
        }
      ],
      "Q": [
        {
          "name": "Cosmic Binding",
          "description": "Bard fires a missile which will slow the first enemy struck, and continue onward. If it strikes a wall, it will stun the initial target; if it strikes another enemy, it will stun them both."
        }
      ],
      "W": [
        {
          "name": "Caretaker's Shrine",
          "description": "Reveals a healing shrine which powers up over a short time, disappearing after healing and speeding up the first ally that touches it."
        }
      ],
      "E": [
        {
          "name": "Magical Journey",
          "description": "Bard opens a portal in nearby terrain. Allies and enemies alike can take a one-way trip through that terrain by moving into the portal."
        }
      ],
      "R": [
        {
          "name": "Tempered Fate",
          "description": "Bard sends spirit energy arcing to a location, putting all champions, minions, monsters, and turrets hit into stasis for a brief time."
        }
      ]
    }
  },
  "belveth": {
    "fullName": "Bel'Veth, The Empress of the Void",
    "title": "The Empress of the Void",
    "id": "belveth",
    "name": "Bel'Veth",
    "abilities": {
      "P": [
        {
          "name": "Death in Lavender",
          "description": "Bel'Veth gains permanent attack speed stacks after taking down large monsters and champions. She also gains temporary bonus attack speed after using an ability."
        }
      ],
      "Q": [
        {
          "name": "Void Surge",
          "description": "Bel'Veth dashes in a chosen direction and damages all enemies she passes through."
        }
      ],
      "W": [
        {
          "name": "Above and Below",
          "description": "Bel'Veth slams her tail to the ground, damaging, knocking up, and slowing her enemies."
        }
      ],
      "E": [
        {
          "name": "Royal Maelstrom",
          "description": "Bel'Veth roots herself in place, channeling a storm of slashes around her that targets the lowest-health enemy and grants her lifesteal and damage reduction."
        }
      ],
      "R": [
        {
          "name": "Endless Banquet",
          "description": "Bel'Veth consumes Void coral remnants, transforming into a her true form and increasing her max health, attack range, attack speed, and out-of-combat movement speed. Consuming the Void coral remnants of a Void epic monster will grant her a longer ultimate duration, as well as the power to summon Void remora."
        }
      ]
    }
  },
  "blitzcrank": {
    "fullName": "Blitzcrank, the Great Steam Golem",
    "title": "the Great Steam Golem",
    "id": "blitzcrank",
    "name": "Blitzcrank",
    "abilities": {
      "P": [
        {
          "name": "Mana Barrier",
          "description": "Blitzcrank gains a shield depending on his mana when dropping to low health."
        }
      ],
      "Q": [
        {
          "name": "Rocket Grab",
          "description": "Blitzcrank fires their right hand to grab an opponent on its path, dealing damage and dragging it back to them."
        }
      ],
      "W": [
        {
          "name": "Overdrive",
          "description": "Blitzcrank super charges themself to get dramatically increased movement and attack speed. They are temporarily slowed after the effect ends."
        }
      ],
      "E": [
        {
          "name": "Power Fist",
          "description": "Blitzcrank charges up their fist to make the next attack deal double damage and pop their target up in the air."
        }
      ],
      "R": [
        {
          "name": "Static Field",
          "description": "Enemies attacked by Blitzcrank are marked and take lightning damage after 1 second. Additionally, Blitzcrank can activate this ability to remove nearby enemies' shields, damage them, and silence them briefly."
        }
      ]
    }
  },
  "brand": {
    "fullName": "Brand, the Burning Vengeance",
    "title": "the Burning Vengeance",
    "id": "brand",
    "name": "Brand",
    "abilities": {
      "P": [
        {
          "name": "Blaze",
          "description": "Brand's spells light his targets ablaze, dealing damage over 4 seconds, stacking up to 3 times. If Brand kills an enemy while it is ablaze he regains mana. When Blaze reaches max stacks on a Champion or large monster, it becomes unstable. It detonates in 2 seconds, applying spell effects and dealing massive damage in an area around the victim."
        }
      ],
      "Q": [
        {
          "name": "Sear",
          "description": "Brand launches a ball of fire forward that deals magic damage. If the target is ablaze, Sear will stun the target for a few seconds."
        }
      ],
      "W": [
        {
          "name": "Pillar of Flame",
          "description": "After a short delay, Brand creates a Pillar of Flame at a target area, dealing magic damage to enemy units within the area. Units that are ablaze takes additional magic damage."
        }
      ],
      "E": [
        {
          "name": "Conflagration",
          "description": "Brand conjures a powerful blast at his target that spreads to nearby enemies, dealing magic damage. If the target is ablaze, Conflagration's spread is doubled."
        }
      ],
      "R": [
        {
          "name": "Pyroclasm",
          "description": "Brand unleashes a devastating torrent of fire that bounces up to 5 times off of Brand and nearby enemies, dealing magic damage to enemies each time bounce. Bounces prioritize stacking Blaze to max on Champions. If a target is ablaze, Pyroclasm will briefly slow them."
        }
      ]
    }
  },
  "braum": {
    "fullName": "Braum, the Heart of the Freljord",
    "title": "the Heart of the Freljord",
    "id": "braum",
    "name": "Braum",
    "abilities": {
      "P": [
        {
          "name": "Concussive Blows",
          "description": "Braum's basic attacks apply Concussive Blows. Once the first stack is applied, ally basic attacks also stack Concussive Blows. Upon reaching 4 stacks, the target is stunned and takes magic damage. For the next few seconds they cannot receive new stacks, but take bonus magic damage from Braum's attacks."
        }
      ],
      "Q": [
        {
          "name": "Winter's Bite",
          "description": "Braum propels freezing ice from his shield, slowing and dealing magic damage. Applies a stack of Concussive Blows."
        }
      ],
      "W": [
        {
          "name": "Stand Behind Me",
          "description": "Braum leaps to the aid of a nearby ally, positioning himself between his target and their nearest enemy champion. On arrival, Braum and the ally gain both bonus armor and magic resist for 3 seconds."
        }
      ],
      "E": [
        {
          "name": "Unbreakable",
          "description": "Braum raises his shield in a direction for several seconds, intercepting all projectiles causing them to hit him and be destroyed. He negates the damage of the first attack completely and reduces the damage of all subsequent attacks from this direction."
        }
      ],
      "R": [
        {
          "name": "Glacial Fissure",
          "description": "Braum slams the ground, knocking up enemies nearby and in a line in front of him. A fissure is left along the line that slows enemies."
        }
      ]
    }
  },
  "caitlyn": {
    "fullName": "Caitlyn, the Sheriff of Piltover",
    "title": "the Sheriff of Piltover",
    "id": "caitlyn",
    "name": "Caitlyn",
    "abilities": {
      "P": [
        {
          "name": "Headshot",
          "description": "Every few basic attacks, or against a target she has trapped or netted, Caitlyn will fire a headshot dealing bonus damage that scales with her critical strike chance. On trapped or netted targets, Caitlyn's Headshot attack range is doubled."
        }
      ],
      "Q": [
        {
          "name": "Piltover Peacemaker",
          "description": "Caitlyn revs up her rifle for a second to unleash a penetrating shot that deals physical damage (deals less damage to subsequent targets)."
        }
      ],
      "W": [
        {
          "name": "Yordle Snap Trap",
          "description": "Caitlyn sets a trap to find sneaky yordles. When sprung, the trap reveals and immobilizes the enemy champion for a few seconds, granting Caitlyn an empowered Headshot."
        }
      ],
      "E": [
        {
          "name": "90 Caliber Net",
          "description": "Caitlyn fires a heavy net to slow her target. The recoil knocks Caitlyn back."
        }
      ],
      "R": [
        {
          "name": "Ace in the Hole",
          "description": "Caitlyn takes time to line up the perfect shot, dealing massive damage to a single target at a huge range. Enemy champions can intercept the bullet for their ally."
        }
      ]
    }
  },
  "camille": {
    "fullName": "Camille, the Steel Shadow",
    "title": "the Steel Shadow",
    "id": "camille",
    "name": "Camille",
    "abilities": {
      "P": [
        {
          "name": "Adaptive Defenses",
          "description": "Basic attacks on champions grant a shield equal to a percentage of Camille's maximum health against their damage type (physical or magic) for a brief duration."
        }
      ],
      "Q": [
        {
          "name": "Precision Protocol",
          "description": "Camille's next attack deals bonus damage and grants bonus movement speed. This spell can be recast for a short period of time, doing significantly increased bonus damage if Camille delays a period of time between the two attacks."
        }
      ],
      "W": [
        {
          "name": "Tactical Sweep",
          "description": "Camille blasts in a cone after a delay, dealing damage. Enemies in the outer half are slowed and take extra damage, while also healing Camille."
        }
      ],
      "E": [
        {
          "name": "Hookshot",
          "description": "Camille pulls herself to a wall, gaining the ability to cast Wall Dive."
        },
        {
          "name": "Hookshot / Wall Dive",
          "description": "Camille pulls herself to a wall, leaping off and knocking up enemy champions upon landing."
        },
        {
          "name": "Wall Dive",
          "description": "Camille leaps off of a wall, dealing damage and knocks up enemies upon landing."
        }
      ],
      "R": [
        {
          "name": "Hextech Ultimatum",
          "description": "Camille dashes to target champion, anchoring them to the area. She also deals bonus magic damage to the target with her basic attacks."
        }
      ]
    }
  },
  "cassiopeia": {
    "fullName": "Cassiopeia, the Serpent's Embrace",
    "title": "the Serpent's Embrace",
    "id": "cassiopeia",
    "name": "Cassiopeia",
    "abilities": {
      "P": [
        {
          "name": "Serpentine Grace",
          "description": "Cassiopeia gains movement speed per level, but she cannot purchase Boots."
        }
      ],
      "Q": [
        {
          "name": "Noxious Blast",
          "description": "Cassiopeia blasts an area with Poison after a brief delay, granting her increased movement speed if she hits an enemy champion."
        }
      ],
      "W": [
        {
          "name": "Miasma",
          "description": "Cassiopeia releases several clouds of poison, slowing, grounding, and lightly damaging enemies that pass through them. Grounded enemies cannot use movement abilities."
        }
      ],
      "E": [
        {
          "name": "Twin Fang",
          "description": "Cassiopeia lets loose an attack that deals increased damage to Poisoned targets and heals her for a percentage of the damage dealt. If the target dies from this attack, Cassiopeia regains mana."
        }
      ],
      "R": [
        {
          "name": "Petrifying Gaze",
          "description": "Cassiopeia releases a swirl of magical energy from her eyes, stunning any enemies in front of her that are facing her and slowing any others with their back turned."
        }
      ]
    }
  },
  "chogath": {
    "fullName": "Cho'Gath, the Terror of the Void",
    "title": "the Terror of the Void",
    "id": "chogath",
    "name": "Cho'Gath",
    "abilities": {
      "P": [
        {
          "name": "Carnivore",
          "description": "Whenever Cho'Gath kills a unit, he recovers health and mana. The values restored increase with Cho'Gath's level."
        }
      ],
      "Q": [
        {
          "name": "Rupture",
          "description": "Ruptures the ground at target location, popping enemy units into the air, dealing damage and slowing them."
        }
      ],
      "W": [
        {
          "name": "Feral Scream",
          "description": "Cho'Gath unleashes a terrible scream at enemies in a cone, dealing magic damage and silencing enemies for a few seconds."
        }
      ],
      "E": [
        {
          "name": "Vorpal Spikes",
          "description": "Cho'Gath's attacks release deadly spikes, dealing damage and slowing all enemy units in front of him."
        }
      ],
      "R": [
        {
          "name": "Feast",
          "description": "Devours an enemy unit, dealing a high amount of true damage. If the target is killed, Cho'Gath grows, gaining maximum health."
        }
      ]
    }
  },
  "corki": {
    "fullName": "Corki, the Daring Bombardier",
    "title": "the Daring Bombardier",
    "id": "corki",
    "name": "Corki",
    "abilities": {
      "P": [
        {
          "name": "Hextech Munitions",
          "description": "A percentage of Corki's basic attack damage is converted into magic damage. Corki can occasionally retrieve The Package inside his base, granting him movement speed and an empowered cast of Valkyrie."
        }
      ],
      "Q": [
        {
          "name": "Phosphorus Bomb",
          "description": "Corki fires a flash bomb at a target location, dealing magic damage to enemies in the area. This attack additionally reveals units in the area for a duration."
        }
      ],
      "W": [
        {
          "name": "Valkyrie",
          "description": "Corki flies a short distance, dropping bombs that create a trail of fire that damages opponents who remain in it."
        }
      ],
      "E": [
        {
          "name": "Gatling Gun",
          "description": "Corki's gatling gun rapidly fires in a cone in front of him, dealing damage and reducing enemy armor and magic resist."
        }
      ],
      "R": [
        {
          "name": "Missile Barrage",
          "description": "Corki fires a missile toward his target location that explodes on impact, dealing damage to enemies in an area. Corki stores missiles over time, up to a maximum. Every 3rd missile fired will be a big one, dealing extra damage."
        }
      ]
    }
  },
  "darius": {
    "fullName": "Darius, the Hand of Noxus",
    "title": "the Hand of Noxus",
    "id": "darius",
    "name": "Darius",
    "abilities": {
      "P": [
        {
          "name": "Hemorrhage",
          "description": "Darius' attacks and damaging abilities cause enemies to bleed for physical damage over 5 seconds, stacking up to 5 times. Darius enrages and gains massive attack damage when his target reaches max stacks."
        },
        {
          "name": "Noxian Might",
          "description": "Once reaching 5 stacks, Darius enrages and gains massive attack damage when his target reaches max stacks."
        }
      ],
      "Q": [
        {
          "name": "Decimate",
          "description": "Darius winds up and swings his axe in a wide circle. Enemies struck by the blade take more damage than those struck by the handle. Darius heals depending on enemy champions and large monsters hit by the blade."
        }
      ],
      "W": [
        {
          "name": "Crippling Strike",
          "description": "Darius's next attack strikes an enemy's crucial artery. As they bleed out, their movement speed is slowed."
        }
      ],
      "E": [
        {
          "name": "Apprehend",
          "description": "Darius hones his axe, passively causing his physical damage to ignore a percentage of his target's armor. When activated, Darius sweeps up his enemies with his axe's hook and pulls them to him."
        }
      ],
      "R": [
        {
          "name": "Noxian Guillotine",
          "description": "Darius leaps to an enemy champion and strikes a lethal blow, dealing true damage. This damage is increased for each stack of Hemorrhage on the target. If Noxian Guillotine is a killing blow, its cooldown is refreshed for a brief duration."
        }
      ]
    }
  },
  "diana": {
    "fullName": "Diana, Scorn of the Moon",
    "title": "Scorn of the Moon",
    "id": "diana",
    "name": "Diana",
    "abilities": {
      "P": [
        {
          "name": "Moonsilver Blade",
          "description": "Every third strike cleaves nearby enemies for an additional magic damage. After casting a spell, Diana gains attack speed for her next 3 attacks."
        }
      ],
      "Q": [
        {
          "name": "Crescent Strike",
          "description": "Unleashes a bolt of lunar energy in an arc dealing magic damage. Afflicts enemies struck with Moonlight, revealing them if they are not stealthed for 3 seconds."
        }
      ],
      "W": [
        {
          "name": "Pale Cascade",
          "description": "Diana creates three orbiting spheres that detonate on contact with enemies to deal damage in an area. She also gains a temporary shield that absorbs damage. If her third sphere detonates, the shield gains additional strength."
        }
      ],
      "E": [
        {
          "name": "Lunar Rush",
          "description": "Becomes the living embodiment of the vengeful moon, dashing to an enemy and dealing magic damage. Lunar Rush has no cooldown when used to dash to an enemy afflicted with Moonlight. All other enemies will have the Moonlight debuff removed regardless of whether they were the target of Lunar Rush."
        }
      ],
      "R": [
        {
          "name": "Moonfall",
          "description": "Diana reveals and draws in all nearby enemies and slows them. If Diana pulls in one or more enemy champions, the moonlight crashes down onto her after a short delay, dealing magic damage in an area around her, increased for each target beyond the first pulled."
        }
      ]
    }
  },
  "dr_mundo": {
    "fullName": "Dr. Mundo, the Madman of Zaun",
    "title": "the Madman of Zaun",
    "id": "dr_mundo",
    "name": "Dr. Mundo",
    "abilities": {
      "P": [
        {
          "name": "Goes Where He Pleases",
          "description": "Dr. Mundo resists the first Immobilizing effect that hits thim, instead losing health and dropping a chemical cannister nearby. Dr. Mundo can pick it up by walking over it, restoring health and reducing this ability's cooldown. Dr. Mundo also has significantly increased Health Regeneration."
        }
      ],
      "Q": [
        {
          "name": "Infected Bonesaw",
          "description": "Dr. Mundo throws an infected bonesaw, dealing damage to the first enemy hit depending on their current health and slowing them."
        }
      ],
      "W": [
        {
          "name": "Heart Zapper",
          "description": "Dr. Mundo electrocutes himself, dealing persistent damage to nearby enemies and storing a portion of damage he takes. At the end of the duration or on Recast, Dr. Mundo deals a burst of damage to nearby enemies. If the burst hit an enemy, he heals a percentage of the stored damage."
        }
      ],
      "E": [
        {
          "name": "Blunt Force Trauma",
          "description": "Passive: Dr. Mundo gains bonus attack damage, increasing depending on his missing health. Active: Dr. Mundo slams his “medical” bag into an enemy, dealing additional damage depending on his missing health. If the enemy dies they are swatted away, dealing damage to enemies they pass through."
        }
      ],
      "R": [
        {
          "name": "Maximum Dosage",
          "description": "Dr. Mundo pumps himself with chemicals, instantly healing a percent of his missing health. He then gains bonus attack damage and movement speed, and regenerates a portion of his maximum health over a long duration."
        }
      ]
    }
  },
  "draven": {
    "fullName": "Draven, the Glorious Executioner",
    "title": "the Glorious Executioner",
    "id": "draven",
    "name": "Draven",
    "abilities": {
      "P": [
        {
          "name": "League of Draven",
          "description": "Draven gains his fans' Adoration when he catches a Spinning Axe or kills a minion, monster, or tower. Killing enemy champions grants Draven bonus gold depending on how much Adoration he has."
        }
      ],
      "Q": [
        {
          "name": "Spinning Axe",
          "description": "Draven's next attack will deal bonus physical damage. This axe will ricochet off the target high up into the air. If Draven catches it, he automatically readies another Spinning Axe. Draven can have two Spinning Axes at once."
        }
      ],
      "W": [
        {
          "name": "Blood Rush",
          "description": "Draven gains increased movement speed and attack speed. The movement speed bonus decreases rapidly over its duration. Catching a Spinning Axe will refresh the cooldown of Blood Rush."
        }
      ],
      "E": [
        {
          "name": "Stand Aside",
          "description": "Draven throws his axes, dealing physical damage to targets hit and knocking them aside. Targets hit are slowed."
        }
      ],
      "R": [
        {
          "name": "Whirling Death",
          "description": "Draven hurls two massive axes to deal physical damage to each unit struck. Whirling Death slowly reverses direction and returns to Draven after striking an enemy champion. Draven may also activate this ability while the axes are in flight to cause it to return early. Deals less damage for each unit hit and resets when the axes reverse direction. Executes enemies who have less health than Draven's number of Adoration stacks."
        }
      ]
    }
  },
  "ekko": {
    "fullName": "Ekko, the Boy Who Shattered Time",
    "title": "the Boy Who Shattered Time",
    "id": "ekko",
    "name": "Ekko",
    "abilities": {
      "P": [
        {
          "name": "Z-Drive Resonance",
          "description": "Every third attack or damaging spell on the same target deals bonus magic damage, and grants Ekko a burst of speed if the target is a champion."
        }
      ],
      "Q": [
        {
          "name": "Timewinder",
          "description": "Ekko throws a temporal grenade that expands into a time-distortion field upon hitting an enemy champion, slowing and damaging anyone caught inside. After a delay, the grenade rewinds back to Ekko, dealing damage on its return."
        }
      ],
      "W": [
        {
          "name": "Parallel Convergence",
          "description": "Ekko's basic attacks deal bonus magic damage to low health enemies. He can cast Parallel Convergence to split the timeline, creating an anomaly after a few seconds that slows enemies caught inside. If Ekko enters the anomaly, he gains shielding and stuns enemies by suspending them in time."
        }
      ],
      "E": [
        {
          "name": "Phase Dive",
          "description": "Ekko rolls evasively while charging up his Z-Drive. His next attack deals bonus damage and warps reality, teleporting him to his target."
        }
      ],
      "R": [
        {
          "name": "Chronobreak",
          "description": "Ekko shatters his timeline, becoming untargetable and rewinding to a more favorable point in time. He returns to whenever he was a few seconds ago, and heals for a percentage of the damage received in that duration. Enemies near his arrival zone take massive damage."
        }
      ]
    }
  },
  "elise": {
    "fullName": "Elise, the Spider Queen",
    "title": "the Spider Queen",
    "id": "elise",
    "name": "Elise",
    "abilities": {
      "P": [
        {
          "name": "Spider Queen",
          "description": "Human Form: When Elise's abilities hit an enemy, she gains a dormant Spiderling. Spider Form: Basic attacks deal bonus magic damage and restore health to Elise."
        }
      ],
      "Q": [
        {
          "name": "Neurotoxin",
          "description": "Deals damage depending upon how high the target's health is."
        },
        {
          "name": "Neurotoxin / Venomous Bite",
          "description": "Neurotoxin: Elise fires toxin at the target enemy, dealing magic damage, capped against monsters. Venomous Bite: Pounces at the target enemy with her fangs and bites them, dealing magic damage, capped against monsters, and applying on-hit effects. If there are active Spiderlings or Volatile Spiderlings nearby, they will dash alongside Elise towards Venomous Bite's target and reprioritize them."
        },
        {
          "name": "Venomous Bite",
          "description": "Pounces at the target enemy with her fangs and bites them, dealing magic damage, capped against monsters, and applying on-hit effects."
        }
      ],
      "W": [
        {
          "name": "Skittering Frenzy",
          "description": "Elise and her Spiderlings gain attack speed."
        },
        {
          "name": "Volatile Spiderling",
          "description": "Releases a venom-gorged Spiderling that explodes when it nears a target."
        },
        {
          "name": "Volatile Spiderling / Skittering Frenzy",
          "description": "Human Form: Releases a venom-gorged Spiderling that explodes when it nears a target. Spider Form: Elise and her Spiderlings gain attack speed."
        }
      ],
      "E": [
        {
          "name": "Cocoon",
          "description": "Stuns the first enemy unit hit and reveals them if they are not stealthed."
        },
        {
          "name": "Cocoon / Rappel",
          "description": "Human Form: Stuns the first enemy unit hit and reveals them if they are not stealthed. Spider Form: Elise and her Spiderlings ascend into the air and then descend upon target enemy. After descending on an enemy target, Elise's bonus damage and healing from Spider Queen is increased."
        },
        {
          "name": "Rappel",
          "description": "Elise and her Spiderlings ascend into the air and then descend upon target enemy. After descending on an enemy target, Elise's bonus damage and healing from Spider Queen is increased."
        }
      ],
      "R": [
        {
          "name": "Human Form",
          "description": "Elise returns to Human Form and all remaining Spiderlings become dormant. Spiderlings deal magic damage and take reduced damage from multi-target abilities."
        },
        {
          "name": "Spider Form",
          "description": "Transforms into a menacing spider, reducing her attack range in exchange for movement speed, new abilities, and a Spiderling swarm that will attack her foes."
        },
        {
          "name": "Spider Form / Human Form",
          "description": "Human Form: Transforms into a menacing spider, reducing her attack range in exchange for movement speed, new abilities, and a Spiderling swarm that will attack her foes. Spider Form: Elise returns to Human Form and all remaining Spiderlings become dormant. Spiderlings deal magic damage and take reduced damage from multi-target abilities."
        }
      ]
    }
  },
  "evelynn": {
    "fullName": "Evelynn, Agony's Embrace",
    "title": "Agony's Embrace",
    "id": "evelynn",
    "name": "Evelynn",
    "abilities": {
      "P": [
        {
          "name": "Demon Shade",
          "description": "When out of combat, Evelynn enters Demon Shade. Demon Shade heals Evelynn when she is low on health and grants Camouflage after level 6."
        }
      ],
      "Q": [
        {
          "name": "Hate Spike",
          "description": "Evelynn strikes out with her Lasher, dealing damage to the first unit hit. Then, Evelynn can shoot a line of spikes at nearby foes up to 3 times."
        }
      ],
      "W": [
        {
          "name": "Allure",
          "description": "Evelynn curses her target, causing her next attack or spell after a delay to charm her target and reduce their magic resist."
        }
      ],
      "E": [
        {
          "name": "Empowered Whiplash",
          "description": "Evelynn whips her target with her Lasher, dealing damage. She then gains Move Speed for a short duration."
        },
        {
          "name": "Whiplash",
          "description": "Evelynn whips her target with her Lasher, dealing damage. She then gains movement speed for a short duration."
        }
      ],
      "R": [
        {
          "name": "Last Caress",
          "description": "Evelynn briefly goes untargetable and decimates the area in front of her before warping backwards a long distance."
        }
      ]
    }
  },
  "ezreal": {
    "fullName": "Ezreal, the Prodigal Explorer",
    "title": "the Prodigal Explorer",
    "id": "ezreal",
    "name": "Ezreal",
    "abilities": {
      "P": [
        {
          "name": "Rising Spell Force",
          "description": "Ezreal gains increasing attack speed each time he successfully hits a spell, stacking up to 5 times."
        }
      ],
      "Q": [
        {
          "name": "Mystic Shot",
          "description": "Ezreal fires a damaging bolt of energy which reduces all of his cooldowns slightly if it strikes an enemy unit."
        }
      ],
      "W": [
        {
          "name": "Essence Flux",
          "description": "Ezreal fires an orb that sticks to the first champion or objective hit. If Ezreal hits an enemy with the orb, it detonates and deals damage."
        }
      ],
      "E": [
        {
          "name": "Arcane Shift",
          "description": "Ezreal teleports to a target nearby location and fires a homing bolt which strikes the nearest enemy unit. Prioritizes enemies stuck with Essence Flux."
        }
      ],
      "R": [
        {
          "name": "Trueshot Barrage",
          "description": "Ezreal winds up before firing a powerful barrage of energy that deals massive damage to each unit it passes through (damage is reduced for minions and non-epic monsters)."
        }
      ]
    }
  },
  "fiddlesticks": {
    "fullName": "Fiddlesticks, the Ancient Fear",
    "title": "the Ancient Fear",
    "id": "fiddlesticks",
    "name": "Fiddlesticks",
    "abilities": {
      "P": [
        {
          "name": "A Harmless Scarecrow",
          "description": "Fiddlesticks' trinket is replaced by scarecrow effigies."
        }
      ],
      "Q": [
        {
          "name": "Terrify",
          "description": "Fiddlesticks damaging enemies with spells while unseen or targeting an enemy with Terrify's activation strikes a target unit with fear, causing it to flee in terror for a duration."
        }
      ],
      "W": [
        {
          "name": "Bountiful Harvest",
          "description": "Fiddlesticks drains health from nearby enemies, dealing bonus execute damage at the end of the duration."
        }
      ],
      "E": [
        {
          "name": "Reap",
          "description": "Fiddlesticks slashes an area with its scythe, slowing all enemies hit and silencing enemies hit in the center of the slash."
        }
      ],
      "R": [
        {
          "name": "Crowstorm",
          "description": "A murder of crows flock wildly around Fiddlesticks, dealing damage per second to all enemy units in the area."
        }
      ]
    }
  },
  "fiora": {
    "fullName": "Fiora, the Grand Duelist",
    "title": "the Grand Duelist",
    "id": "fiora",
    "name": "Fiora",
    "abilities": {
      "P": [
        {
          "name": "Duelist's Dance",
          "description": "Fiora challenges nearby enemy Champions to dodge her. She calls out a direction from which she will try to strike. If she can complete her own challenge, she receives a small bonus and calls out a new direction."
        }
      ],
      "Q": [
        {
          "name": "Lunge",
          "description": "Fiora lunges in a direction and stabs a nearby enemy, dealing physical damage and applying on-hit effects."
        }
      ],
      "W": [
        {
          "name": "Riposte",
          "description": "Fiora parries all incoming damage and disables for a short time, then stabs in a direction. This stab slows the first enemy champion hit, or stuns them if Fiora blocked an immobilizing effect with this ability."
        }
      ],
      "E": [
        {
          "name": "Bladework",
          "description": "Fiora has increased attack speed for the next two attacks. The first attack slows the target, and the second attack will critically strike."
        }
      ],
      "R": [
        {
          "name": "Grand Challenge",
          "description": "Fiora reveals all four Vitals on an enemy champion and gains movement speed while near them. If Fiora hits all 4 Vitals or if the target dies after she has hit at least one, Fiora and her allies in the area are healed over the next few seconds."
        }
      ]
    }
  },
  "fizz": {
    "fullName": "Fizz, the Tidal Trickster",
    "title": "the Tidal Trickster",
    "id": "fizz",
    "name": "Fizz",
    "abilities": {
      "P": [
        {
          "name": "Nimble Fighter",
          "description": "Fizz can move through units and takes a flat amount of reduced damage from all sources."
        }
      ],
      "Q": [
        {
          "name": "Urchin Strike",
          "description": "Fizz dashes through his target, dealing magic damage and applying on hit effects."
        }
      ],
      "W": [
        {
          "name": "Seastone Trident",
          "description": "Fizz's attacks bleed his enemies, dealing magic damage over several seconds. Fizz can empower his next attack to deal bonus damage and empower his further attacks for a short time."
        }
      ],
      "E": [
        {
          "name": "Playful / Trickster",
          "description": "Fizz hops into the air, landing gracefully upon his spear and becoming untargetable. From this position, Fizz can either slam the ground or choose to jump again before smashing back down."
        }
      ],
      "R": [
        {
          "name": "Chum the Waters",
          "description": "Fizz tosses a fish in a direction that attaches to any champion that touches it, slowing the target. After a short delay, a shark erupts from the ground, knocking up the target and knocking any nearby enemies aside. All enemies hit are dealt magic damage and slowed."
        }
      ]
    }
  },
  "galio": {
    "fullName": "Galio, the Colossus",
    "title": "the Colossus",
    "id": "galio",
    "name": "Galio",
    "abilities": {
      "P": [
        {
          "name": "Colossal Smash",
          "description": "Every few seconds, Galio's next basic attack deals bonus magic damage in an area."
        }
      ],
      "Q": [
        {
          "name": "Winds of War",
          "description": "Galio fires two windblasts that converge into a large tornado that deals damage over time."
        }
      ],
      "W": [
        {
          "name": "Shield of Durand",
          "description": "Galio charges a defensive stance, moving slowly. Upon releasing the charge, Galio will taunt and damage nearby enemies."
        }
      ],
      "E": [
        {
          "name": "Justice Punch",
          "description": "Galio will briefly step back and charge, knocking up the first enemy champion he encounters."
        }
      ],
      "R": [
        {
          "name": "Hero's Entrance",
          "description": "Galio designates an ally's position as his landing spot, granting all allies in the area a magic shield. After a delay Galio smashes down location, knocking up nearby enemies."
        }
      ]
    }
  },
  "gangplank": {
    "fullName": "Gangplank, the Saltwater Scourge",
    "title": "the Saltwater Scourge",
    "id": "gangplank",
    "name": "Gangplank",
    "abilities": {
      "P": [
        {
          "name": "Trial By Fire",
          "description": "Every few seconds, Gangplank's melee strike will set his opponent on fire."
        }
      ],
      "Q": [
        {
          "name": "Parrrley",
          "description": "Shoots target, plundering gold for each enemy unit killed."
        }
      ],
      "W": [
        {
          "name": "Remove Scurvy",
          "description": "Eats citrus to cure crowd control effects and restore health."
        }
      ],
      "E": [
        {
          "name": "Powder Keg",
          "description": "Gangplank uncovers a powder keg at target location. If he attacks it, it explodes, spreading the attack's damage to enemies in the area, slowing them."
        }
      ],
      "R": [
        {
          "name": "Cannon Barrage",
          "description": "Gangplank signals his ship to bombard an area, slowing and damaging enemies."
        }
      ]
    }
  },
  "garen": {
    "fullName": "Garen, The Might of Demacia",
    "title": "The Might of Demacia",
    "id": "garen",
    "name": "Garen",
    "abilities": {
      "P": [
        {
          "name": "Perseverance",
          "description": "If Garen has not recently been struck by damage or enemy abilities, he regenerates a percentage of his total health each second."
        }
      ],
      "Q": [
        {
          "name": "Decisive Strike",
          "description": "Garen gains a burst of movement speed, breaking free of all slows affecting him. His next attack strikes a vital area of his foe, dealing bonus damage and silencing them."
        }
      ],
      "W": [
        {
          "name": "Courage",
          "description": "Garen passively increases his armor and magic resist by killing enemies. He may also activate this ability to give him a shield and tenacity for a brief moment followed by a lesser amount of damage reduction for a longer duration."
        }
      ],
      "E": [
        {
          "name": "Judgment",
          "description": "Garen rapidly spins his sword around his body, dealing physical damage to nearby enemies."
        }
      ],
      "R": [
        {
          "name": "Demacian Justice",
          "description": "Garen calls upon the might of Demacia to attempt to execute an enemy champion."
        }
      ]
    }
  },
  "gnar": {
    "fullName": "Gnar, the Missing Link",
    "title": "the Missing Link",
    "id": "gnar",
    "name": "Gnar",
    "abilities": {
      "P": [
        {
          "name": "Rage Gene",
          "description": "While in combat Gnar generates Rage. At maximum Rage his next ability will transform him into Mega Gnar, granting increased survivability and access to new spells."
        }
      ],
      "Q": [
        {
          "name": "Boomerang Throw",
          "description": "Gnar throws a boomerang that damages and slows enemies it hits before returning to him. If he catches the boomerang its cooldown is reduced."
        },
        {
          "name": "Boomerang Throw / Boulder Toss",
          "description": "Gnar throws a boomerang that damages and slows enemies it hits before returning to him. If he catches the boomerang its cooldown is reduced. Mega Gnar instead throws a boulder that stops on the first unit hit, damaging and slowing everything nearby. It can then be picked up to reduce the cooldown."
        },
        {
          "name": "Boulder Toss",
          "description": "Throws a boulder that stops on the first unit hit, damaging and slowing everything nearby. It can then be picked up to reduce the cooldown."
        }
      ],
      "W": [
        {
          "name": "Hyper",
          "description": "Gnar's attacks and spells hype him up, dealing bonus damage and granting him movement speed."
        },
        {
          "name": "Hyper / Wallop",
          "description": "Gnar's attacks and spells hype him up, dealing bonus damage and granting him movement speed. Mega Gnar is too enraged to be hyper and instead can rear up on his hind legs and smash down on the area in front of him, stunning enemies in an area."
        },
        {
          "name": "Wallop",
          "description": "Mega Gnar is too enraged to be hyper and instead can rear up on his hind legs and smash down on the area in front of him, stunning enemies in an area."
        }
      ],
      "E": [
        {
          "name": "Crunch",
          "description": "Mega Gnar is too large to bounce and instead lands with earth-shattering force, dealing damage in an area around him."
        },
        {
          "name": "Hop",
          "description": "Gnar leaps to a location and bounces off the head of any unit he lands on, traveling further."
        },
        {
          "name": "Hop / Crunch",
          "description": "Gnar leaps to a location and bounces off the head of any unit he lands on, traveling further. Mega Gnar is too large to bounce and instead lands with earth-shattering force, dealing damage in an area around him."
        }
      ],
      "R": [
        {
          "name": "GNAR!",
          "description": "Mega Gnar throws everything around him in a chosen direction, dealing damage and slowing them. Any enemy that hits a wall is stunned and takes bonus damage."
        }
      ]
    }
  },
  "gragas": {
    "fullName": "Gragas, the Rabble Rouser",
    "title": "the Rabble Rouser",
    "id": "gragas",
    "name": "Gragas",
    "abilities": {
      "P": [
        {
          "name": "Happy Hour",
          "description": "Gragas periodically heals upon using a skill."
        }
      ],
      "Q": [
        {
          "name": "Barrel Roll",
          "description": "Gragas rolls his cask to a location, which can be activated to explode or will explode on its own after 4 seconds. The potency of the explosion increases over time. Enemies struck by the blast have their movement speed slowed."
        }
      ],
      "W": [
        {
          "name": "Drunken Rage",
          "description": "Gragas guzzles down brew from his cask for 1 second. After finishing, he becomes drunkenly empowered, dealing magic damage to all nearby enemies on his next basic attack and reducing damage received."
        }
      ],
      "E": [
        {
          "name": "Body Slam",
          "description": "Gragas charges to a location and collides with the first enemy unit he comes across, dealing damage to all nearby enemy units and stunning them."
        }
      ],
      "R": [
        {
          "name": "Explosive Cask",
          "description": "Gragas hurls his cask to a location, dealing damage and knocking back enemies caught in the blast radius."
        }
      ]
    }
  },
  "graves": {
    "fullName": "Graves, the Outlaw",
    "title": "the Outlaw",
    "id": "graves",
    "name": "Graves",
    "abilities": {
      "P": [
        {
          "name": "New Destiny",
          "description": "Graves' shotgun has some unique properties. He must reload when he runs out of ammo. Attacks fire 4 bullets, which cannot pass through units. Non-champions struck by multiple bullets are knocked back."
        }
      ],
      "Q": [
        {
          "name": "End of the Line",
          "description": "Graves fires an explosive shell that detonates after a few seconds, or 0.2 seconds if it strikes terrain."
        }
      ],
      "W": [
        {
          "name": "Smoke Screen",
          "description": "Graves fires a smoke canister at the target area creating a cloud of smoke that reduces sight range. Enemies caught in the initial impact are dealt magic damage and have their movement speed reduced briefly."
        }
      ],
      "E": [
        {
          "name": "Quickdraw",
          "description": "Graves dashes forward gaining an Armor boost for several seconds. If Graves dashes towards an enemy champion, gain two stacks of True Grit instead. Hitting enemies with basic attacks lowers the cooldown of this skill and refreshes the resistance boost."
        }
      ],
      "R": [
        {
          "name": "Collateral Damage",
          "description": "Graves fires an explosive shell dealing heavy damage to the first champion it hits. After hitting a champion or reaching the end of its range, the shell explodes dealing damage in a cone."
        }
      ]
    }
  },
  "gwen": {
    "fullName": "Gwen, The Hallowed Seamstress",
    "title": "The Hallowed Seamstress",
    "id": "gwen",
    "name": "Gwen",
    "abilities": {
      "P": [
        {
          "name": "Thousand Cuts",
          "description": "Gwen's attacks deal bonus magic damage depending on the targets health. She heals for a portion of the damage dealt to champions by this effect."
        }
      ],
      "Q": [
        {
          "name": "Snip Snip!",
          "description": "Gwen snips her scissors in a cone up to 6 times dealing magic damage. Gwen deals true damage to units in the center and applies her passive to them on each snip."
        }
      ],
      "W": [
        {
          "name": "Hallowed Mist",
          "description": "Gwen summons mist that protects her from enemies outside of it. She can only be targeted by enemies who enter the mist."
        }
      ],
      "E": [
        {
          "name": "Skip 'n Slash",
          "description": "Gwen dashes a short distance then gains attack speed, attack range, and magic damage on-hit for a few seconds. If she hits an enemy during that time, this ability's cooldown is partially refunded."
        }
      ],
      "R": [
        {
          "name": "Needlework",
          "description": "Gwen hurls a needle that slows enemies hit, deals magic damage, and applies A Thousand Cuts to champions hit. This ability can be cast up to two more times, with each cast throwing additional needles and dealing more damage. Gwen must hit an enemy between each cast to unlock the next one."
        }
      ]
    }
  },
  "hecarim": {
    "fullName": "Hecarim, the Shadow of War",
    "title": "the Shadow of War",
    "id": "hecarim",
    "name": "Hecarim",
    "abilities": {
      "P": [
        {
          "name": "Warpath",
          "description": "Hecarim gains attack damage equal to a percentage of his bonus movement speed."
        }
      ],
      "Q": [
        {
          "name": "Rampage",
          "description": "Hecarim cleaves nearby enemies dealing physical damage. If Hecarim damages at least one enemy, he increases the damage and lowers the cooldown of subsequent Rampages."
        }
      ],
      "W": [
        {
          "name": "Spirit of Dread",
          "description": "Hecarim deals magic damage to nearby enemies for a short duration. Hecarim gains Health equal to a percentage of any damage those enemies suffer."
        }
      ],
      "E": [
        {
          "name": "Devastating Charge",
          "description": "Hecarim gains increasing movement speed and can move through units for a short duration. His next attack knocks the target back and deals additional physical damage depending on the distance he has traveled since activating the ability."
        }
      ],
      "R": [
        {
          "name": "Onslaught of Shadows",
          "description": "Hecarim summons spectral riders and charges forward, dealing magic damage in a line. Hecarim creates a shockwave when he finishes his charge, causing nearby enemies to flee in terror."
        }
      ]
    }
  },
  "heimerdinger": {
    "fullName": "Heimerdinger, the Revered Inventor",
    "title": "the Revered Inventor",
    "id": "heimerdinger",
    "name": "Heimerdinger",
    "abilities": {
      "P": [
        {
          "name": "Hextech Affinity",
          "description": "Gain movement speed while near allied towers and turrets deployed by Heimerdinger."
        }
      ],
      "Q": [
        {
          "name": "H-28G Evolution Turret",
          "description": "Heimerdinger lays down a rapid-fire cannon turret equipped with a secondary pass-through beam attack (turrets deal half damage to towers)."
        },
        {
          "name": "H-28Q Apex Turret",
          "description": "Places a Turret that deals magic damage with its cannon and its beam for 8 seconds."
        }
      ],
      "W": [
        {
          "name": "Hextech Micro-Rockets",
          "description": "Heimerdinger fires long-range rockets that converge on his cursor."
        },
        {
          "name": "Hextech Rocket Swarm",
          "description": "Fires 4 waves that deal magic damage. Champions and monsters hit by multiple rockets take reduced damage."
        }
      ],
      "E": [
        {
          "name": "CH-2 Electron Storm Grenade",
          "description": "Heimerdinger lobs a grenade at a location, dealing damage to enemy units, as well as stunning anyone directly hit and slowing surrounding units."
        },
        {
          "name": "CH-3X Lightning Grenade",
          "description": "Throws a grenade that discharges three times, dealing magic damage and exploding in a larger area each time. Enemies hit are slowed by 80%."
        }
      ],
      "R": [
        {
          "name": "UPGRADE!!!",
          "description": "Heimerdinger invents an upgrade, causing his next spell to have increased effects."
        }
      ]
    }
  },
  "illaoi": {
    "fullName": "Illaoi, the Kraken Priestess",
    "title": "the Kraken Priestess",
    "id": "illaoi",
    "name": "Illaoi",
    "abilities": {
      "P": [
        {
          "name": "Prophet of an Elder God",
          "description": "Illaoi and the Vessels she creates, spawn Tentacles on nearby impassible terrain. Tentacles swing at spirits, Vessels and victims of Illaoi's Harsh lesson. Tentacles deal physical damage to enemies hit, and will heal Illaoi if they damage a champion."
        }
      ],
      "Q": [
        {
          "name": "Tentacle Smash",
          "description": "Increases the damage dealt by Tentacles. When activated, Illaoi smashes down a Tentacle that deals physical damage."
        }
      ],
      "W": [
        {
          "name": "Harsh Lesson",
          "description": "Illaoi leaps to her target, dealing physical damage and causing nearby Tentacles to also swing at the target."
        }
      ],
      "E": [
        {
          "name": "Test of Spirit",
          "description": "Illaoi rips the spirit from a foe's body, forcing it to stand before her. Spirits echo a percentage of the damage they take to the original target. If killed, or if the target gets too far from the spirit, the target will become a Vessel and begin spawning Tentacles."
        }
      ],
      "R": [
        {
          "name": "Leap of Faith",
          "description": "Illaoi smashes her idol into the ground, dealing physical damage to nearby enemies. A Tentacle spawns for each enemy champion hit."
        }
      ]
    }
  },
  "irelia": {
    "fullName": "Irelia, the Blade Dancer",
    "title": "the Blade Dancer",
    "id": "irelia",
    "name": "Irelia",
    "abilities": {
      "P": [
        {
          "name": "Ionian Fervor",
          "description": "When Irelia strikes enemies with spells she gains stacking bonus attack speed. At maximum stacks she also gains bonus damage on hit."
        }
      ],
      "Q": [
        {
          "name": "Bladesurge",
          "description": "Irelia dashes forward to strike her target, healing herself. If the target is Marked or dies to Bladesurge, its cooldown refreshes."
        }
      ],
      "W": [
        {
          "name": "Defiant Dance",
          "description": "Irelia charges a strike that deals more damage as she charges. She takes reduced physical damage during the charge."
        }
      ],
      "E": [
        {
          "name": "Flawless Duet",
          "description": "Irelia sends out two blades which converge on each other. Enemies caught in between are damaged, stunned and marked."
        }
      ],
      "R": [
        {
          "name": "Vanguard's Edge",
          "description": "Irelia fires a massive number of blades that explode outward upon hitting an enemy champion. Enemies hit by the blades are damaged and marked. Afterwards the blades form a wall that will damage and slow enemies that walk through it."
        }
      ]
    }
  },
  "ivern": {
    "fullName": "Ivern, the Green Father",
    "title": "the Green Father",
    "id": "ivern",
    "name": "Ivern",
    "abilities": {
      "P": [
        {
          "name": "Friend of the Forest",
          "description": "Ivern cannot attack or be attacked by non-epic monsters. Ivern can create magical groves on jungle camps which grow over time. When the grove is fully grown, Ivern may free the monsters to receive gold and experience. After level 5 Ivern can share jungle buffs with allies."
        }
      ],
      "Q": [
        {
          "name": "Rootcaller",
          "description": "Ivern conjures a vine, dealing damage and rooting enemy targets hit. Ivern's allies can dash to the rooted target."
        }
      ],
      "W": [
        {
          "name": "Brushmaker",
          "description": "In brush, Ivern's attacks deal bonus magic damage. Ivern can activate this ability to create a patch of brush."
        }
      ],
      "E": [
        {
          "name": "Triggerseed",
          "description": "Ivern places a shield on an ally which explodes after a short duration slowing and damaging enemies."
        }
      ],
      "R": [
        {
          "name": "Daisy!",
          "description": "Ivern summons his Sentinel friend Daisy to fight with him. Daisy will send out a shockwave if she attacks the same champion three times in a row."
        }
      ]
    }
  },
  "janna": {
    "fullName": "Janna, the Storm's Fury",
    "title": "the Storm's Fury",
    "id": "janna",
    "name": "Janna",
    "abilities": {
      "P": [
        {
          "name": "Tailwind",
          "description": "Janna gains bonus movement speed moving towards allied champions and nearby allied champions gain this bonus when moving toward her."
        }
      ],
      "Q": [
        {
          "name": "Howling Gale",
          "description": "By creating a localized change in pressure and temperature, Janna is able to create a small storm that grows in size with time. She can activate the spell again to release the storm. On release this storm will fly towards the direction it was cast in, dealing damage and knocking away any enemies in its path."
        }
      ],
      "W": [
        {
          "name": "Zephyr",
          "description": "Janna summons an air elemental that passively increases her movement speed and enables her to pass through units. She may also activate this ability to deal damage and slow an enemy's movement speed. The passive is lost while this ability is on cooldown."
        }
      ],
      "E": [
        {
          "name": "Eye Of The Storm",
          "description": "Janna conjures a defensive gale that shields an ally champion or turret from incoming damage and increases their attack damage."
        }
      ],
      "R": [
        {
          "name": "Monsoon",
          "description": "Janna surrounds herself in a magical storm, throwing enemies back. After the storm has settled, soothing winds heal nearby allies while the ability is active."
        }
      ]
    }
  },
  "jarvan_iv": {
    "fullName": "Jarvan IV, the Exemplar of Demacia",
    "title": "the Exemplar of Demacia",
    "id": "jarvan_iv",
    "name": "Jarvan IV",
    "abilities": {
      "P": [
        {
          "name": "Martial Cadence",
          "description": "Jarvan's first basic attack on an enemy deals bonus physical damage depending on their current health. This effect cannot occur again on the same enemy for a few seconds."
        }
      ],
      "Q": [
        {
          "name": "Dragon Strike",
          "description": "Jarvan IV extends his lance, dealing physical damage and lowering the armor of enemies in its path. Additionally, this will pull Jarvan to his Demacian Standard, knocking up enemies in his path."
        }
      ],
      "W": [
        {
          "name": "Golden Aegis",
          "description": "Jarvan IV calls upon the ancient kings of Demacia to shield him from harm and slow surrounding enemies."
        }
      ],
      "E": [
        {
          "name": "Demacian Standard",
          "description": "Jarvan IV carries the pride of Demacia, passively granting him bonus attack speed. Activating Demacian Standard allows Jarvan IV to place a Demacian flag that deals magic damage on impact and grants attack speed to nearby allied champions."
        }
      ],
      "R": [
        {
          "name": "Cataclysm",
          "description": "Jarvan IV heroically leaps into battle at a target with such force that he terraforms the surrounding area to create an arena around them. Nearby enemies are damaged at the moment of impact."
        }
      ]
    }
  },
  "jax": {
    "fullName": "Jax, Grandmaster at Arms",
    "title": "Grandmaster at Arms",
    "id": "jax",
    "name": "Jax",
    "abilities": {
      "P": [
        {
          "name": "Relentless Assault",
          "description": "Jax's consecutive basic attacks continuously increase his attack speed."
        }
      ],
      "Q": [
        {
          "name": "Leap Strike",
          "description": "Jax leaps toward a unit. If they are an enemy, he strikes them with his weapon."
        }
      ],
      "W": [
        {
          "name": "Empower",
          "description": "Jax charges his weapon with energy, causing his next attack to deal additional damage."
        }
      ],
      "E": [
        {
          "name": "Counter Strike",
          "description": "Jax's combat prowess allows him to dodge all incoming attacks for a short duration and then quickly counterattack, stunning all surrounding enemies."
        }
      ],
      "R": [
        {
          "name": "Grandmaster's Might",
          "description": "Every third consecutive attack deals additional magic damage. Additionally, Jax can activate this ability to strengthen his resolve, increasing his armor and magic resist for a short duration."
        }
      ]
    }
  },
  "jayce": {
    "fullName": "Jayce, the Defender of Tomorrow",
    "title": "the Defender of Tomorrow",
    "id": "jayce",
    "name": "Jayce",
    "abilities": {
      "P": [
        {
          "name": "Hextech Capacitor",
          "description": "Jayce can swap between melee and ranged weapons using Mercury Cannon / Mercury Hammer starting from level 1. Swapping weapons also swaps all his abilities and grants him movement speed for less than a second."
        }
      ],
      "Q": [
        {
          "name": "Shock Blast",
          "description": "Jayce fires an orb of electricity, dealing physical damage to the first enemy hit and all surrounding enemies. Firing this orb through Acceleration Gate increases the range, speed and increases the damage by a percentage."
        },
        {
          "name": "To The Skies!",
          "description": "Jayce leaps to an enemy, dealing physical damage to surrounding enemies and slowing them for a few seconds."
        },
        {
          "name": "To The Skies! / Shock Blast",
          "description": "Hammer Stance: Leaps to an enemy dealing physical damage and slowing enemies. Cannon Stance: Fires an orb of electricity that detonates upon hitting an enemy (or reaching the end of its path) dealing physical damage to all enemies hit."
        }
      ],
      "W": [
        {
          "name": "Hyper Charge",
          "description": "Jayce overcharges his cannon, gaining maximum attack speed for his next 3 attacks. These attacks deal physical damage."
        },
        {
          "name": "Lightning Field",
          "description": "Passive: Jayce's Hammer attacks grant mana. Active: Jayce creates an electric aura dealing magic damage over a few seconds."
        },
        {
          "name": "Lightning Field / Hyper Charge",
          "description": "Mercury Hammer Passive: Jayce's Hammer attacks grant mana. Mercury Hammer Active: Jayce creates an electric aura dealing magic damage over a few seconds. Mercury Cannon: Jayce overcharges his cannon, gaining maximum attack speed for his next 3 attacks. These attacks deal physical damage."
        }
      ],
      "E": [
        {
          "name": "Acceleration Gate",
          "description": "Jayce deploys an acceleration gate for a few seconds that grants movement speed decaying over a few seconds to allied champions that pass through it."
        },
        {
          "name": "Thundering Blow",
          "description": "Jayce swings his hammer, knocking back his target and dealing magic damage."
        },
        {
          "name": "Thundering Blow / Acceleration Gate",
          "description": "Mercury Hammer: Jayce swings his hammer, knocking back his target and dealing magic damage. Mercury Cannon: Jayce deploys an acceleration gate for a few seconds that grants movement speed decaying over a few seconds to allied champions that pass through it."
        }
      ],
      "R": [
        {
          "name": "Mercury Cannon",
          "description": "Jayce transforms his weapon into the Mercury Cannon, gaining attack range and new abilities. Jayce's next attack removes armor and magic resist for 5 seconds."
        },
        {
          "name": "Mercury Cannon / Mercury Hammer",
          "description": "Mercury Cannon: Jayce transforms his weapon into the Mercury Hammer, becoming melee ranged and gaining new abilities, armor and magic resist. Jayce's next attack deals additional magic damage. Mercury Hammer: Jayce transforms his weapon into the Mercury Cannon, gaining attack range and new abilities. Jayce's next attack removes armor and magic resist for a few seconds."
        },
        {
          "name": "Mercury Hammer",
          "description": "Jayce transforms his weapon into the Mercury Hammer, becoming melee ranged and gaining new abilities, armor and magic resist. Jayce's next attack deals additional magic damage."
        }
      ]
    }
  },
  "jhin": {
    "fullName": "Jhin, the Virtuoso",
    "title": "the Virtuoso",
    "id": "jhin",
    "name": "Jhin",
    "abilities": {
      "P": [
        {
          "name": "Whisper",
          "description": "Jhin's hand cannon, Whisper, is a precise instrument designed to deal superior damage. It fires at a fixed rate and carries only four shots. Jhin imbues the final bullet with dark magics to critically strike and deal bonus execute damage. Whenever Whisper crits, it inspires Jhin with a burst of movement speed."
        }
      ],
      "Q": [
        {
          "name": "Dancing Grenade",
          "description": "Jhin launches a magical cartridge at an enemy. It can hit up to four targets and gains damage each time it kills."
        }
      ],
      "W": [
        {
          "name": "Deadly Flourish",
          "description": "Jhin brandishes his cane, firing a single shot with incredible range. It pierces through minions and monsters, but stops on the first champion hit. If the target was recently struck by Jhin's allies, lotus traps, or damaged by Jhin, they are rooted."
        }
      ],
      "E": [
        {
          "name": "Captive Audience",
          "description": "Jhin places an invisible lotus trap that blooms when walked over. It slows nearby enemies before dealing damage with an explosion of serrated petals. Beauty in Death: When Jhin kills an enemy champion, a lotus trap will bloom near their corpse."
        }
      ],
      "R": [
        {
          "name": "Curtain Call",
          "description": "Jhin channels, transforming Whisper into a shoulder-mounted mega-cannon. It is able to fire 4 super shots at extreme range that pierce through minions and monsters, but stop on the first champion impacted. Whisper cripples enemies hit, which slows them and deals execute damage. The 4th shot is perfectly crafted, epically powerful, and guaranteed to critically strike."
        }
      ]
    }
  },
  "jinx": {
    "fullName": "Jinx, the Loose Cannon",
    "title": "the Loose Cannon",
    "id": "jinx",
    "name": "Jinx",
    "abilities": {
      "P": [
        {
          "name": "Get Excited!",
          "description": "Jinx receives massively increased movement speed and attack speed whenever she helps kill or destroy an enemy champions epic jungle monster, or structure."
        }
      ],
      "Q": [
        {
          "name": "Fishbones, the Rocket Launcher",
          "description": "Jinx's attacks deal a percentage of attack damage as physical damage to the target and nearby enemies, gains bonus attack range, costs mana per rocket and scales less with bonus attack speed."
        },
        {
          "name": "Pow-Pow, the Minigun",
          "description": "Jinx's attacks grant attack speed for a few seconds."
        },
        {
          "name": "Switcheroo!",
          "description": "Jinx swaps weapons between Fishbones the rocket launcher and Pow-Pow the minigun. While using the rocket launcher, Jinx's attacks deal a percentage of attack damage as physical damage to the target and nearby enemies, gains bonus attack range, costs mana per rocket and scales less with bonus attack speed. While using the minigun, Jinx's attacks grant attack speed for a few seconds."
        }
      ],
      "W": [
        {
          "name": "Zap!",
          "description": "Jinx uses Zapper, her shock pistol, to fire a blast that deals damage to the first enemy hit, slowing and revealing it."
        }
      ],
      "E": [
        {
          "name": "Flame Chompers!",
          "description": "Jinx throws out a line of snare grenades that explode after a few seconds, lighting enemies on fire. Flame Chompers will bite enemy champions who walk over them, rooting them in place."
        }
      ],
      "R": [
        {
          "name": "Super Mega Death Rocket!",
          "description": "Jinx fires a super rocket across the map that gains damage as it travels. The rocket will explode upon colliding with an enemy champion, dealing damage to it and surrounding enemies depending on their missing health."
        }
      ]
    }
  },
  "ksante": {
    "fullName": "K'Sante, The Pride of Nazumah",
    "title": "The Pride of Nazumah",
    "id": "ksante",
    "name": "K'Sante",
    "abilities": {
      "P": [
        {
          "name": "Dauntless Instinct",
          "description": "K'Sante's damaging abilities mark enemies hit for a short duration. Attacking a marked enemy consumes the mark to deal physical damage. All Out: Mark consumption damage is converted to true damage. The entire attack is increased by a percentage."
        }
      ],
      "Q": [
        {
          "name": "Ntofo Strikes",
          "description": "K’Sante slams his weapon down, dealing physical damage and briefly slowing the enemies struck. When an enemy is hit, K’Sante gains a stack of Ntofo Strikes for a few seconds. At 2 stacks, K’Sante instead fires a shockwave that stuns and pulls enemies for a second. All Out: This ability’s cooldown is reduced by a second and no longer inflicts slow."
        }
      ],
      "W": [
        {
          "name": "Path Maker",
          "description": "Begin Charging: K’Sante raises his weapons defensively for up to a second, becoming unstoppable and reducing incoming damage. Release: K’Sante rams forward, dealing physical damage depending on charge time. K’Sante knocks back and stuns enemies for a short duration. All Out: This ability’s cooldown is refreshed. This ability will no longer knock back or stun. This ability’s damage reduction is increased, it deals additional physical damage and its charge and dash speed are doubled."
        }
      ],
      "E": [
        {
          "name": "Footwork",
          "description": "K’Sante dashes, gaining a shield for a few seconds. If dashing to an ally, the distance of the dash is significantly increased and the ally is also shielded. All Out: This ability’s dash speed is increased. Dashing without an ally has increased range and can go over walls."
        }
      ],
      "R": [
        {
          "name": "All Out",
          "description": "K’Sante shatters his ntofos, dealing physical damage and knocking back an enemy champion. Enemies that hit a wall instead take a different amount of physical damage, are knocked back over the wall, and are briefly stunned. K’Sante then dashes after the enemy and goes All Out for 20 seconds. All Out: K’Sante loses max health, bonus armor and bonus magic resistance. In return K’Sante gains attack damage, omnivamp and transforms his abilities."
        }
      ]
    }
  },
  "kaisa": {
    "fullName": "Kai'Sa, Daughter of the Void",
    "title": "Daughter of the Void",
    "id": "kaisa",
    "name": "Kai'Sa",
    "abilities": {
      "P": [
        {
          "name": "Second Skin",
          "description": "Kai'Sa's basic attacks stack Plasma, dealing increasing bonus magic damage. Allies' immobilizing effects help stack Plasma. Additionally, Kai'Sa's item purchases upgrade her basic spells to have more powerful properties."
        }
      ],
      "Q": [
        {
          "name": "Icathian Rain",
          "description": "Kai'Sa shoots a swarm of missiles that seek out nearby targets. Living Weapon: Icathian Rain is upgraded to shoot more missiles."
        }
      ],
      "W": [
        {
          "name": "Void Seeker",
          "description": "Kai'Sa shoots a long range missile, marking enemies with her passive. Living Weapon: Void Seeker is upgraded to apply more passive marks and reduce cooldown on champion hit."
        }
      ],
      "E": [
        {
          "name": "Supercharge",
          "description": "Kai'Sa briefly increases her movement speed, then increases her attack speed. Living Weapon: Supercharge is upgraded to briefly grant invisibility."
        }
      ],
      "R": [
        {
          "name": "Killer Instinct",
          "description": "Kai'Sa dashes near an enemy champion."
        }
      ]
    }
  },
  "kalista": {
    "fullName": "Kalista, the Spear of Vengeance",
    "title": "the Spear of Vengeance",
    "id": "kalista",
    "name": "Kalista",
    "abilities": {
      "P": [
        {
          "name": "Martial Poise",
          "description": "Enter a movement command while winding up Kalista's basic attack or Pierce to lunge a short distance when she launches her attack."
        }
      ],
      "Q": [
        {
          "name": "Pierce",
          "description": "Throw a fast moving spear that passes through enemies it kills."
        }
      ],
      "W": [
        {
          "name": "Sentinel",
          "description": "Gain bonus damage when Kalista and her Oathsworn strike the same target. Activate to send a soul to scout out the path, revealing the area in front of it."
        }
      ],
      "E": [
        {
          "name": "Rend",
          "description": "Attacks impale their targets with spears. Activate to rip the spears out, slowing and dealing escalating damage."
        }
      ],
      "R": [
        {
          "name": "Fate's Call",
          "description": "Kalista teleports the Oathsworn ally to herself. They gain the ability to dash toward a position, knocking enemy champions back."
        }
      ]
    }
  },
  "karma": {
    "fullName": "Karma, the Enlightened One",
    "title": "the Enlightened One",
    "id": "karma",
    "name": "Karma",
    "abilities": {
      "P": [
        {
          "name": "Gathering Fire",
          "description": "Karma's damaging abilities will reduce the cooldown of Mantra."
        }
      ],
      "Q": [
        {
          "name": "Inner Flame",
          "description": "Karma sends forth a ball of spirit energy that explodes and deals damage upon hitting an enemy unit. Mantra Bonus: In addition to the explosion, Mantra increases the destructive power of her Inner Flame, creating a cataclysm which deals damage after a short delay."
        },
        {
          "name": "Soulflare",
          "description": "In addition to the explosion, Mantra increases the destructive power of her Inner Flame, creating a cataclysm which deals damage after a short delay."
        }
      ],
      "W": [
        {
          "name": "Focused Resolve",
          "description": "Karma creates a tether between herself and a targeted enemy, dealing damage and revealing them. If the tether is not broken, the enemy will be rooted and damaged again. Mantra Bonus: Karma strengthens the link, healing herself and extending the root duration."
        },
        {
          "name": "Renewal",
          "description": "Karma strengthens the link, healing herself and extending the root duration."
        }
      ],
      "E": [
        {
          "name": "Defiance",
          "description": "Energy radiates out from her target, strengthening the initial shield and applying Inspire to nearby allied champions."
        },
        {
          "name": "Inspire",
          "description": "Karma summons a protective shield that absorbs incoming damage and increases the movement speed of the protected ally. Mantra Bonus: Energy radiates out from her target, strengthening the initial shield and applying Inspire to nearby allied champions."
        }
      ],
      "R": [
        {
          "name": "Mantra",
          "description": "Karma empowers her next ability to do an additional effect. Mantra is available at level 1 and does not require a skill point."
        }
      ]
    }
  },
  "karthus": {
    "fullName": "Karthus, the Deathsinger",
    "title": "the Deathsinger",
    "id": "karthus",
    "name": "Karthus",
    "abilities": {
      "P": [
        {
          "name": "Death Defied",
          "description": "Upon dying, Karthus enters a spirit form that allows him to continue casting spells."
        }
      ],
      "Q": [
        {
          "name": "Lay Waste",
          "description": "Karthus unleashes a delayed blast at a location, dealing damage to nearby enemies. Deals increased damage to isolated enemies."
        }
      ],
      "W": [
        {
          "name": "Wall of Pain",
          "description": "Karthus creates a passable screen of leeching energy. Any enemy units that walk through the screen have their movement speed and magic resist reduced for a period."
        }
      ],
      "E": [
        {
          "name": "Defile",
          "description": "Karthus passively steals energy from his victims, gaining Mana on each kill. Alternatively, Karthus can surround himself in the souls of his prey, dealing damage to nearby enemies, but quickly draining his own Mana."
        }
      ],
      "R": [
        {
          "name": "Requiem",
          "description": "After channeling for a few seconds, Karthus deals damage to all enemy champions."
        }
      ]
    }
  },
  "kassadin": {
    "fullName": "Kassadin, the Void Walker",
    "title": "the Void Walker",
    "id": "kassadin",
    "name": "Kassadin",
    "abilities": {
      "P": [
        {
          "name": "Void Stone",
          "description": "Kassadin takes reduced magic damage and ignores unit collision."
        }
      ],
      "Q": [
        {
          "name": "Null Sphere",
          "description": "Kassadin fires an orb of void energy at a target, dealing damage and interrupting channels. The excess energy forms around himself, granting a temporary shield that absorbs magic damage."
        }
      ],
      "W": [
        {
          "name": "Nether Blade",
          "description": "Passive: Kassadin's basic attacks deal bonus magic damage. Active: Kassadin's next basic attack deals significant bonus magic damage and restores mana."
        }
      ],
      "E": [
        {
          "name": "Force Pulse",
          "description": "Kassadin draws energy from spells cast in his vicinity. Upon charging up, Kassadin can use Force Pulse to damage and slow enemies in a cone in front of him."
        }
      ],
      "R": [
        {
          "name": "Riftwalk",
          "description": "Kassadin teleports to a nearby location dealing damage to nearby enemy units. Multiple Riftwalks in a short period of time cost additional Mana but also deal additional damage."
        }
      ]
    }
  },
  "katarina": {
    "fullName": "Katarina, the Sinister Blade",
    "title": "the Sinister Blade",
    "id": "katarina",
    "name": "Katarina",
    "abilities": {
      "P": [
        {
          "name": "Voracity",
          "description": "Whenever an enemy champion dies that Katarina has damaged recently, her remaining ability cooldowns are dramatically reduced. If Katarina picks up a Dagger, she uses it to slash through all nearby enemies, dealing magic damage."
        }
      ],
      "Q": [
        {
          "name": "Bouncing Blades",
          "description": "Katarina throws a dagger at the target that then bounces to nearby enemies before ricocheting onto the ground."
        }
      ],
      "W": [
        {
          "name": "Preparation",
          "description": "Katarina gains a burst of movement speed, tossing a Dagger into the air directly above herself."
        }
      ],
      "E": [
        {
          "name": "Shunpo",
          "description": "Katarina blinks to the target, striking it if its an enemy, or striking the nearest enemy otherwise."
        }
      ],
      "R": [
        {
          "name": "Death Lotus",
          "description": "Katarina becomes a flurry of blades, dealing massive magic damage while she channels to the 3 nearest enemy champions."
        }
      ]
    }
  },
  "kayle": {
    "fullName": "Kayle, the Righteous",
    "title": "the Righteous",
    "id": "kayle",
    "name": "Kayle",
    "abilities": {
      "P": [
        {
          "name": "Divine Ascent",
          "description": "Kayle's attacks are empowered by the heavens as she levels up and spends skill points. Her wings are lit aflame as she progressively gains attack speed, movement speed, attack range, and waves of fire on her attacks."
        }
      ],
      "Q": [
        {
          "name": "Radiant Blast",
          "description": "Kayle conjures a portal, summoning a celestial sword that pierces through enemies, slowing, damaging, and reducing the resistances of all hit."
        }
      ],
      "W": [
        {
          "name": "Celestial Blessing",
          "description": "Blessed by the divine, Kayle heals and grants movement speed to herself and the nearest ally."
        }
      ],
      "E": [
        {
          "name": "Starfire Spellblade",
          "description": "Passive: Kayle's celestial sword, Virtue, deals bonus magic damage to enemies she attacks. Active: Kayle's next attack smites her target with celestial fire, dealing bonus damage proportionate to their missing health."
        }
      ],
      "R": [
        {
          "name": "Divine Judgment",
          "description": "Kayle makes an ally invulnerable and calls upon former Aspects of Justice to purify the area around her target with a holy rain of swords."
        }
      ]
    }
  },
  "kayn": {
    "fullName": "Kayn, the Shadow Reaper",
    "title": "the Shadow Reaper",
    "id": "kayn",
    "name": "Kayn",
    "abilities": {
      "P": [
        {
          "name": "The Darkin Scythe",
          "description": "Once he has dealt enough damage to champions, Kayn can assume one of two forms, based on whether he has damaged more melee or ranged champions. The form he assumes changes his abilities."
        },
        {
          "name": "The Darkin Scythe: Rhaast",
          "description": "Rhaast heals for a percentage of the damage that he deals with spells against enemy champions."
        },
        {
          "name": "The Darkin Scythe: Shadow Assassin",
          "description": "Kayn's basic attacks and abilities deal bonus magic damage, lasting for 3 seconds upon entering in combat with an enemy champion, refreshing after 8 seconds out of combat with them or by using Umbral Trespass."
        }
      ],
      "Q": [
        {
          "name": "Reaping Slash",
          "description": "Kayn dashes forward, dealing physical damage to all enemies he passes through before flourishing his scythe, dealing the same damage again to surrounding enemies. Both instances of Reaping Slash deal bonus damage against minions and monsters."
        },
        {
          "name": "Reaping Slash: Rhaast",
          "description": "Kayn dashes forward, dealing physical damage to all enemies he passes through before flourishing his scythe, dealing the same damage again to surrounding enemies."
        },
        {
          "name": "Reaping Slash: Shadow Assassin",
          "description": "Kayn dashes forward, dealing physical damage to all enemies he passes through before flourishing his scythe, dealing the same damage again to surrounding enemies."
        }
      ],
      "W": [
        {
          "name": "Blade's Reach",
          "description": "After a short delay in which he can't perform any other actions, Kayn performs an upwards sweep with his scythe, dealing physical damage to all enemies in a line and slowing them."
        },
        {
          "name": "Blade's Reach: Rhaast",
          "description": "After a short delay in which he can't perform any other actions, Kayn performs an upwards sweep with his scythe, dealing physical damage to all enemies in a line, knocking them up and slowing them."
        },
        {
          "name": "Blade's Reach: Shadow Assassin",
          "description": "After a short delay, Kayn conjures a living shadow at his casting position that performs an upwards sweep with its scythe, dealing physical damage to all enemies in a line and slowing them."
        }
      ],
      "E": [
        {
          "name": "Shadow Step",
          "description": "Kayn gains bonus movement speed, is ghosted and can ignore terrain collision for 1.5 seconds. Immobilizing effects will interrupt Shadow Step. Kayn heals himself upon moving through terrain for the first time and, if he's not in combat with enemy champions, Shadow Step's duration is increased. Entering combat with a champion after the effect is enhanced reduces the remaining duration to 1.5 seconds."
        },
        {
          "name": "Shadow Step: Rhaast",
          "description": "Kayn gains bonus movement speed, is ghosted and can ignore terrain collision for 1.5 seconds. Immobilizing effects will interrupt Shadow Step. Kayn heals himself upon moving through terrain for the first time and, if he's not in combat with enemy champions, Shadow Step's duration is increased to 5 seconds. Entering combat with a champion after the effect is enhanced reduces the remaining duration to 1.5 seconds."
        },
        {
          "name": "Shadow Step: Shadow Assassin",
          "description": "Kayn gains bonus movement speed, is ghosted and can ignore terrain collision for 1.5 seconds. Immobilizing effects will interrupt Shadow Step. Kayn heals himself upon moving through terrain for the first time and, if he's not in combat with enemy champions, Shadow Step's duration is increased. Entering combat with a champion after the effect is enhanced reduces the remaining duration to 1.5 seconds."
        }
      ],
      "R": [
        {
          "name": "Umbral Trespass",
          "description": "Kayn's basic attacks and abilities mark enemy champions for a few seconds. Kayn can activate Umbral Trespass to infest a marked enemy champion, revealing them and becoming untargetable for the duration. Upon reactivation or at the end of the duration, Kayn wrenches free from their body in the cursor's direction, dealing physical damage to the target."
        },
        {
          "name": "Umbral Trespass: Rhaast",
          "description": "Kayn's basic attacks and abilities mark enemy champions for a few seconds. Kayn can activate Umbral Trespass to infest a marked enemy champion, revealing them and becoming untargetable for the duration. Upon reactivation or at the end of the duration, Kayn wrenches free from their body in the cursor's direction, dealing physical damage to the target."
        },
        {
          "name": "Umbral Trespass: Shadow Assassin",
          "description": "Kayn's basic attacks and abilities mark enemy champions for a few seconds. Kayn can activate Umbral Trespass to infest a marked enemy champion, revealing them and becoming untargetable for the duration. Upon reactivation or at the end of the duration, Kayn wrenches free from their body in the cursor's direction, dealing physical damage to the target."
        }
      ]
    }
  },
  "kennen": {
    "fullName": "Kennen, the Heart of the Tempest",
    "title": "the Heart of the Tempest",
    "id": "kennen",
    "name": "Kennen",
    "abilities": {
      "P": [
        {
          "name": "Mark of the Storm",
          "description": "Kennen stuns enemies he hits 3 times with his abilities."
        }
      ],
      "Q": [
        {
          "name": "Thundering Shuriken",
          "description": "Kennen throws a fast moving shuriken towards a location, causing damage and adding a Mark of the Storm to any opponent that it hits."
        }
      ],
      "W": [
        {
          "name": "Electrical Surge",
          "description": "Kennen passively deals extra damage and adds a Mark of the Storm to his target every few attacks, and he can activate this ability to damage and add another Mark of the Storm to targets who are already marked."
        }
      ],
      "E": [
        {
          "name": "Lightning Rush",
          "description": "Kennen morphs into a lightning form, enabling him to pass through units and apply a Mark of the Storm. Kennen gains movement speed when entering this form, and attack speed when leaving it."
        }
      ],
      "R": [
        {
          "name": "Slicing Maelstrom",
          "description": "Kennen summons a storm that strikes at nearby enemy champions for magical damage."
        }
      ]
    }
  },
  "khazix": {
    "fullName": "Kha'Zix, the Voidreaver",
    "title": "the Voidreaver",
    "id": "khazix",
    "name": "Kha'Zix",
    "abilities": {
      "P": [
        {
          "name": "Unseen Threat",
          "description": "Nearby enemies that are Isolated from their allies are marked. Kha'Zix's abilities have interactions with Isolated targets When Kha'Zix is not visible to the enemy team, he gains Unseen Threat, causing his next basic attack against an enemy champion to deal bonus magic damage and slow them for a few seconds."
        }
      ],
      "Q": [
        {
          "name": "Taste Their Fear",
          "description": "Deals physical damage to the target. Damage increased on Isolated targets. If he chooses to Evolve Reaper Claws, this refunds a percent of it's cooldown against Isolated targets. Kha'Zix also gains increased range on his basic attacks and Taste Their Fear."
        }
      ],
      "W": [
        {
          "name": "Void Spike",
          "description": "Kha'Zix fires exploding spikes that deal physical damage to enemies hit. Kha'Zix is healed if he is also within the explosion radius. If he chooses to Evolve Spike Racks, Void Spike now fires three spikes in a cone, slow enemies hit, and reveals enemy champions hit for 2 seconds. Isolated targets are slowed for extra."
        }
      ],
      "E": [
        {
          "name": "Leap",
          "description": "Kha'Zix leaps to an area, dealing physical damage upon landing. If he chooses to Evolve Wings, Leap's range increases by 200 and the cooldown resets on champion kill or assist."
        }
      ],
      "R": [
        {
          "name": "Void Assault",
          "description": "Each rank of Void Assault allows Kha'Zix to evolve one of his active abilities, granting it an additional effect. Upon activation, Kha'Zix enters stealth and gains Unseen Threat, increasing Movement Speed. Kha'Zix can cast Void Assault again for a short time after activation. Evolving active camouflage allows Kha'Zix to cast Void Assault three times over the course of its duration and increases the duration of the stealth."
        }
      ]
    }
  },
  "kindred": {
    "fullName": "Kindred, The Eternal Hunters",
    "title": "The Eternal Hunters",
    "id": "kindred",
    "name": "Kindred",
    "abilities": {
      "P": [
        {
          "name": "Mark of the Kindred",
          "description": "Kindred can mark targets to Hunt. Successfully completing a Hunt permanently empowers Kindred's basic abilities. Every 4 hunts completed also increases Kindred's basic attack range."
        }
      ],
      "Q": [
        {
          "name": "Dance of Arrows",
          "description": "Kindred tumbles and shoots up to three arrows at nearby targets."
        }
      ],
      "W": [
        {
          "name": "Wolf's Frenzy",
          "description": "Wolf enrages and attacks enemies around him. Lamb passively gains stacks by moving and attacking. When fully charged, Lamb's next attack restores health."
        }
      ],
      "E": [
        {
          "name": "Mounting Dread",
          "description": "Lamb fires a carefully placed shot, slowing the target. If Lamb attacks the target two more times, her third attack instead directs Wolf to pounce on the enemy, savaging them for massive damage."
        }
      ],
      "R": [
        {
          "name": "Lamb's Respite",
          "description": "Lamb grants all living things inside a zone a respite from death. Until the effect ends, nothing can die. At the end, units are healed."
        }
      ]
    }
  },
  "kled": {
    "fullName": "Kled, the Cantankerous Cavalier",
    "title": "the Cantankerous Cavalier",
    "id": "kled",
    "name": "Kled",
    "abilities": {
      "P": [
        {
          "name": "Skaarl the Cowardly Lizard",
          "description": "Kled rides his trusty steed, Skaarl, who takes damage for him. When Skaarl's health depletes, Kled dismounts. While dismounted, Kled's abilities change and he deals less damage. Kled can restore Skaarl's courage by fighting enemies. At maximum courage, Kled remounts with a portion of Skaarl's health."
        }
      ],
      "Q": [
        {
          "name": "Beartrap on a Rope",
          "description": "Kled throws a bear trap that damages and hooks an enemy champion. If shackled for a short duration, the target takes additional physical damage and is yanked toward Kled. When dismounted, this ability is replaced by Pocket Pistol, a ranged gun blast that knocks back Kled and restores courage."
        },
        {
          "name": "Beartrap on a Rope / Pocket Pistol",
          "description": "Kled throws a bear trap that damages and hooks an enemy champion. If shackled for a short duration, the target takes additional physical damage and is yanked toward Kled. When dismounted, this ability is replaced by Pocket Pistol, a ranged gun blast that knocks back Kled and restores courage."
        },
        {
          "name": "Pocket Pistol",
          "description": "Dismounted: Pocket Pistol, a ranged gun blast that knocks back Kled and restores courage."
        }
      ],
      "W": [
        {
          "name": "Violent Tendencies",
          "description": "Kled gains massive attack speed for four attacks. The fourth attack deals more damage."
        }
      ],
      "E": [
        {
          "name": "Jousting",
          "description": "Kled dashes, dealing physical damage and gaining a short burst of speed. Kled can cast this ability again to dash back through his initial target, dealing the same damage."
        }
      ],
      "R": [
        {
          "name": "Chaaaaaaaarge!!!",
          "description": "Kled and Skaarl charge to a location, leaving a speed-granting trail behind them and gaining a shield. Skaarl locks onto and rams the first enemy champion encountered."
        }
      ]
    }
  },
  "kogmaw": {
    "fullName": "Kog'Maw, the Mouth of the Abyss",
    "title": "the Mouth of the Abyss",
    "id": "kogmaw",
    "name": "Kog'Maw",
    "abilities": {
      "P": [
        {
          "name": "Icathian Surprise",
          "description": "4 seconds after dying, Kogmaw explodes, dealing true damage to surrounding enemies."
        }
      ],
      "Q": [
        {
          "name": "Caustic Spittle",
          "description": "Kog'Maw launches a corrosive projectile which deals magic damage and corrodes the target's armor and magic resist for a short time. Kog'Maw also gains additional attack speed."
        }
      ],
      "W": [
        {
          "name": "Bio-Arcane Barrage",
          "description": "Kog'Maw's attacks gain range and deal a percent of the target's maximum health as magic damage."
        }
      ],
      "E": [
        {
          "name": "Void Ooze",
          "description": "Kog'Maw launches a peculiar ooze which damages all enemies it passes through and leaves a trail which slows enemies who stand on it."
        }
      ],
      "R": [
        {
          "name": "Living Artillery",
          "description": "Kog'Maw fires an artillery shell at a great distance dealing magic damage (increased significantly on low health enemies) and revealing non-stealthed targets. Additionally, multiple Living Artilleries in a short period of time cause them to cost additional mana."
        }
      ]
    }
  },
  "leblanc": {
    "fullName": "LeBlanc, the Deceiver",
    "title": "the Deceiver",
    "id": "leblanc",
    "name": "LeBlanc",
    "abilities": {
      "P": [
        {
          "name": "Mirror Image",
          "description": "When LeBlanc drops below 40% health, she becomes invisible for a second and creates a Mirror Image that deals no damage and lasts for up to 8 seconds."
        }
      ],
      "Q": [
        {
          "name": "Sigil of Malice",
          "description": "LeBlanc projects a sigil, dealing damage and marking the target for 3.5 seconds. Damaging the marked target with an ability detonates the sigil, dealing additional damage."
        }
      ],
      "W": [
        {
          "name": "Distortion",
          "description": "LeBlanc dashes to a location, dealing damage to enemies near her destination. For the next 4 seconds, activate Distortion again to return LeBlanc to her starting location."
        }
      ],
      "E": [
        {
          "name": "Ethereal Chains",
          "description": "LeBlanc launches a chain that shackles the first enemy hit. If the target remains shackled for 1.5 seconds, LeBlanc roots them and deals additional damage."
        }
      ],
      "R": [
        {
          "name": "Mimic",
          "description": "LeBlanc casts a mimicked version of her most recently used basic ability, applying the same effects and dealing modified magic damage."
        },
        {
          "name": "Mimic Distortion",
          "description": "LeBlanc dashes to a location, dealing damage to enemies near her destination. For the next 4 seconds, activate Distortion again to return LeBlanc to her starting location."
        },
        {
          "name": "Mimic Ethereal Chains",
          "description": "LeBlanc flings an illusory chain in the target direction, dealing magic damage to the first enemy it hits and tethering herself to them for 1.5 seconds. If the target does not break the tether, they are revealed and rooted for 1.5 seconds and dealt the same damage again."
        },
        {
          "name": "Mimic Sigil of Malice",
          "description": "LeBlanc projects a sigil, dealing damage and marking the target for 3.5 seconds. Damaging the marked target with an ability detonates the sigil, dealing additional damage."
        }
      ]
    }
  },
  "lee_sin": {
    "fullName": "Lee Sin, the Blind Monk",
    "title": "the Blind Monk",
    "id": "lee_sin",
    "name": "Lee Sin",
    "abilities": {
      "P": [
        {
          "name": "Flurry",
          "description": "After Lee Sin uses an ability, his next 2 basic attacks gain attack speed and return energy."
        }
      ],
      "Q": [
        {
          "name": "Resonating Strike",
          "description": "Lee Sin dashes to the enemy hit by Sonic Wave, dealing physical damage depending on the target's missing health."
        },
        {
          "name": "Sonic Wave",
          "description": "Lee Sin projects a discordant wave of sound to locate his enemies, dealing physical damage to the first enemy it encounters. If Sonic Wave hits, Lee Sin can cast Resonating Strike for the next 3 seconds."
        },
        {
          "name": "Sonic Wave / Resonating Strike",
          "description": "Sonic Wave: Lee Sin projects a discordant wave of sound to locate his enemies, dealing physical damage to the first enemy it encounters. If Sonic Wave hits, Lee Sin can cast Resonating Strike for the next 3 seconds. Resonating Strike: Lee Sin dashes to the enemy hit by Sonic Wave, dealing physical damage depending on the target's missing health."
        }
      ],
      "W": [
        {
          "name": "Iron Will",
          "description": "Lee Sin's intense training allows him to thrive in battle. For 4 seconds, Lee Sin gains life steal and spell vamp."
        },
        {
          "name": "Safeguard",
          "description": "Lee Sin rushes to target ally, shielding himself from damage. If the ally is a champion, they are also shielded. After using Safeguard, Lee Sin can cast Iron Will for the next 3 seconds."
        },
        {
          "name": "Safeguard / Iron Will",
          "description": "Safeguard: Lee Sin rushes to target ally, shielding himself from damage. If the ally is a champion, they are also shielded. After using Safeguard, Lee Sin can cast Iron Will for the next 3 seconds. Iron Will: Lee Sin's intense training allows him to thrive in battle. For 4 seconds, Lee Sin gains life steal and spell vamp."
        }
      ],
      "E": [
        {
          "name": "Cripple",
          "description": "Lee Sin cripples nearby enemies damaged by Tempest, reducing their movement speed for 4 seconds. Movement speed recovers gradually over the duration."
        },
        {
          "name": "Tempest",
          "description": "Lee Sin smashes the ground, sending out a shockwave that deals magic damage and reveals enemy units hit. If Tempest hits an enemy, Lee Sin can cast cripple for the next 3 seconds."
        },
        {
          "name": "Tempest / Cripple",
          "description": "Tempest: Lee Sin smashes the ground, sending out a shockwave that deals magic damage and reveals enemy units hit. If Tempest hits an enemy, Lee Sin can cast cripple for the next 3 seconds. Cripple: Lee Sin cripples nearby enemies damaged by Tempest, reducing their movement speed for 4 seconds. Movement speed recovers gradually over the duration."
        }
      ],
      "R": [
        {
          "name": "Dragon's Rage",
          "description": "Lee Sin performs a powerful roundhouse kick launching his target back, dealing physical damage to the target and any enemies they collide with. Enemies the target collides with are knocked into the air for a short duration."
        }
      ]
    }
  },
  "leona": {
    "fullName": "Leona, the Radiant Dawn",
    "title": "the Radiant Dawn",
    "id": "leona",
    "name": "Leona",
    "abilities": {
      "P": [
        {
          "name": "Sunlight",
          "description": "Damaging spells afflict enemies with Sunlight for 1.5 seconds. When allied champions deal damage to those targets, they consume the Sunlight to deal additional magic damage."
        }
      ],
      "Q": [
        {
          "name": "Shield of Daybreak",
          "description": "Leona uses her shield to perform her next basic attack, dealing bonus magic damage and stunning the target."
        }
      ],
      "W": [
        {
          "name": "Eclipse",
          "description": "Leona raises her shield to gain damage reduction, armor, and magic resist. When the duration first ends, if there are nearby enemies, she will deal magic damage to them and prolong the duration of the effect."
        }
      ],
      "E": [
        {
          "name": "Zenith Blade",
          "description": "Leona projects a solar image of her sword, dealing magic damage to all enemies in a line. When the image fades, the last enemy champion struck will be briefly immobilized and Leona will dash to them."
        }
      ],
      "R": [
        {
          "name": "Solar Flare",
          "description": "Leona calls down a beam of solar energy, dealing damage to enemies in an area. Enemies in the center of the area are stunned, while enemies on the outside are slowed."
        }
      ]
    }
  },
  "lillia": {
    "fullName": "Lillia, the Bashful Bloom",
    "title": "the Bashful Bloom",
    "id": "lillia",
    "name": "Lillia",
    "abilities": {
      "P": [
        {
          "name": "Dream-Laden Bough",
          "description": "Hitting a champion or monster with a skill will deal additional max Health damage over time."
        }
      ],
      "Q": [
        {
          "name": "Blooming Blows",
          "description": "Passively, Lillia gains stacking movement speed when hitting enemies with spells. She can activate this to deal magic damage to nearby enemies, dealing extra true damage on the edge."
        }
      ],
      "W": [
        {
          "name": "Watch Out! Eep!",
          "description": "Lillia deals damage in a nearby area, dealing heavy damage in the center."
        }
      ],
      "E": [
        {
          "name": "Swirlseed",
          "description": "Lillia hurls a seed that damages and slows those it lands on. If it doesn't hit anything, it will continue rolling until it hits a wall or target."
        }
      ],
      "R": [
        {
          "name": "Lilting Lullaby",
          "description": "Lillia causes all enemies with Dream Dust on them to become Drowsy before falling asleep. Those enemies will take extra damage on being forcibly woken up."
        }
      ]
    }
  },
  "lissandra": {
    "fullName": "Lissandra, the Ice Witch",
    "title": "the Ice Witch",
    "id": "lissandra",
    "name": "Lissandra",
    "abilities": {
      "P": [
        {
          "name": "Iceborn Subjugation",
          "description": "When an enemy champion dies near Lissandra they become a Frozen Thrall. Frozen Thralls slow nearby enemies and then, after a delay, shatter from the intense cold, dealing magic damage to nearby targets."
        }
      ],
      "Q": [
        {
          "name": "Ice Shard",
          "description": "Throws a spear of ice that shatters when it hits an enemy, dealing magic damage and slowing movement speed. Shards pass through the target, dealing the same damage to other enemies hit."
        }
      ],
      "W": [
        {
          "name": "Ring of Frost",
          "description": "Freezes nearby enemies in ice, dealing magic damage and rooting them."
        }
      ],
      "E": [
        {
          "name": "Glacial Path",
          "description": "Lissandra creates an ice claw that deals magic damage. Reactivating this ability transports Lissandra to the claw's current location."
        }
      ],
      "R": [
        {
          "name": "Frozen Tomb",
          "description": "If cast on an enemy champion, the target is frozen solid, stunning it. If cast on Lissandra, she encases herself in dark ice, healing herself while becoming untargetable and invulnerable. Dark ice then emanates from the target dealing magic damage to enemies and slowing movement speed."
        }
      ]
    }
  },
  "lucian": {
    "fullName": "Lucian, the Purifier",
    "title": "the Purifier",
    "id": "lucian",
    "name": "Lucian",
    "abilities": {
      "P": [
        {
          "name": "Lightslinger",
          "description": "Whenever Lucian uses an ability, his next attack becomes a double-shot. When Lucian is empowered by another ally, his next 2 basic attacks will deal bonus magic damage."
        }
      ],
      "Q": [
        {
          "name": "Piercing Light",
          "description": "Lucian shoots a bolt of piercing light through a target."
        }
      ],
      "W": [
        {
          "name": "Ardent Blaze",
          "description": "Lucian shoots a missile that explodes in a star shape, marking and briefly revealing enemies. Lucian gains movement speed for attacking marked enemies."
        }
      ],
      "E": [
        {
          "name": "Relentless Pursuit",
          "description": "Lucian quickly dashes a short distance. Lightslinger attacks reduce Relentless Pursuit's cooldown."
        }
      ],
      "R": [
        {
          "name": "The Culling",
          "description": "Lucian unleashes a torrent of shots from his weapons."
        }
      ]
    }
  },
  "lulu": {
    "fullName": "Lulu, the Fae Sorceress",
    "title": "the Fae Sorceress",
    "id": "lulu",
    "name": "Lulu",
    "abilities": {
      "P": [
        {
          "name": "Pix, Faerie Companion",
          "description": "Pix fires magical bolts of energy whenever the champion he's following attacks another enemy unit. These bolts are homing, but can be intercepted by other units."
        }
      ],
      "Q": [
        {
          "name": "Glitterlance",
          "description": "Pix and Lulu each fire a bolt of magical energy that damages and heavily slows all enemies it hits."
        }
      ],
      "W": [
        {
          "name": "Whimsy",
          "description": "If cast on an ally, grants them attack speed and movement speed for a short time. If cast on an enemy, turns them into an adorable critter that can't attack or cast spells."
        }
      ],
      "E": [
        {
          "name": "Help, Pix!",
          "description": "If cast on an ally, commands Pix to jump to an ally and shield them. He then follows them and aids their attacks. If cast on an enemy, commands Pix to jump to an enemy and damage them. He then follows them and grants you vision of that enemy."
        }
      ],
      "R": [
        {
          "name": "Wild Growth",
          "description": "Lulu enlarges an ally, knocking nearby enemies into the air and granting them a large amount of bonus health. For the next few seconds, that ally gains an aura that slows nearby enemies."
        }
      ]
    }
  },
  "lux": {
    "fullName": "Lux, the Lady of Luminosity",
    "title": "the Lady of Luminosity",
    "id": "lux",
    "name": "Lux",
    "abilities": {
      "P": [
        {
          "name": "Illumination",
          "description": "Lux's damaging spells charge the target with energy for a few seconds. Lux's next attack ignites the energy, dealing bonus magic damage (depending on Lux's level) to the target."
        }
      ],
      "Q": [
        {
          "name": "Light Binding",
          "description": "Lux releases a sphere of light that immobilizes and deals damage to up to two enemy units."
        }
      ],
      "W": [
        {
          "name": "Prismatic Barrier",
          "description": "Lux throws her wand to a target location and back, bending the light around herself and any friendly champion it touches, protecting them from enemy damage."
        }
      ],
      "E": [
        {
          "name": "Lucent Singularity",
          "description": "Fires an anomaly of twisted light to an area, which slows nearby enemies. Lux can detonate it to damage enemies in the area of effect."
        }
      ],
      "R": [
        {
          "name": "Final Spark",
          "description": "After gathering energy, Lux fires a beam of light that deals damage to all targets in the area. It ignites and refreshes Lux's Illumination debuff if it hits enemies already afflicted. Lux can Flash while casting Final Spark though her ultimate won't follow her when she flashes."
        }
      ]
    }
  },
  "malphite": {
    "fullName": "Malphite, Shard of the Monolith",
    "title": "Shard of the Monolith",
    "id": "malphite",
    "name": "Malphite",
    "abilities": {
      "P": [
        {
          "name": "Granite Shield",
          "description": "Malphite is shielded by a layer of rock which absorbs damage up to 10% of his maximum health. If he has not been hit for 8 seconds, this effect recharges."
        }
      ],
      "Q": [
        {
          "name": "Seismic Shard",
          "description": "Malphite sends a shard of the earth through the ground at his target, dealing magic damage upon impact and stealing a percentage of their movement speed for 3 seconds."
        }
      ],
      "W": [
        {
          "name": "Thunderclap",
          "description": "Malphite attacks with such force that it creates a sonic boom. For the next few seconds, his attacks create aftershocks in front of him."
        }
      ],
      "E": [
        {
          "name": "Ground Slam",
          "description": "Malphite slams the ground sending out a shockwave that deals base damage plus half his armor as damage and reduces the attack speed of enemies for 4 seconds."
        }
      ],
      "R": [
        {
          "name": "Unstoppable Force",
          "description": "Malphite ferociously charges to a location, damaging enemies and knocking them into the air."
        }
      ]
    }
  },
  "malzahar": {
    "fullName": "Malzahar, the Prophet of the Void",
    "title": "the Prophet of the Void",
    "id": "malzahar",
    "name": "Malzahar",
    "abilities": {
      "P": [
        {
          "name": "Void Shift",
          "description": "Malzahar skirts the line between dimensions, activating Void Shift after avoiding direct damage for a period of time. During Void Shift, Malzahar takes heavily reduced damage and is immune to crowd control. Malzahar loses Void Shift 0.25 second after taking damage from a non-minion source or blocking a crowd control effect."
        }
      ],
      "Q": [
        {
          "name": "Call of the Void",
          "description": "Malzahar opens up two portals to the void. After a short delay, they fire projectiles which deal magic damage and silence enemy champions."
        }
      ],
      "W": [
        {
          "name": "Void Swarm",
          "description": "Malzahar gains a stack of Gathering Storm when he casts other abilities (max 2). On cast, Malzahar summons a Voidling, plus an additional Voidling per stack of Gathering Swarm (max 3 per cast)."
        }
      ],
      "E": [
        {
          "name": "Malefic Visions",
          "description": "Malzahar infects his target's mind with cruel visions of their demise, dealing damage over time. Using Malzahar's other spells on the target will refresh the visions. If the target dies while afflicted by the visions, they pass on to a nearby enemy unit and Malzahar gains mana. Malzahar's voidlings are attracted to affected units."
        }
      ],
      "R": [
        {
          "name": "Nether Grasp",
          "description": "Malzahar suppresses a target champion for 2.5 seconds and creates a zone of negative energy around them that deals damage to all enemies inside for the duration."
        }
      ]
    }
  },
  "maokai": {
    "fullName": "Maokai, the Twisted Treant",
    "title": "the Twisted Treant",
    "id": "maokai",
    "name": "Maokai",
    "abilities": {
      "P": [
        {
          "name": "Sap Magic",
          "description": "Maokai's basic attack also heals him and deals additional damage on a moderate cooldown. Each time Maokai casts a spell or is struck by an enemy's spell, this cooldown is reduced."
        }
      ],
      "Q": [
        {
          "name": "Bramble Smash",
          "description": "Maokai knocks back nearby enemies with a shockwave, dealing magic damage and slowing them."
        }
      ],
      "W": [
        {
          "name": "Twisted Advance",
          "description": "Maokai contorts into a mass of moving roots, becoming untargetable and dashing to the target. Upon arrival, he roots the target."
        }
      ],
      "E": [
        {
          "name": "Sapling Toss",
          "description": "Maokai flings a sapling to the target area to stand guard. More effective in brush."
        }
      ],
      "R": [
        {
          "name": "Nature's Grasp",
          "description": "Maokai summons a colossal wall of brambles and thorns that slowly advances forwards, damaging and rooting any enemies in the path."
        }
      ]
    }
  },
  "master_yi": {
    "fullName": "Master Yi, the Wuju Bladesman",
    "title": "the Wuju Bladesman",
    "id": "master_yi",
    "name": "Master Yi",
    "abilities": {
      "P": [
        {
          "name": "Double Strike",
          "description": "Every few consecutive basic attack, Master Yi strikes twice."
        }
      ],
      "Q": [
        {
          "name": "Alpha Strike",
          "description": "Master Yi teleports across the battlefield with blinding speed, dealing physical damage to multiple units in his path, while simultaneously becoming untargetable. Alpha Strike can critically strike and deals bonus physical damage to monsters. Basic attacks reduce Alpha Strike's cooldown."
        }
      ],
      "W": [
        {
          "name": "Meditate",
          "description": "Master Yi rejuvenates his body by focus of mind, restoring health and taking reduced damage for a short time. In addition, Master Yi will gain stacks of Double Strike and pause the remaining duration on Wuju Style and Highlander for each second he channels."
        }
      ],
      "E": [
        {
          "name": "Wuju Style",
          "description": "Grants bonus true damage on basic attacks."
        }
      ],
      "R": [
        {
          "name": "Highlander",
          "description": "Master Yi moves with unparalleled agility, temporarily increasing his movement speed and attack speed as well as making him immune to all slowing effects. While active, Champion kills or assists extend Highlander's duration. Passively reduces cooldown for his other abilities on a kill or assist."
        }
      ]
    }
  },
  "miss_fortune": {
    "fullName": "Miss Fortune, the Bounty Hunter",
    "title": "the Bounty Hunter",
    "id": "miss_fortune",
    "name": "Miss Fortune",
    "abilities": {
      "P": [
        {
          "name": "Love Tap",
          "description": "Whenever Miss Fortune basic attacks a new target, she deals bonus physical damage. Love tap deals 50% damage to minions."
        }
      ],
      "Q": [
        {
          "name": "Double Up",
          "description": "Miss Fortune fires a bullet at an enemy, damaging them and a target behind them. Both strikes can also apply Love Tap."
        }
      ],
      "W": [
        {
          "name": "Strut",
          "description": "Miss Fortune gains a stacking movement speed buff out of combat. Activating Strut grants the maximum speed bonus and increases Miss Fortune's attack speed for a few seconds."
        }
      ],
      "E": [
        {
          "name": "Make it Rain",
          "description": "Miss Fortune unleashes a flurry of bullets at a location, dealing waves of damage to opponents and slowing them."
        }
      ],
      "R": [
        {
          "name": "Bullet Time",
          "description": "Active: Miss Fortune channels a flurry of bullets into a cone in front of her, dealing large amounts of damage to enemies."
        }
      ]
    }
  },
  "mordekaiser": {
    "fullName": "Mordekaiser, the Iron Revenant",
    "title": "the Iron Revenant",
    "id": "mordekaiser",
    "name": "Mordekaiser",
    "abilities": {
      "P": [
        {
          "name": "Darkness Rise",
          "description": "Mordekaiser gains a powerful damage aura and Move Speed after landing 3 attacks or spells against champions or monsters."
        }
      ],
      "Q": [
        {
          "name": "Obliterate",
          "description": "Mordekaiser slams down his mace, dealing magic damage in an area. If he hits only a single enemy, the damage dealt is increased."
        }
      ],
      "W": [
        {
          "name": "Indestructible",
          "description": "Mordekaiser stores damage he deals and takes to create a shield. He may consume the shield to heal."
        }
      ],
      "E": [
        {
          "name": "Death's Grasp",
          "description": "Passive: Mordekaiser gains additional magic penetration. Active: Mordekaiser summons a deadly claw which drags enemies in an area towards him, dealing magic damage."
        }
      ],
      "R": [
        {
          "name": "Realm of Death",
          "description": "Mordekaiser slows a target enemy champion by 75% for 0.5 seconds. If the target is still in range and targetable by the end of the duration, Mordekaiser banishes himself and the target to the Death Realm for 7 seconds. Champions outside of the Death Realm cannot enter or interact with the champions that are within. Mordekaiser steals 10% of the target's current size, armor, magic resistance, health, attack damage, ability power and attack speed for the duration of the ability. If Mordekaiser kills his target, he consumes their soul, keeping the bonus stats until they respawn."
        }
      ]
    }
  },
  "morgana": {
    "fullName": "Morgana, the Fallen",
    "title": "the Fallen",
    "id": "morgana",
    "name": "Morgana",
    "abilities": {
      "P": [
        {
          "name": "Soul Siphon",
          "description": "Morgana heals for a percentage of the damage her abilities deal to champions, large minions, and large monsters."
        }
      ],
      "Q": [
        {
          "name": "Dark Binding",
          "description": "Morgana releases a sphere of dark magic. Upon contact with an enemy unit, the sphere will deal magic damage and force the unit to the ground for a period of time."
        }
      ],
      "W": [
        {
          "name": "Tormented Shadow",
          "description": "Morgana casts a cursed shadow on an area, damaging enemies who dare stand in her dark circle. They receive magic damage over time, which increases the lower health they are."
        }
      ],
      "E": [
        {
          "name": "Black Shield",
          "description": "Places a protective barrier around an allied champion, absorbing magical damage and preventing disables until penetrated or the shield dissipates."
        }
      ],
      "R": [
        {
          "name": "Soul Shackles",
          "description": "Morgana unleashes the full force of her celestial power as she unbinds her wings and hovers above the ground. She lashes chains of dark pain onto nearby enemy champions, gaining movement speed towards them. The chains slow and deal initial damage and, after a delay, stun those who are unable to break them."
        }
      ]
    }
  },
  "nami": {
    "fullName": "Nami, the Tidecaller",
    "title": "the Tidecaller",
    "id": "nami",
    "name": "Nami",
    "abilities": {
      "P": [
        {
          "name": "Surging Tides",
          "description": "When Nami's abilities hit allied champions they gain movement speed for a short duration. This effect is doubled for allies hit by Tidal Wave."
        }
      ],
      "Q": [
        {
          "name": "Aqua Prison",
          "description": "Sends a bubble into the air towards a targeted area. When it lands, it deals magic damage to all enemies in the area of impact and encases them into bubbles. Enemies hit by the bubble are lifted into the air and stunned for a short duration before being dropped to the ground."
        }
      ],
      "W": [
        {
          "name": "Ebb and Flow",
          "description": "Unleashes a stream of water that bounces back and forth between allied and enemy champions, healing allies and damaging enemies."
        }
      ],
      "E": [
        {
          "name": "Tidecaller's Blessing",
          "description": "Empowers an allied champion for a short duration. The ally's basic attacks and spells deal bonus magic damage and slow the target."
        }
      ],
      "R": [
        {
          "name": "Tidal Wave",
          "description": "Summons a Tidal Wave outward from Nami's position. The Tidal Wave briefly knocks up enemies that it comes in contact with, slowing them and dealing magic damage. The slow duration increases based on how far the Tidal Wave has traveled, with a minimum duration of 2 seconds and a maximum of 4 seconds."
        }
      ]
    }
  },
  "nasus": {
    "fullName": "Nasus, the Curator of the Sands",
    "title": "the Curator of the Sands",
    "id": "nasus",
    "name": "Nasus",
    "abilities": {
      "P": [
        {
          "name": "Soul Eater",
          "description": "Nasus drains his foe's spiritual energy, giving him natural lifesteal."
        }
      ],
      "Q": [
        {
          "name": "Siphoning Strike",
          "description": "Nasus strikes his foe, dealing bonus damage and increasing the power of his future Siphoning Strikes if he slays his target."
        }
      ],
      "W": [
        {
          "name": "Wither",
          "description": "Nasus ages an enemy champion, decelerating their movement and attack speed over time."
        }
      ],
      "E": [
        {
          "name": "Spirit Fire",
          "description": "Nasus unleashes a delayed spirit flame at a location, dealing damage and reducing the armor of enemies who stand on it."
        }
      ],
      "R": [
        {
          "name": "Fury of the Sands",
          "description": "Nasus unleashes a mighty sandstorm that batters nearby enemies. While the storm rages, he gains increased health, attack range, damages nearby enemies, has a reduced cooldown on Siphoning Strike, and gains bonus armor and magic resistance."
        }
      ]
    }
  },
  "nautilus": {
    "fullName": "Nautilus, the Titan of the Depths",
    "title": "the Titan of the Depths",
    "id": "nautilus",
    "name": "Nautilus",
    "abilities": {
      "P": [
        {
          "name": "Staggering Blow",
          "description": "Nautilus's first basic attack against a target deals bonus physical damage and immobilizes the opponent briefly. Staggering Blow cannot trigger on the same target more until the timer has worn off."
        }
      ],
      "Q": [
        {
          "name": "Dredge Line",
          "description": "Nautilus throws his anchor forward. If he hits an enemy, he'll drag himself to his target and his target to him. If he hits terrain, he'll drag himself to the terrain, refunding half the cooldown and mana cost."
        }
      ],
      "W": [
        {
          "name": "Titan's Wrath",
          "description": "Nautilus places a shield on himself that absorbs additional damage based on his maximum health. While the shield is active, Nautilus' attacks deal damage over time to units around him."
        }
      ],
      "E": [
        {
          "name": "Riptide",
          "description": "Nautilus creates three exploding waves around himself. Each explosion damages and slows enemies."
        }
      ],
      "R": [
        {
          "name": "Depth Charge",
          "description": "Nautilus launches a depth charge towards a target that picks up speed as it travels. This charge knocks up and stuns all enemies it encounters while traveling and explodes on impact with the target."
        }
      ]
    }
  },
  "neeko": {
    "fullName": "Neeko, the Curious Chameleon",
    "title": "the Curious Chameleon",
    "id": "neeko",
    "name": "Neeko",
    "abilities": {
      "P": [
        {
          "name": "Inherent Glamour",
          "description": "Neeko can look like an ally champion. Taking damage from enemy Champions or casting damaging spells breaks the disguise."
        }
      ],
      "Q": [
        {
          "name": "Blooming Burst",
          "description": "Neeko throws a seed dealing magic damage. The seed blooms again on hitting champions or killing units."
        }
      ],
      "W": [
        {
          "name": "Shapesplitter",
          "description": "Neeko passively deals bonus magic damage every third attack. Neeko can activate to send a clone in a direction."
        }
      ],
      "E": [
        {
          "name": "Tangle-Barbs",
          "description": "Neeko slings a tangle that damage and root everything it passes through. If the tangle kills an enemy or passes through a champion, it becomes larger, faster, and roots for longer."
        }
      ],
      "R": [
        {
          "name": "Pop Blossom",
          "description": "After a short preparation, Neeko leaps into the air and gains a shield. Upon landing, nearby enemies are damaged and stunned. The preparation is hidden if Neeko is disguised."
        }
      ]
    }
  },
  "nidalee": {
    "fullName": "Nidalee, the Bestial Huntress",
    "title": "the Bestial Huntress",
    "id": "nidalee",
    "name": "Nidalee",
    "abilities": {
      "P": [
        {
          "name": "Prowl",
          "description": "Moving through brush increases Nidalee's movement speed by 10% for 2 seconds, increased to 30% toward visible enemy champions within a range of 1400. Damaging champions or neutral monsters with Javelin Toss or Bushwhack marks them as 'Hunted' for 4 seconds, granting Nidalee vision of them, 30% increased movement speed toward them (within a range of 1400) and enhancing her next Takedown, Pounce, and Swipe against them. Also grants 10% movement speed to other directions."
        }
      ],
      "Q": [
        {
          "name": "Javelin Toss",
          "description": "Nidalee tosses her javelin forward in a line, dealing magic damage to the first enemy it hits, which is increased depending on distance traveled."
        },
        {
          "name": "Javelin Toss / Takedown",
          "description": "In human form, Nidalee throws a spiked javelin at her target that gains damage if it exceeds Nidalee's basic attack range. It also marks the hit enemy as Hunted. As a cougar her next basic attack deals bonus damage which deals higher damage the lower the enemy is. She also gains +75 range when using Takedown."
        },
        {
          "name": "Takedown",
          "description": "Nidalee's next basic attack deals bonus damage which deals higher damage the lower the enemy is and gains +75 range. If the enemy is Hunted, Takedown will deal 40% increased damage."
        }
      ],
      "W": [
        {
          "name": "Bushwhack",
          "description": "Nidalee lays an invisible trap for unwary opponents that, when sprung, deals magic damage and marks the enemy as Hunted."
        },
        {
          "name": "Bushwhack / Pounce",
          "description": "In human form, Nidalee lays an invisible trap for unwary opponents that, when sprung, deals magic damage and marks the enemy as Hunted. As a cougar, she lunges forward, dealing magic damage to enemies around her landing area. If the enemy is Hunted, Nidalee will have extra range on Pounce whilst jumping directly at her target and the cooldown of the ability will be reduced. Killing a unit in cougar form will also reduce Pounce's cooldown."
        },
        {
          "name": "Pounce",
          "description": "Nidalee lunges forward, dealing magic damage to enemies around her landing area. If the enemy is Hunted, Nidalee will have extra range on Pounce whilst jumping directly at her target and the cooldown of the ability will be reduced. Killing a unit in cougar form will also reduce Pounce's cooldown."
        }
      ],
      "E": [
        {
          "name": "Primal Surge",
          "description": "Nidalee channels the spirit of the cougar to heal her allies and imbide them with attack speed for a short duration."
        },
        {
          "name": "Primal Surge / Swipe",
          "description": "In human form, Nidalee channels the spirit of the cougar to heal her allies and imbide them with attack speed for a short duration. As a cougar, she rapidly claws enemies in front of her."
        },
        {
          "name": "Swipe",
          "description": "Nidalee rapidly claws enemies in front of her dealing magic damage."
        }
      ],
      "R": [
        {
          "name": "Aspect Of The Cougar",
          "description": "Nidalee transforms herself into a cougar."
        }
      ]
    }
  },
  "nilah": {
    "fullName": "Nilah, The Joy Unbound",
    "title": "The Joy Unbound",
    "id": "nilah",
    "name": "Nilah",
    "abilities": {
      "P": [
        {
          "name": "Joy Unending",
          "description": "Nilah gains increased experience from last-hitting minions along with the ability to enhance and share nearby healing and shielding from her allies."
        }
      ],
      "Q": [
        {
          "name": "Formless Blade",
          "description": "With a snap of her whip-blade, Nilah damages any enemies she hits in a straight line in her chosen direction. This action extends her attack range for a short duration."
        }
      ],
      "W": [
        {
          "name": "Jubilant Veil",
          "description": "Nilah envelops herself in mist, increasing her movement speed and allowing her to gracefully dodge all incoming attacks. Any allies she touches during the mist's duration will also gain this effect."
        }
      ],
      "E": [
        {
          "name": "Slipstream",
          "description": "Nilah enthusiastically dashes toward her target, dealing damage to any enemies she passes through on the way."
        }
      ],
      "R": [
        {
          "name": "Apotheosis",
          "description": "Twirling her whip-blade in joyful exuberance, Nilah deals damage to enemies around her before pulling them closer with her weapon."
        }
      ]
    }
  },
  "nocturne": {
    "fullName": "Nocturne, the Eternal Nightmare",
    "title": "the Eternal Nightmare",
    "id": "nocturne",
    "name": "Nocturne",
    "abilities": {
      "P": [
        {
          "name": "Umbra Blades",
          "description": "Every few seconds, Nocturne's next attack strikes surrounding enemies for bonus physical damage and heals himself. Nocturne's basic attacks reduce this cooldown."
        }
      ],
      "Q": [
        {
          "name": "Duskbringer",
          "description": "Nocturne throws a shadow blade which deals damage, leaves a Dusk Trail, and causes champions to leave a Dusk Trail. While on the trail, Nocturne ignores unit collision and has increased Movement Speed and Attack Damage."
        }
      ],
      "W": [
        {
          "name": "Shroud of Darkness",
          "description": "Nocturne empowers his blades, passively gaining attack speed. Activating Shroud of Darkness allows Nocturne to fade into the shadows, creating a magical barrier which blocks a single enemy spell and doubles his passive attack speed if successful."
        }
      ],
      "E": [
        {
          "name": "Unspeakable Horror",
          "description": "Nocturne plants a nightmare into his target's mind, dealing damage each second and fearing the target if they do not get out of range by the end of the duration. Nocturne also gains massively increased movement speed when moving toward feared targets."
        }
      ],
      "R": [
        {
          "name": "Paranoia",
          "description": "Nocturne reduces the sight radius of all enemy champions and removes their ally vision for 6 seconds, this includes champions, minions, wards and towers. He can then launch himself at an enemy champion with a large range. Deals physical damage on arrival."
        }
      ]
    }
  },
  "nunu__willump": {
    "fullName": "Nunu & Willump, the Boy and His Yeti",
    "title": "the Boy and His Yeti",
    "id": "nunu__willump",
    "name": "Nunu & Willump",
    "abilities": {
      "P": [
        {
          "name": "Call of the Freljord",
          "description": "Nunu increases the attack speed and movement speed of Willump and a nearby ally, and causes Willump's basic attacks to damage enemies around the target."
        }
      ],
      "Q": [
        {
          "name": "Consume",
          "description": "Willump takes a bite of a target enemy, dealing damage and healing himself, increased by 50% when below 50% of maximum health. Against champions, deals magic damage, and against minions and monsters deals true damage."
        }
      ],
      "W": [
        {
          "name": "Biggest Snowball Ever!",
          "description": "Willump creates a snowball that grows in size and speed as he rolls it. The snowball damages and knocks up enemies."
        }
      ],
      "E": [
        {
          "name": "Snowball Barrage",
          "description": "Nunu throws multiple snowballs that damage enemies. When he's finished, Willump roots any champions or large monsters that were hit by a snowball."
        }
      ],
      "R": [
        {
          "name": "Absolute Zero",
          "description": "Nunu & Willump sap heat from the area around them for up to 3 seconds, gaining a shield and slowing all nearby enemies. Enemies caught in the area when the channel ends are dealt massive damage."
        }
      ]
    }
  },
  "olaf": {
    "fullName": "Olaf, the Berserker",
    "title": "the Berserker",
    "id": "olaf",
    "name": "Olaf",
    "abilities": {
      "P": [
        {
          "name": "Berserker Rage",
          "description": "Olaf gains attack speed and life steal depending on his missing health."
        }
      ],
      "Q": [
        {
          "name": "Undertow",
          "description": "Olaf throws an axe into the ground at a target location, dealing damage to enemies it passes through and reducing their armor and movement speed. If Olaf picks up the axe, the ability's cooldown is reset."
        }
      ],
      "W": [
        {
          "name": "Tough It Out",
          "description": "Olaf's attack Speed is increased, he reduces incoming damage, and he gains a shield."
        }
      ],
      "E": [
        {
          "name": "Reckless Swing",
          "description": "Olaf attacks with such force that it deals true damage to his target and himself, refunding the health cost if he destroys the target."
        }
      ],
      "R": [
        {
          "name": "Ragnarok",
          "description": "Olaf passively gains increased armor and magic resist. He can activate this ability to become immune to disables for as long as he keeps attacking."
        }
      ]
    }
  },
  "orianna": {
    "fullName": "Orianna, the Lady of Clockwork",
    "title": "the Lady of Clockwork",
    "id": "orianna",
    "name": "Orianna",
    "abilities": {
      "P": [
        {
          "name": "Clockwork Windup",
          "description": "Orianna's autoattacks deal additional magic damage every hit, subsequent attacks on the same target within a few seconds will add more damage per hit. This bonus stacks up to three times."
        }
      ],
      "Q": [
        {
          "name": "Command: Attack",
          "description": "Orianna commands her Ball to fire toward a target location, dealing magic damage to targets along the way (deals less damage to subsequent targets). Her Ball remains at the target location after."
        }
      ],
      "W": [
        {
          "name": "Command: Dissonance",
          "description": "Orianna commands her ball to emit a magnetic pulse, dealing damage to units around it. Afterwards, the ball leaves a field behind for a few seconds that speeds up allies and slows enemies."
        }
      ],
      "E": [
        {
          "name": "Command: Protect",
          "description": "Passive: The allied champion the ball is attached to gains bonus Armor and Magic Resistance. Active: Orianna commands her ball to fly to and attach onto an allied champion, dealing damage to enemies it passes through and shielding the allied champion when it arrives."
        }
      ],
      "R": [
        {
          "name": "Command: Shockwave",
          "description": "Orianna commands her ball to emit a shockwave after a short delay, flinging affected enemies in the vicinity into the air a set distance (350 units) towards, and possibly over, her ball."
        }
      ]
    }
  },
  "ornn": {
    "fullName": "Ornn, The Fire Below the Mountain",
    "title": "The Fire Below the Mountain",
    "id": "ornn",
    "name": "Ornn",
    "abilities": {
      "P": [
        {
          "name": "Living Forge",
          "description": "Ornn gains an additional bonus armor and magic resistance from all sources. Ornn can spend gold to forge non-consumable items anywhere. Additionally, he can create masterwork items for himself and for his allies."
        }
      ],
      "Q": [
        {
          "name": "Volcanic Rupture",
          "description": "Ornn slams his hammer into the ground, sending a fissure in the target direction that stops early if an enemy champion is hit, dealing physical damage and slowing enemies hit for 2 seconds. After a short delay, an impassable magma pillar erupts at maximum range for 4 seconds."
        }
      ],
      "W": [
        {
          "name": "Bellows Breath",
          "description": "Ornn advances, breathing fire. Enemies hit by the final gout of flame become Brittle."
        }
      ],
      "E": [
        {
          "name": "Searing Charge",
          "description": "Ornn charges forward, dealing physical damage to enemies he passes through. The dash stops upon colliding with terrain, creating a shockwave that knocks up nearby enemies for 1 second. Magma pillars and terrain created by enemy champions caught in the shockwave are destroyed."
        }
      ],
      "R": [
        {
          "name": "Call of the Forge God",
          "description": "Ornn summons a massive elemental at a location which travels toward him with increasing speed. Enemies run over by the elemental take damage, are slowed and are made Brittle. Ornn can recast the ability to charge into the elemental, redirecting it in the direction he hits it, causing the elemental to affect any enemies it runs over to be knocked up, dealing the same damage and re-applying Brittle."
        }
      ]
    }
  },
  "pantheon": {
    "fullName": "Pantheon, the Unbreakable Spear",
    "title": "the Unbreakable Spear",
    "id": "pantheon",
    "name": "Pantheon",
    "abilities": {
      "P": [
        {
          "name": "Mortal Will",
          "description": "Every few spells or attacks, Pantheon's next spell is empowered."
        }
      ],
      "Q": [
        {
          "name": "Comet Spear",
          "description": "Pantheon either thrusts his spear to deal physical damage to enemies while refunding 60% of Spear Comet's cooldown, or throws it in a target direction, dealing physical damage which is increased against targets below 20% of their maximum health but reduced by 30% against minions and monsters. If Mortal Will is active, Comet Spear deals additional physical damage and slows the target for 2.5 seconds."
        }
      ],
      "W": [
        {
          "name": "Shield Vault",
          "description": "Pantheon dashes to a target, damaging and stunning them. If Mortal Will is active, his next basic attacks strikes 3 times."
        }
      ],
      "E": [
        {
          "name": "Aegis Assault",
          "description": "Pantheon sets his shield, becoming invulnerable to damage from the front and striking repeatedly with his spear."
        }
      ],
      "R": [
        {
          "name": "Grand Starfall",
          "description": "Pantheon composes himself and then leaps into the air, landing at a chosen location as a comet."
        }
      ]
    }
  },
  "poppy": {
    "fullName": "Poppy, Keeper of the Hammer",
    "title": "Keeper of the Hammer",
    "id": "poppy",
    "name": "Poppy",
    "abilities": {
      "P": [
        {
          "name": "Iron Ambassador",
          "description": "Poppy throws her buckler that bounces off the target. Poppy can pick it up to gain a temporary shield."
        }
      ],
      "Q": [
        {
          "name": "Hammer Shock",
          "description": "Poppy swings her hammer, dealing damage and creating a zone that will slow enemies and explode after a delay."
        }
      ],
      "W": [
        {
          "name": "Steadfast Presence",
          "description": "Poppy passively gains armor and magic resist. This bonus increases when she is low on health. Poppy can activate Steadfast Presence to gain movement speed and stop enemy dashes around her. If a dash is stopped, the enemy is slowed and grounded."
        }
      ],
      "E": [
        {
          "name": "Heroic Charge",
          "description": "Poppy dashes to the target and pushes it back. If the target is pushed into a wall, it is stunned."
        }
      ],
      "R": [
        {
          "name": "Keeper's Verdict",
          "description": "Poppy channels a hammer strike that knocks enemies very far away."
        }
      ]
    }
  },
  "pyke": {
    "fullName": "Pyke, the Bloodharbor Ripper",
    "title": "the Bloodharbor Ripper",
    "id": "pyke",
    "name": "Pyke",
    "abilities": {
      "P": [
        {
          "name": "Gift of the Drowned Ones",
          "description": "When Pyke is hidden from enemies, he regenerates damage that he has recently taken from champions. Pyke also cannot gain extra maximum health from any source, and instead gains bonus attack damage."
        }
      ],
      "Q": [
        {
          "name": "Bone Skewer",
          "description": "Pyke either stabs an enemy in front of him or pulls an enemy towards him."
        }
      ],
      "W": [
        {
          "name": "Ghostwater Dive",
          "description": "Pyke enters camouflage and gains significant movement speed that decays over time."
        }
      ],
      "E": [
        {
          "name": "Phantom Undertow",
          "description": "Pyke dashes and leaves behind a phantom that will return to him, stunning enemy champions along its path."
        }
      ],
      "R": [
        {
          "name": "Death from Below",
          "description": "Pyke blinks to and executes low health enemies, allowing him to cast this spell again and granting additional gold to an ally who assists."
        }
      ]
    }
  },
  "qiyana": {
    "fullName": "Qiyana, Empress of the Elements",
    "title": "Empress of the Elements",
    "id": "qiyana",
    "name": "Qiyana",
    "abilities": {
      "P": [
        {
          "name": "Royal Privilege",
          "description": "Qiyana's first attack or ability against an enemy champ deals bonus physical damage. This effect cannot occur on the same target more than once every 25 seconds. Royal Privilege's cooldown on all targets resets when she draws a new element."
        }
      ],
      "Q": [
        {
          "name": "Edge of Ixtal",
          "description": "Qiyana swings her weapon, dealing damage with a bonus effect based on her element."
        }
      ],
      "W": [
        {
          "name": "Terrashape",
          "description": "Targeting an element, Qiyana dashes forward to gather its power. While enchanted, Qiyana gains bonus out-of-combat movement speed, bonus attack speed, and her basic attacks and basic abilities deal bonus magic damage while moving through the element currently being held."
        }
      ],
      "E": [
        {
          "name": "Audacity",
          "description": "Qiyana dashes to an enemy, damaging them."
        }
      ],
      "R": [
        {
          "name": "Supreme Display of Talent",
          "description": "Qiyana creates a shockwave, knocking back enemies. Any River, Brush, or Wall hit by the shockwave then explodes, dealing physical damage and briefly stunning enemies."
        }
      ]
    }
  },
  "quinn": {
    "fullName": "Quinn, Demacia's Wings",
    "title": "Demacia's Wings",
    "id": "quinn",
    "name": "Quinn",
    "abilities": {
      "P": [
        {
          "name": "Harrier",
          "description": "Valor, Quinn's Demacian eagle, periodically marks enemies as vulnerable. Quinn's first basic attack against vulnerable targets will deal bonus physical damage."
        }
      ],
      "Q": [
        {
          "name": "Blinding Assault",
          "description": "Quinn calls Valor to mark an enemy and hinder its vision before damaging all enemies in the immediate area."
        }
      ],
      "W": [
        {
          "name": "Heightened Senses",
          "description": "Passive: Attacking a Vulnerable target will increase Quinn’s Attack Speed and Movement Speed for a few seconds. Active: Valor rushes to the skies, revealing a large area around Quinn, including all brush and non-stealthed units."
        }
      ],
      "E": [
        {
          "name": "Vault",
          "description": "Quinn dashes to an enemy, dealing physical damage and slowing the target's movement speed. This slow decays over 1.5 seconds. Upon reaching the target, she leaps off the target, briefly interrupting it, and lands near her maximum attack Range away from the target."
        }
      ],
      "R": [
        {
          "name": "Behind Enemy Lines",
          "description": "Quinn and Valor team up to fly around at great speed. Ending the ability casts Skystrike, which deals damage to nearby enemies and marks champions as Vulnerable."
        },
        {
          "name": "Skystrike",
          "description": "Quinn performs Skystrike as Valor leaves, dealing physical damage and applying Vulnerable marks to all enemies in a large area."
        }
      ]
    }
  },
  "rakan": {
    "fullName": "Rakan, The Charmer",
    "title": "The Charmer",
    "id": "rakan",
    "name": "Rakan",
    "abilities": {
      "P": [
        {
          "name": "Fey Feathers",
          "description": "Rakan periodically gains a shield."
        },
        {
          "name": "Lover's Leap",
          "description": "Xayah and Rakan can recall together."
        }
      ],
      "Q": [
        {
          "name": "Gleaming Quill",
          "description": "Flings a magical feather that deals magic damage. Striking a champion or epic monster enables Rakan to heal his allies."
        }
      ],
      "W": [
        {
          "name": "Grand Entrance",
          "description": "Dashes to a location, knocking up nearby enemies on arrival."
        }
      ],
      "E": [
        {
          "name": "Battle Dance",
          "description": "Flies to an allied champion granting them a shield. Can be re-cast for free for a short duration."
        }
      ],
      "R": [
        {
          "name": "The Quickness",
          "description": "Rakan gains 50% bonus movement speed for the next 4 seconds, dealing magic damage and charming each enemy he touches. Enemies can only be affected once. The first champion charmed grants Rakan 150% decaying movement speed. Rakan benefits from 50% bonus movement speed for the duration, which is briefly increased to 200% upon first damaging an enemy champion before decaying back down to 50%."
        }
      ]
    }
  },
  "rammus": {
    "fullName": "Rammus, the Armordillo",
    "title": "the Armordillo",
    "id": "rammus",
    "name": "Rammus",
    "abilities": {
      "P": [
        {
          "name": "Spiked Shell",
          "description": "Rammus' basic attacks deal bonus magic damage, scaling with his armor."
        }
      ],
      "Q": [
        {
          "name": "Powerball",
          "description": "Rammus accelerates in a ball towards his enemies, dealing damage and slowing targets affected by the impact."
        }
      ],
      "W": [
        {
          "name": "Defensive Ball Curl",
          "description": "Rammus goes into a defensive formation, vastly increasing his Armor and Magic Resistance, amplifying Spiked Shells' damage, and returning damage to enemies that basic attack him, but he is also slowed during this time."
        }
      ],
      "E": [
        {
          "name": "Frenzying Taunt",
          "description": "Rammus taunts an enemy champion or monster into a reckless assault against him. Additionally, he gains increased attack speed for a short time, but this bonus is extended by having any of his other spells active."
        }
      ],
      "R": [
        {
          "name": "Soaring Slam",
          "description": "Rammus hops into the air and slams down at a target area, dealing magic damage and slowing enemies. If cast while Rammus is in Powerball, Rammus knocks up enemies near the center as well."
        }
      ]
    }
  },
  "reksai": {
    "fullName": "Rek'Sai, the Void Burrower",
    "title": "the Void Burrower",
    "id": "reksai",
    "name": "Rek'Sai",
    "abilities": {
      "P": [
        {
          "name": "Fury of the Xer'Sai",
          "description": "Rek'sai generates Fury by attack and hitting with basic abilities. She consumes this Fury while Burrowed to restore health."
        }
      ],
      "Q": [
        {
          "name": "Prey Seeker",
          "description": "While Burrowed, Rek'Sai launches a burst of void-charged earth that deals physical damage and reveals enemies hit."
        },
        {
          "name": "Queen's Wrath",
          "description": "Rek'Sai's next 3 basic attacks deal bonus physical damage to nearby enemies."
        },
        {
          "name": "Queen's Wrath / Prey Seeker",
          "description": "Rek'Sai's next 3 basic attacks deal bonus physical damage to nearby enemies. While Burrowed, Rek'Sai launches a burst of void-charged earth that deals physical damage and reveals enemies hit."
        }
      ],
      "W": [
        {
          "name": "Burrow",
          "description": "Rek'Sai burrows into the ground, gaining new abilities and increased movement speed. Her vision range is reduced and she cannot use basic attacks. While Burrowed, Rek'Sai may cast Un-burrow to knock up and damage nearby enemies."
        },
        {
          "name": "Burrow / Unburrow",
          "description": "Rek'Sai burrows into the ground, gaining new abilities and increased movement speed. Her vision range is reduced and she cannot use basic attacks. While Burrowed, Rek'Sai may cast Un-burrow to knock up and damage nearby enemies."
        },
        {
          "name": "Unburrow",
          "description": "Rek'Sai bursts out of the ground, dealing physical damage and knocking up the closest enemy for a second, and briefly knocking aside other surrounding enemies. Rek'Sai can attempt to basic attack enemies while burrowed to trigger Unburrow."
        }
      ],
      "E": [
        {
          "name": "Furious Bite",
          "description": "Rek'Sai bites her target, dealing double and true damage if she has max Fury."
        },
        {
          "name": "Furious Bite / Tunnel",
          "description": "Rek'Sai bites her target, dealing double and True Damage if she has max Fury. While Burrowed, Rek'Sai creates a re-usable, long lasting tunnel. Enemies can destroy it by standing on top of either entrance."
        },
        {
          "name": "Tunnel",
          "description": "Rek'Sai tunnels forward, leaving two connected tunnel entrances for 10 minutes. Rek'Sai can click on one of the entrances to tunnel to the other one, and tunnels each have a 10 second cooldown between uses. Rek'Sai can have up to 8 tunnels at once."
        }
      ],
      "R": [
        {
          "name": "Void Rush",
          "description": "Rek'Sai marks champions she damages and can dash to a marked target, dealing damage based off their missing health."
        }
      ]
    }
  },
  "rell": {
    "fullName": "Rell, the Iron Maiden",
    "title": "the Iron Maiden",
    "id": "rell",
    "name": "Rell",
    "abilities": {
      "P": [
        {
          "name": "Break the Mold",
          "description": "Rell attacks slowly but steals her target's Armor and Magic Resist on hit, dealing bonus damage based on the amount stolen."
        }
      ],
      "Q": [
        {
          "name": "Shattering Strike",
          "description": "Rell thrusts her lance to deal magic damage to units in a line, breaking their shields. The first unit hit additionally suffers Break the Mold's defense steal. If Rell is bound to an ally with Attract and Repel, they both recover health for each enemy champion hit by this spell."
        }
      ],
      "W": [
        {
          "name": "Ferromancy - Crash Down",
          "description": "Passive: Rell gains additional movement speed while mounted and additional armor and magic resist while armored. Active: Rell changes forms, casting a different spell based on form. Mounted: Rell crashes down in her armor, knocking enemies up and gaining a large shield. Armored: Rell forms her mount, gaining a burst of speed and flipping the next enemy she attacks."
        },
        {
          "name": "Ferromancy - Crash Down / Mount Up",
          "description": "Passive: Rell gains additional movement speed while mounted and additional armor and magic resist while armored. Active: Rell changes forms, casting a different spell based on form. Mounted: Rell crashes down in her armor, knocking enemies up and gaining a large shield. Armored: Rell forms her mount, gaining a burst of speed and flipping the next enemy she attacks."
        },
        {
          "name": "Ferromancy: Mount Up",
          "description": "Passive: Rell gains additional movement speed while mounted and additional armor and magic resist while armored. Active: Rell changes forms, casting a different spell based on form. Mounted: Rell crashes down in her armor, knocking enemies up and gaining a large shield. Armored: Rell forms her mount, gaining a burst of speed and flipping the next enemy she attacks."
        }
      ],
      "E": [
        {
          "name": "Attract and Repel",
          "description": "Rell binds a piece of her armor to another allied champion to grant them armor and magic resist while near. While she has an ally bound in this way, Rell can cast this ability without targeting an allied champion to snap the binding and stun enemies caught in it."
        }
      ],
      "R": [
        {
          "name": "Magnet Storm",
          "description": "Rell explodes in a magnetic fury, violently pulling nearby enemies towards herself. Then Rell constantly drags nearby enemies towards herself for a short while, dealing magic damage over time."
        }
      ]
    }
  },
  "renata_glasc": {
    "fullName": "Renata Glasc, the Chem-Baroness",
    "title": "the Chem-Baroness",
    "id": "renata_glasc",
    "name": "Renata Glasc",
    "abilities": {
      "P": [
        {
          "name": "Leverage",
          "description": "Renata's attacks deal bonus damage and mark enemies. Renata's allies can damage marked enemies to deal bonus damage."
        }
      ],
      "Q": [
        {
          "name": "Handshake",
          "description": "Renata sends out a missile rooting the first enemy hit, and can recast the ability to throw the unit in a direction."
        }
      ],
      "W": [
        {
          "name": "Bailout",
          "description": "Renata buffs an allied champion to fight harder, delaying their death and potentially saving them if they get a takedown."
        }
      ],
      "E": [
        {
          "name": "Loyalty Program",
          "description": "Renata sends out a pair of chemtech missiles, shielding allies and damaging and slowing enemies hit."
        }
      ],
      "R": [
        {
          "name": "Hostile Takeover",
          "description": "Renata sends out a wave of chemicals, causing any enemies hit to go Berserk."
        }
      ]
    }
  },
  "renekton": {
    "fullName": "Renekton, the Butcher of the Sands",
    "title": "the Butcher of the Sands",
    "id": "renekton",
    "name": "Renekton",
    "abilities": {
      "P": [
        {
          "name": "Reign of Anger",
          "description": "Renekton's attacks generate Fury, increased when he is low on life. This Fury can empower his abilities with bonus effects."
        }
      ],
      "Q": [
        {
          "name": "Cull the Meek",
          "description": "Renekton swings his blade, dealing moderate physical damage to all targets around him, and heals for a small portion of the damage dealt. If he has more than 50 Fury, his damage and heal are increased."
        }
      ],
      "W": [
        {
          "name": "Ruthless Predator",
          "description": "Renekton slashes his target twice, dealing moderate physical damage and stuns them for 0.75 seconds. If Renekton has more than 50 Fury, he slashes his target three times, destroying damage shields on the target, dealing high physical damage, and stunning them for 1.5 seconds."
        }
      ],
      "E": [
        {
          "name": "Slice and Dice",
          "description": "Renekton dashes, dealing damage to units along the way. Empowered, Renekton deals bonus damage and reduces the armor of units hit."
        }
      ],
      "R": [
        {
          "name": "Dominus",
          "description": "Renekton transforms into the Tyrant form, gaining bonus health and dealing damage to enemies around him. While in this form, Renekton gains Fury periodically."
        }
      ]
    }
  },
  "rengar": {
    "fullName": "Rengar, the Pridestalker",
    "title": "the Pridestalker",
    "id": "rengar",
    "name": "Rengar",
    "abilities": {
      "P": [
        {
          "name": "Unseen Predator",
          "description": "While in brush, basic attacking causes Rengar to leap towards his target. Leaping to enter combat generates 1 Ferocity. At 4 Ferocity his next ability is empowered. Casting an empowered ability increases Rengar's movement speed for a short duration. Killing unique champions grants Rengar their trophies, increasing the strength of his Bonetooth Necklace."
        }
      ],
      "Q": [
        {
          "name": "Empowered Savagery",
          "description": "Rengar's next attack brutally stabs his target for bonus damage. Ferocity effect: deals increased damage and grants attack speed."
        },
        {
          "name": "Savagery",
          "description": "Rengar's next attack brutally stabs his target for bonus damage. Ferocity effect: deals increased damage and grants attack speed."
        }
      ],
      "W": [
        {
          "name": "Battle Roar",
          "description": "Rengar lets out a battle roar, damaging enemies and healing for some of the recent damage he has taken. Ferocity effect: additionally breaks crowd control effects."
        },
        {
          "name": "Empowered Battle Roar",
          "description": "Battle Roar's magic damage is increased and additionally cleanses Rengar of all crowd control."
        }
      ],
      "E": [
        {
          "name": "Bola Strike",
          "description": "Rengar throws a bola, slowing the first target hit for a short duration. Ferocity effect: roots the target."
        },
        {
          "name": "Empowered Bola Strike",
          "description": "Max Ferocity: Deals increased physical damage and roots for a few seconds."
        }
      ],
      "R": [
        {
          "name": "Thrill of the Hunt",
          "description": "Rengar activates his predatory instincts, becoming camouflaged for the duration. While active, Rengar gains bonus movement speed and vision of the nearest enemy champion. Rengar can leap without being in brush during this time, and leaping to the revealed champion results in bonus damage and armor shredding. Attacking or using abilities ends Thrill of the Hunt."
        }
      ]
    }
  },
  "riven": {
    "fullName": "Riven, the Exile",
    "title": "the Exile",
    "id": "riven",
    "name": "Riven",
    "abilities": {
      "P": [
        {
          "name": "Runic Blade",
          "description": "Riven's abilities charge her blade for 6 seconds, causing her to deal a percentage of her total attack damage as bonus physical damage on her next basic attack. Riven can store up to 3 charges, and can only expend one at a time. Runic Blade is affected by critical strike modifiers."
        }
      ],
      "Q": [
        {
          "name": "Broken Wings",
          "description": "Riven steps forward and lashes out in a series of powerful sword slashes. This ability can be activated up to 3 times in a short period. 1st Use/2nd Use: Deals physical damage to a small area in front of her. 3rd Use: Jumps into the air and slams downward, causing a larger impact nova that deals physical damage and knocks nearby enemies up."
        }
      ],
      "W": [
        {
          "name": "Ki Burst",
          "description": "Riven damages and stuns nearby enemies."
        }
      ],
      "E": [
        {
          "name": "Valor",
          "description": "Riven dashes forward and gains a shield for 1.5 seconds."
        }
      ],
      "R": [
        {
          "name": "Blade of the Exile",
          "description": "Riven's sword reforms, giving her a bonus 20% Attack Damage, extended range on her damaging abilities and basic attacks for 15 seconds. She is also granted the ability to use Wind Slash once for the duration."
        },
        {
          "name": "Wind Slash",
          "description": "Riven empowers her keepsake weapon with energy, and gains attack damage and range. During this time, she also gains the ability to use Wind Slash, a powerful ranged attack, once."
        }
      ]
    }
  },
  "rumble": {
    "fullName": "Rumble, the Mechanized Menace",
    "title": "the Mechanized Menace",
    "id": "rumble",
    "name": "Rumble",
    "abilities": {
      "P": [
        {
          "name": "Junkyard Titan",
          "description": "Every spell Rumble casts gives him Heat. When he reaches 50% Heat he reaches Danger Zone, granting all his basic abilities bonus effects. When he reaches 100% Heat, he starts Overheating, gaining bonus attack speed and granting his basic attacks bonus damage, but making him unable to cast spells for a few seconds."
        }
      ],
      "Q": [
        {
          "name": "Flamespitter",
          "description": "Rumble begins torching the area in front of him with his flamethrower, dealing damage to all units in a cone in front of him for 3 seconds. Flamespitter deals 25% reduced damage to minions. Rumble can move, attack and use other abilities while the flamethrower is on. While in the \"Danger Zone\", this spell deals additional damage."
        }
      ],
      "W": [
        {
          "name": "Scrap Shield",
          "description": "Rumble creates a shield blocking incoming damage and receives a short movement speed boost. While in the \"Danger Zone\", the shield's strength and movement speed boost are increased."
        }
      ],
      "E": [
        {
          "name": "Electro-Harpoon",
          "description": "Rumble launches a harpoon, electrocuting his target with magic damage, slowing their Move Speed, and reducing their Magic Resist. Rumble can carry 2 harpoons at a time. While in Danger Zone the damage and slow percentage is increased."
        }
      ],
      "R": [
        {
          "name": "The Equalizer",
          "description": "Rumble fires off a group of rockets, creating a wall of flames that damages and slows enemies."
        }
      ]
    }
  },
  "ryze": {
    "fullName": "Ryze, the Rune Mage",
    "title": "the Rune Mage",
    "id": "ryze",
    "name": "Ryze",
    "abilities": {
      "P": [
        {
          "name": "Arcane Mastery",
          "description": "Ryze's spells deal extra damage based on his bonus mana, and his maximum mana is increased by a percentage."
        }
      ],
      "Q": [
        {
          "name": "Overload",
          "description": "Passively, Ryze's other basic abilities reset the cooldown of Overload and charge a rune. When Ryze casts Overload with 2 runes charged, he gains a brief burst of movement speed. On cast, Ryze throws a charge of pure energy in a line, dealing damage to the first enemy struck. If the target has Flux on it, Overload deals extra damage and bounces to nearby enemies with Flux."
        }
      ],
      "W": [
        {
          "name": "Rune Prison",
          "description": "Ryze traps a target in a cage of runes, damaging them and slowing their movement. If the target has Flux on it, they are instead rooted."
        }
      ],
      "E": [
        {
          "name": "Spell Flux",
          "description": "Ryze releases an orb of pure magical power that damages an enemy and debuffs all nearby enemies. Ryze's spells have additional effects against the debuffed enemy."
        }
      ],
      "R": [
        {
          "name": "Realm Warp",
          "description": "Passive: Increases Overload's damage against targets marked with Spell Flux. Active: Ryze opens a portal to a nearby location. After 2 seconds, all allied units within the portal's sphere are warped to the target location. If Ryze becomes unable to cast or move, Realm Warp is cancelled."
        }
      ]
    }
  },
  "samira": {
    "fullName": "Samira, the Desert Rose",
    "title": "the Desert Rose",
    "id": "samira",
    "name": "Samira",
    "abilities": {
      "P": [
        {
          "name": "Daredevil Impulse",
          "description": "Samira builds a combo by hitting attacks or abilities unique from the previous hit. Samira's attacks in melee range deal additional magic damage. Samira's attacks against enemies affected by Immobilizing effects will dash her to her attack range. If the enemy is Knocked Up, she also keeps them Knocked Up briefly."
        }
      ],
      "Q": [
        {
          "name": "Flair",
          "description": "Samira fires a shot or swings her sword, dealing damage. If cast during Wild Rush, strike all enemies in her path upon completion."
        }
      ],
      "W": [
        {
          "name": "Blade Whirl",
          "description": "Samira slashes around her, damaging enemies and destroying enemy missiles."
        }
      ],
      "E": [
        {
          "name": "Wild Rush",
          "description": "Samira dashes through an enemy (including structures), slashing enemies she passes through and gaining attack speed. Killing an enemy champion refreshes this ability's cooldown."
        }
      ],
      "R": [
        {
          "name": "Inferno Trigger",
          "description": "Samira unleashes a torrent of shots from her weapons, wildly shooting all enemies surrounding her."
        }
      ]
    }
  },
  "sejuani": {
    "fullName": "Sejuani, Fury of the North",
    "title": "Fury of the North",
    "id": "sejuani",
    "name": "Sejuani",
    "abilities": {
      "P": [
        {
          "name": "Fury of the North",
          "description": "After being out of combat, Sejuani gains Frost Armor which grants armor and magic resist and immunity to slows. Frost Armor persists for a short time after Sejuani takes damage. Sejuani can damage a stunned enemy to shatter it, dealing massive magic damage."
        }
      ],
      "Q": [
        {
          "name": "Arctic Assault",
          "description": "Sejuani charges forward, dealing magic damage and knocking enemies into the air. The charge stops after colliding with an enemy champion."
        }
      ],
      "W": [
        {
          "name": "Winter's Wrath",
          "description": "Sejuani swings her mace twice, dealing damage, slowing enemies and applying frost stacks."
        }
      ],
      "E": [
        {
          "name": "Permafrost",
          "description": "Sejuani freezes and stuns an enemy champion that has maximum Frost stacks."
        }
      ],
      "R": [
        {
          "name": "Glacial Prison",
          "description": "Sejuani throws her bola that freezes and stuns the first champion hit and creates an ice storm that slows other enemies."
        }
      ]
    }
  },
  "senna": {
    "fullName": "Senna, the Redeemer",
    "title": "the Redeemer",
    "id": "senna",
    "name": "Senna",
    "abilities": {
      "P": [
        {
          "name": "Absolution",
          "description": "When units die near Senna, their souls are periodically trapped by the Black Mist. Senna can attack these souls to free them, absorbing the Mist that held them in death. Mist fuels her Relic Cannon's power with increased attack damage, attack range, and critical strike chance. Attacks from Senna's Relic Cannon take longer to fire, deal bonus damage, and briefly grant her a portion of her target's movement speed."
        }
      ],
      "Q": [
        {
          "name": "Piercing Darkness",
          "description": "From the twin barrels of her Relic Cannon, Senna fires a unified beam of light and shadow through a target, healing allies and damaging enemies."
        }
      ],
      "W": [
        {
          "name": "Last Embrace",
          "description": "Senna sends forth a wave of Black Mist. If it hits an enemy it latches onto them hungrily, rooting them and everything nearby after a brief delay."
        }
      ],
      "E": [
        {
          "name": "Curse of the Black Mist",
          "description": "Senna draws the Mist she has stored in her weapon into a storm around her, embracing darkness and becoming a wraith within. Allies who enter the area are camouflaged and also appear as wraiths as the Mist shrouds them. Wraiths gain increased movement speed, are unselectable, and hide their identities as long as no enemy champions are nearby."
        }
      ],
      "R": [
        {
          "name": "Dawning Shadow",
          "description": "Senna calls upon the relic stones of fallen Sentinels, splitting her relic cannon into a holy array of shadow and light. She then fires a global beam that shields allies from harm, while damaging enemies caught in the center."
        }
      ]
    }
  },
  "seraphine": {
    "fullName": "Seraphine, the Starry-Eyed Songstress",
    "title": "the Starry-Eyed Songstress",
    "id": "seraphine",
    "name": "Seraphine",
    "abilities": {
      "P": [
        {
          "name": "Stage Presence",
          "description": "Every third basic spell will cast twice from Seraphine. Additionally, casting spells near allies grants her bonus magic damage and range on her next basic attack."
        }
      ],
      "Q": [
        {
          "name": "High Note",
          "description": "Seraphine deals damage in an area."
        }
      ],
      "W": [
        {
          "name": "Surround Sound",
          "description": "Seraphine shields and Hastes nearby allies. If she is already shielded she will heal nearby allies as well."
        }
      ],
      "E": [
        {
          "name": "Beat Drop",
          "description": "Seraphine deals damage and impairs the movement of enemies in a line."
        }
      ],
      "R": [
        {
          "name": "Encore",
          "description": "Seraphine deals damage and charms enemies hit, refreshing the range with every allied or enemy champion hit."
        }
      ]
    }
  },
  "sett": {
    "fullName": "Sett, the Boss",
    "title": "the Boss",
    "id": "sett",
    "name": "Sett",
    "abilities": {
      "P": [
        {
          "name": "Pit Grit",
          "description": "Sett's basic attacks alternate between left and right punch. Right punch is slightly stronger and faster. Sett also hates losing, gaining additional health regeneration based off of his missing health."
        }
      ],
      "Q": [
        {
          "name": "Knuckle Down",
          "description": "Sett's next two attacks deal additional damage based off of the target's max health. Sett also gains movement speed while moving towards enemy champions."
        }
      ],
      "W": [
        {
          "name": "Haymaker",
          "description": "Sett passively stores damage he takes as grit. On cast, Sett expends all stored grit to gain a shield and punch an area, dealing true damage in the center and physical damage on the sides."
        }
      ],
      "E": [
        {
          "name": "Facebreaker",
          "description": "Sett pulls in all enemies on opposite sides of him, dealing damage and stunning them. If enemies were only on one side, they are slowed instead of stunned."
        }
      ],
      "R": [
        {
          "name": "The Show Stopper",
          "description": "Sett carries an enemy champion through the air and slams them into the ground, dealing damage and slowing all enemies near where they land."
        }
      ]
    }
  },
  "shaco": {
    "fullName": "Shaco, the Demon Jester",
    "title": "the Demon Jester",
    "id": "shaco",
    "name": "Shaco",
    "abilities": {
      "P": [
        {
          "name": "Backstab",
          "description": "Shaco's basic attacks and Two-Shiv Poison deal additional damage when striking from behind."
        }
      ],
      "Q": [
        {
          "name": "Deceive",
          "description": "Shaco becomes Invisible and teleports to target location. His first attack while Invisible is empowered, dealing bonus damage and critically striking if he attacks from behind."
        }
      ],
      "W": [
        {
          "name": "Jack In The Box",
          "description": "Shaco creates a hidden animated Jack-in-the-Box. When triggered, it will fear and attack nearby enemies."
        }
      ],
      "E": [
        {
          "name": "Two-Shiv Poison",
          "description": "Shaco's shivs passively poison targets on hit, slowing their movement speed. He can throw his shivs to deal damage and poison the target. The thrown shiv deals bonus damage if the target is below 30% health."
        }
      ],
      "R": [
        {
          "name": "Hallucinate",
          "description": "Shaco creates an illusion of himself near him, which can attack nearby enemies (Deals reduced damage to turrets). Upon death, it explodes, spawning three mini Jack in the Boxes and dealing damage to nearby enemies."
        }
      ]
    }
  },
  "shen": {
    "fullName": "Shen, the Eye of Twilight",
    "title": "the Eye of Twilight",
    "id": "shen",
    "name": "Shen",
    "abilities": {
      "P": [
        {
          "name": "Ki Barrier",
          "description": "After casting a spell, Shen gets a shield. Affecting other champions reduces the cooldown of this effect."
        }
      ],
      "Q": [
        {
          "name": "Twilight Assault",
          "description": "Shen recalls his spirit blade to attack with it, dealing damage based on the target's max health. The attacks are greatly empowered if it collides with an enemy champion, and all collided enemies are slowed while running away from Shen."
        }
      ],
      "W": [
        {
          "name": "Spirit's Refuge",
          "description": "Shen's spirit blade creates a defensive zone for 1.75 seconds. Basic attacks that would hit Shen or an allied champion in the zone are blocked. If there are no champions to protect in the zone when it starts, the spirit blade will not activate until one enters or 2 seconds pass."
        }
      ],
      "E": [
        {
          "name": "Shadow Dash",
          "description": "Passively, Shen restores Energy when dealing damage with Shadow Dash or Twilight Assault. When activated, Shen dashes rapidly toward a target location, taunting monsters and enemy champions he encounters."
        }
      ],
      "R": [
        {
          "name": "Stand United",
          "description": "Shen shields target allied champion from incoming damage, and soon after teleports to their location."
        }
      ]
    }
  },
  "shyvana": {
    "fullName": "Shyvana, the Half-Dragon",
    "title": "the Half-Dragon",
    "id": "shyvana",
    "name": "Shyvana",
    "abilities": {
      "P": [
        {
          "name": "Fury of the Dragonborn",
          "description": "Shyvana deals bonus damage to dragons and gains armor and magic resistance. As Shyvana and her allies slay more dragons, she gains more bonus armor and magic resistance."
        }
      ],
      "Q": [
        {
          "name": "Twin Bite",
          "description": "Shyvana strikes twice on her next attack. Basic attacks reduce the cooldown of Twin Bite by half a second. Dragon Form: Twin Bite cleaves all units in front of Shyvana."
        }
      ],
      "W": [
        {
          "name": "Burnout",
          "description": "Shyvana surrounds herself in fire, dealing magic damage per second to nearby enemies moving faster for 3 seconds. Part of this damage is applied again when Shyvana basic attacks an enemy with Burnout active. The Movement Speed reduces over the duration of the spell. Basic attacks extend the duration of Burnout. Dragon Form: Burnout grows in size"
        }
      ],
      "E": [
        {
          "name": "Flame Breath",
          "description": "Shyvana unleashes a fireball that deals damage to all enemies it encounters and leaves cinders on the target, marking them for 5 seconds. Shyvana's basic attacks on marked targets deal a percentage of their maximum health as damage on-hit. Dragon Form: Flame Breath explodes on impact or at target location, dealing bonus damage and scorching the earth for a short duration."
        }
      ],
      "R": [
        {
          "name": "Dragon's Descent",
          "description": "Shyvana transforms into a dragon and takes flight to a target location. Enemies along her path take damage and are knocked toward her target location. Shyvana passively gains Fury per second and gains 2 Fury on basic attack."
        }
      ]
    }
  },
  "singed": {
    "fullName": "Singed, the Mad Chemist",
    "title": "the Mad Chemist",
    "id": "singed",
    "name": "Singed",
    "abilities": {
      "P": [
        {
          "name": "Noxious Slipstream",
          "description": "Singed drafts off nearby champions, gaining a burst of movement speed when passing them."
        }
      ],
      "Q": [
        {
          "name": "Poison Trail",
          "description": "Leaves a trail of poison behind Singed, dealing damage to enemies caught in the path."
        }
      ],
      "W": [
        {
          "name": "Mega Adhesive",
          "description": "Throws a vial of mega adhesive on the ground, slowing and grounding enemies who walk on it."
        }
      ],
      "E": [
        {
          "name": "Fling",
          "description": "Damages target enemy unit and flings them into the air behind Singed. If the target Singed flings lands in his Mega Adhesive, they are also rooted."
        }
      ],
      "R": [
        {
          "name": "Insanity Potion",
          "description": "Singed drinks a potent brew of chemicals, granting him increased combat stats, and making his Poison Trail apply grievous wounds."
        }
      ]
    }
  },
  "sion": {
    "fullName": "Sion, The Undead Juggernaut",
    "title": "The Undead Juggernaut",
    "id": "sion",
    "name": "Sion",
    "abilities": {
      "P": [
        {
          "name": "Death Surge",
          "description": "Sion gains 50% bonus movement speed that decays over 1.5 seconds."
        },
        {
          "name": "Glory in Death",
          "description": "After being killed, Sion will temporarily reanimate with rapidly decaying health. His attacks become very rapid, heal him, and deal bonus damage based on his target's maximum health."
        }
      ],
      "Q": [
        {
          "name": "Decimating Smash",
          "description": "Sion charges a powerful swing in an area in front of himself that will deal damage to enemies when released. If he charges for enough time, enemies hit by the swing will also be knocked up and stunned."
        }
      ],
      "W": [
        {
          "name": "Soul Furnace",
          "description": "Sion passively gains bonus health when he kills enemies. Upon activation, Soul Furnace shields Sion for a few seconds. Soul Furnace can be recast to detonate the shield, dealing damage to nearby enemies."
        }
      ],
      "E": [
        {
          "name": "Roar of the Slayer",
          "description": "Sion bellows in the target direction, dealing magic damage to the first enemy he hits, as well as slowing it and reducing its armor. If the target is not a champion, it will be knocked back - dealing increased damage to all enemies it passes through and slowing them by the same amount for 2.5 seconds. Minions and monsters cannot be knocked through terrain."
        }
      ],
      "R": [
        {
          "name": "Unstoppable Onslaught",
          "description": "Sion charges in a direction, ramping up speed over time. He can steer his charge slightly with the mouse cursor location. When he collides with an enemy he deals damage and knocks them up based on the distance he has charged."
        }
      ]
    }
  },
  "sivir": {
    "fullName": "Sivir, the Battle Mistress",
    "title": "the Battle Mistress",
    "id": "sivir",
    "name": "Sivir",
    "abilities": {
      "P": [
        {
          "name": "Fleet of Foot",
          "description": "Sivir gains a short burst of movement speed when she attacks an enemy champion."
        }
      ],
      "Q": [
        {
          "name": "Boomerang Blade",
          "description": "Sivir hurls her crossblade like a boomerang, dealing damage each way."
        }
      ],
      "W": [
        {
          "name": "Ricochet",
          "description": "Sivir's next few basic attacks gain additional attack speed and bounce to nearby targets, dealing reduced damage while bouncing."
        }
      ],
      "E": [
        {
          "name": "Spell Shield",
          "description": "Creates a magical barrier that blocks a single enemy ability cast on Sivir. She receives health back and triggers her passive if a spell is blocked."
        }
      ],
      "R": [
        {
          "name": "On The Hunt",
          "description": "Sivir leads her allies in battle, granting them a surge of movement speed for a period of time."
        }
      ]
    }
  },
  "skarner": {
    "fullName": "Skarner, the Crystal Vanguard",
    "title": "the Crystal Vanguard",
    "id": "skarner",
    "name": "Skarner",
    "abilities": {
      "P": [
        {
          "name": "Crystal Spires",
          "description": "Skarner's presence causes crystals to spawn in set locations around the map. Crystals can be captured by either team by standing on top of them. Capturing a crystal prevents them from being captured by the opposing team for 15 seconds. While within range of a Crystal Spire, Skarner gains 100 Movement Speed and 42% (+6% per champion level) Attack Speed, while restoring 3% of his maximum Mana every second."
        }
      ],
      "Q": [
        {
          "name": "Crystal Slash",
          "description": "Skarner lashes out with his claws, dealing physical damage to all nearby enemies and charging himself with Crystal Energy for several seconds if a unit is struck. If he casts Crystal Slash again while powered by Crystal Energy, he deals bonus magic damage."
        }
      ],
      "W": [
        {
          "name": "Crystalline Exoskeleton",
          "description": "Skarner gains a shield and has increased movement speed while the shield persists."
        }
      ],
      "E": [
        {
          "name": "Fracture",
          "description": "Skarner summons a blast of crystalline energy which deals damage to enemies struck and slows them. Basic attacking these enemies within a short window will stun them."
        }
      ],
      "R": [
        {
          "name": "Impale",
          "description": "Skarner suppresses an enemy champion and deals damage to it. During this time, Skarner can move freely and will drag his helpless victim around with him. When the effect ends, the target will be dealt additional damage."
        }
      ]
    }
  },
  "sona": {
    "fullName": "Sona, Maven of the Strings",
    "title": "Maven of the Strings",
    "id": "sona",
    "name": "Sona",
    "abilities": {
      "P": [
        {
          "name": "Power Chord",
          "description": "Accelerando: Sona gains ability haste permanently for her basic abilities as she uses her abilities well which doesn't include her ultimate, up to a cap. Beyond that cap, further successful uses reduce her ultimate's remaining cooldown instead. Power Chord: Every few spell casts, Sona's next attack will deal bonus magic damage in addition to an additional effect depending on what kind of basic ability that Sona last activated."
        }
      ],
      "Q": [
        {
          "name": "Hymn of Valor",
          "description": "Active: Sona deals magic damage to the nearest two enemies, prioritizing champions. She then begins a new Melody. Gain a stack of Accelerando for every champion you damage with this. Melody: Sona gains an aura for a few seconds, granting allied champions additional magic damage on their next attack within a few seconds. Power Chord - Staccato: Power Chord deals bonus damage."
        }
      ],
      "W": [
        {
          "name": "Aria of Perseverance",
          "description": "Active: Sona restores health to herself and a nearby allied champion, prioritizing the most wounded. She then begins a new Melody. Melody: Sona gains an aura for a few seconds, granting allied champions a shield for the next few seconds. Gain a stack of Accelerando whenever you heal another injured ally and every time you protect another ally from at least damage with this shield. Power Chord - Diminuendo: Power Chord also reduces physical and magic damage dealt by the target by a percentage for a few seconds."
        }
      ],
      "E": [
        {
          "name": "Song of Celerity",
          "description": "Active: Sona begins a new Melody and grants herself movement speed for a few seconds, extended if she doesn't take damage. Melody: Sona gains an aura for seconds that grants allied champions movement speed for a few seconds. Power Chord - Tempo: Power Chord also slows the target for a couple seconds."
        }
      ],
      "R": [
        {
          "name": "Crescendo",
          "description": "Active: Sona strikes an irresistible chord, stunning any enemy it passes through for the next few seconds and dealing magic damage."
        }
      ]
    }
  },
  "soraka": {
    "fullName": "Soraka, the Starchild",
    "title": "the Starchild",
    "id": "soraka",
    "name": "Soraka",
    "abilities": {
      "P": [
        {
          "name": "Salvation",
          "description": "Soraka runs faster towards nearby low health allies."
        }
      ],
      "Q": [
        {
          "name": "Starcall",
          "description": "Soraka calls down a star at a target location. Enemies standing at the point of impact take magic damage and are slowed by 30% for 2 seconds. If Soraka hits at least one enemy champion, she is also granted Rejuvenation for 5 seconds, which restores health and grants her a decaying movement speed buff over its duration. While Soraka is Rejuvenated she can Rejuvenate other allies with Astral Infusion, granting them the same effects for the same duration."
        }
      ],
      "W": [
        {
          "name": "Astral Infusion",
          "description": "Soraka blesses a friendly unit, restoring its health. Astral Infusion cannot be self-cast, nor can it be cast if Soraka is below 5% of her maximum health."
        }
      ],
      "E": [
        {
          "name": "Equinox",
          "description": "Creates a zone at a location that silences all enemies inside. When the zone expires, all enemies still inside are rooted."
        }
      ],
      "R": [
        {
          "name": "Wish",
          "description": "Soraka fills her allies with hope, instantly restoring health to herself and all friendly champions."
        }
      ]
    }
  },
  "swain": {
    "fullName": "Swain, the Noxian Grand General",
    "title": "the Noxian Grand General",
    "id": "swain",
    "name": "Swain",
    "abilities": {
      "P": [
        {
          "name": "Ravenous Flock",
          "description": "Swain's ravens collect Soul Fragments that heal him and permanently increase his maximum health. Swain can right-click an immobilized enemy champions to pull them closer to him, dealing damage and ripping out a Soul Fragment."
        }
      ],
      "Q": [
        {
          "name": "Death's Hand",
          "description": "Swain unleashes several bolts of eldritch power that pierce through enemies. Enemies hit take more damage for each bolt they are struck by."
        }
      ],
      "W": [
        {
          "name": "Vision of Empire",
          "description": "Swain opens a demon eye that deals damage and slows enemies. Champions hit are revealed and also grant Swain a Soul Fragment."
        }
      ],
      "E": [
        {
          "name": "Nevermove",
          "description": "Swain launches a wave of demonic power forward. It then returns to Swain and roots enemies it hits."
        }
      ],
      "R": [
        {
          "name": "Demonflare",
          "description": "Swain unleashes a nova of soulfire, dealing magic damage to all nearby enemies based on the amount of health drained during Demonic Ascension."
        },
        {
          "name": "Demonic Ascension",
          "description": "Swain transforms into a demon and drains health from nearby enemy champions, minions, and neutral monsters. Swain can cast Demonflare to decimate nearby enemies with a nova of soulfire, dealing damage equal to a portion of the health he drained and ending his transformation."
        }
      ]
    }
  },
  "sylas": {
    "fullName": "Sylas, the Unshackled",
    "title": "the Unshackled",
    "id": "sylas",
    "name": "Sylas",
    "abilities": {
      "P": [
        {
          "name": "Petricite Burst",
          "description": "Casting an ability grants a stack of Petricite Burst for 4 seconds, up to 3 stacks. Whilst Sylas has a stack of Petricite Burst, he gains bonus attack speed. Sylas' next basic attack is modified to whirl his chains around him, dealing magic damage to his primary target, and magic damage to nearby secondary targets. Damage to secondary targets executes minions below a certain amount of health. The empowered attack applies on-hit effects to the primary target but disables Sylas' critical strikes' bonus damage. Spell effects only apply to secondary targets."
        }
      ],
      "Q": [
        {
          "name": "Chain Lash",
          "description": "Sylas lashes his chains out, intersecting at his targeted location dealing damage to and slowing enemies. After a delay, magical energy explodes from the intersection point dealing damage."
        }
      ],
      "W": [
        {
          "name": "Kingslayer",
          "description": "Sylas lunges at an enemy with magical force dealing damage and healing himself against enemy champions."
        }
      ],
      "E": [
        {
          "name": "Abduct",
          "description": "Sylas dashes to a location. Sylas can recast the ability to throw his chains out, pulling himself to an enemy he hits."
        },
        {
          "name": "Abscond",
          "description": "Sylas dashes to a location. Sylas can recast the ability to throw his chains out, pulling himself to an enemy he hits."
        },
        {
          "name": "Abscond / Abduct",
          "description": "Sylas dashes to a location. Sylas can recast the ability to throw his chains out, pulling himself to an enemy he hits."
        }
      ],
      "R": [
        {
          "name": "Hijack",
          "description": "Sylas steals the enemy's ultimate ability and can cast it freely."
        }
      ]
    }
  },
  "syndra": {
    "fullName": "Syndra, the Dark Sovereign",
    "title": "the Dark Sovereign",
    "id": "syndra",
    "name": "Syndra",
    "abilities": {
      "P": [
        {
          "name": "Transcendent",
          "description": "Syndra collects Splinters of Wrath from gaining levels and damaging enemies which upgrade her abilities. - Dark Sphere: Syndra can hold an additional charge. - Force of Will: Bonus true damage. - Scatter the Weak: Increased width and slows all targets. - Unleashed Power: Executes low health targets."
        }
      ],
      "Q": [
        {
          "name": "Dark Sphere",
          "description": "Syndra conjures a Dark Sphere dealing magic damage. The sphere remains and can be manipulated by her other powers."
        }
      ],
      "W": [
        {
          "name": "Force of Will",
          "description": "Syndra picks up and throws a Dark Sphere or enemy minion dealing magic damage and slowing the movement speed of enemies."
        }
      ],
      "E": [
        {
          "name": "Scatter the Weak",
          "description": "Syndra knocks enemies and Dark Spheres back dealing magic damage. Enemies hit by Dark Spheres become stunned."
        }
      ],
      "R": [
        {
          "name": "Unleashed Power",
          "description": "Syndra bombards an enemy champion with all of her Dark Spheres."
        }
      ]
    }
  },
  "tahm_kench": {
    "fullName": "Tahm Kench, The River King",
    "title": "The River King",
    "id": "tahm_kench",
    "name": "Tahm Kench",
    "abilities": {
      "P": [
        {
          "name": "An Acquired Taste",
          "description": "Tahm Kench puts the heft of his immense body behind his attacks, gaining extra damage depending on his total health. Damaging enemy champions builds stacks of An Acquired Taste. At three stacks, he can use Devour on an enemy champion."
        }
      ],
      "Q": [
        {
          "name": "Tongue Lash",
          "description": "Tahm Kench lashes out with his tongue, damaging and slowing the first unit hit and healing himself it he strikes an enemy champion. Applies a stack of An Acquired Taste to enemy champions. If the champion already has 3 stacks of An Acquired Taste, they are stunned and the stacks are consumed."
        }
      ],
      "W": [
        {
          "name": "Abyssal Dive",
          "description": "Dive down and then re-appear at target location, damaging and knocking up all enemies in an area."
        }
      ],
      "E": [
        {
          "name": "Thick Skin",
          "description": "Passive: Tahm Kench stores a percent of the damage he takes and heals based on it while out of combat. Active: Convert all stored damage into a temporary shield."
        }
      ],
      "R": [
        {
          "name": "Devour",
          "description": "Tahm Kench devours a champion for a few seconds, dealing magic damage if they are an enemy, or shielding them if they are an ally."
        }
      ]
    }
  },
  "taliyah": {
    "fullName": "Taliyah, the Stoneweaver",
    "title": "the Stoneweaver",
    "id": "taliyah",
    "name": "Taliyah",
    "abilities": {
      "P": [
        {
          "name": "Rock Surfing",
          "description": "Taliyah gains movement speed near walls."
        }
      ],
      "Q": [
        {
          "name": "Threaded Volley",
          "description": "Taliyah throws a volley of rocks in a target direction, moving freely as she does. This works the ground below her. If Taliyah casts Threaded Volley on worked ground, she consumes it to throw a stronger boulder that slows enemies."
        }
      ],
      "W": [
        {
          "name": "Seismic Shove",
          "description": "Taliyah causes an area of ground to erupt and throws enemies within in a direction of her choosing."
        }
      ],
      "E": [
        {
          "name": "Unraveled Earth",
          "description": "Taliyah creates a slowing minefield that explodes if enemies dash or are pushed/pulled through it, stunning them."
        }
      ],
      "R": [
        {
          "name": "Weaver's Wall",
          "description": "Taliyah creates a very long wall and then surfs it."
        }
      ]
    }
  },
  "talon": {
    "fullName": "Talon, the Blade's Shadow",
    "title": "the Blade's Shadow",
    "id": "talon",
    "name": "Talon",
    "abilities": {
      "P": [
        {
          "name": "Blade's End",
          "description": "Talon's abilities wound champions for a short duration, stacking up to three times. When Talon basic attacks a fully wounded target, they bleed for a large amount of physical damage over time. Talon's abilities will also wound all monsters for 120% damage."
        }
      ],
      "Q": [
        {
          "name": "Noxian Diplomacy",
          "description": "Talon leaps to a target, dealing physical damage on arrival. If cast within melee range, Talon does not leap but instead critically strikes his target. Whenever Noxian Diplomacy kills a unit, Talon heals and 50% of its cooldown is refunded."
        }
      ],
      "W": [
        {
          "name": "Rake",
          "description": "Talon sends out a volley of daggers in a cone that then quickly return back to him. This attack deals physical damage every time it passes through an enemy. Additionally, the enemy is slowed for 1 second."
        }
      ],
      "E": [
        {
          "name": "Assassin's Path",
          "description": "Talon vaults over the nearest structure or terrain in a target direction. The vault's speed is affected by Talon's movement speed. Talon cannot vault over the same section of terrain for a period of time."
        }
      ],
      "R": [
        {
          "name": "Shadow Assault",
          "description": "Talon disperses a ring of blades outwards and gains stealth for up to 2.5 seconds while gaining 40% movement speed. When Talon emerges from stealth, the blades converge on his location. Each time a blade passes through an enemy, they receive physical damage. Each enemy can only be damaged once at the start of the ability and once at the end."
        }
      ]
    }
  },
  "taric": {
    "fullName": "Taric, the Shield of Valoran",
    "title": "the Shield of Valoran",
    "id": "taric",
    "name": "Taric",
    "abilities": {
      "P": [
        {
          "name": "Bravado",
          "description": "Taric infuses his next two basic attacks whenever he casts an ability. He swings faster with these two attacks, which deal bonus magic damage and reduce his base spells' cooldowns."
        }
      ],
      "Q": [
        {
          "name": "Starlight's Touch",
          "description": "Passive: Taric stores a charge of Starlight's Touch every 15 seconds, up to a maximum of 3 charges stored at once. Starlight's Touch cannot be cast without charges. Bravado-empowered attacks reduce this recharge time by 5 - 3 additional seconds (scales down with CDR). Active: Taric heals himself and all nearby allies based on the number of Starlight's Touch charges he's stored."
        }
      ],
      "W": [
        {
          "name": "Bastion",
          "description": "Passive: Bastion increases the armor of Taric and the champion he is linked with by a percentage of Taric's armor. Active: Taric links with an ally, shielding them for a percentage of their maximum Health for 2.5 seconds. Bastion remains on Taric's ally until he recasts it onto another ally, or the two move far enough apart to break their link. While linked, all of Taric's abilities are simultaneously cast from both Taric and his linked ally, though the effects do not stack."
        }
      ],
      "E": [
        {
          "name": "Dazzle",
          "description": "After a brief delay, Taric fires out a short wave of celestial energy in a target direction that damages and stuns all enemies struck."
        }
      ],
      "R": [
        {
          "name": "Cosmic Radiance",
          "description": "Taric calls on the stars themselves for protection. After a 2.5 second delay, he and all nearby allies are granted invulnerability for 2.5 seconds."
        }
      ]
    }
  },
  "teemo": {
    "fullName": "Teemo, the Swift Scout",
    "title": "the Swift Scout",
    "id": "teemo",
    "name": "Teemo",
    "abilities": {
      "P": [
        {
          "name": "Guerrilla Warfare",
          "description": "If Teemo stands still and takes no actions for 1.5 seconds, he becomes stealthed indefinitely. After leaving stealth, Teemo gains the Element of Surprise, increasing his attack speed for a short duration. In addition, moving inside brush for 1.5 seconds also allows Teemo to become stealthed."
        }
      ],
      "Q": [
        {
          "name": "Blinding Dart",
          "description": "Teemo shoots a dart at the target enemy, dealing them magic damage and blinding them for a short duration. The blind duration is doubled against minions and monsters."
        }
      ],
      "W": [
        {
          "name": "Move Quick",
          "description": "Passive: Grants increased movement speed until struck by a champion or turret. The passive is restored 5 seconds (static cooldown) after last being struck by a champion or turret. Active: For 3 seconds,Teemo gains double his passive movement speed and will not lose it even if he is hit."
        }
      ],
      "E": [
        {
          "name": "Toxic Shot",
          "description": "Passive: Each time Teemo attacks to an enemy, he will poison the target, dealing damage on hit and each second for 4 seconds. The duration of this poison will be refreshed with every subsequent attack, but the damage does not stack. The total damage is doubled against monsters."
        }
      ],
      "R": [
        {
          "name": "Noxious Trap",
          "description": "Teemo places a trap which stealths and arms in 1 second. It detonates if an enemy steps on it, dealing magic damage by poisoning nearby enemies, applying a slow and revealing them for 4 seconds. The traps last 5 minutes. Teemo will store one every several seconds up to a maximum depending on rank. Each cast requires and uses a trap. After death, Teemo respawns with 2 mushrooms. Casting traps on existing Noxious Traps causes them to bounce further in the direction they were originally tossed."
        }
      ]
    }
  },
  "thresh": {
    "fullName": "Thresh, the Chain Warden",
    "title": "the Chain Warden",
    "id": "thresh",
    "name": "Thresh",
    "abilities": {
      "P": [
        {
          "name": "Damnation",
          "description": "Thresh does not gain armor per level. Instead, Thresh collects the souls of dead enemies by approaching them or by placing Dark Passage's lantern nearby. Souls permanently grant armor and ability power. Champions and large minions always drop a harvest-able soul. Small minions only sometimes drop a soul. Epic monsters drop two souls. A soul will only drop if the enemy unit dies within 1900 range of Thresh. Souls are visible to allies, and only become visible to enemies if the enemy team has vision of Thresh."
        }
      ],
      "Q": [
        {
          "name": "Death Sentence",
          "description": "Thresh throws his scythe, dealing magic damage to the first unit hit and dragging them towards him for 1.5 seconds. Additionally, he may reactivate the ability to leap to his chained enemy."
        }
      ],
      "W": [
        {
          "name": "Dark Passage",
          "description": "Thresh throws out a lantern that shields the first ally from damage for 6 seconds. Allies can click the lantern to dash to Thresh."
        }
      ],
      "E": [
        {
          "name": "Flay",
          "description": "Active: Thresh sweeps his chain in a line, dealing magic damage and pushing all enemies in the direction of the swing. Enemies effected by Flay are then slowed for a short duration. Passive: Thresh deals AD based magic damage on each auto attack. The damage builds while he is not attacking, and is also based on amount of souls he has collected."
        }
      ],
      "R": [
        {
          "name": "The Box",
          "description": "Creates a prison of walls around Thresh, dealing magic damage and drastically slowing enemy who collide with the first wall. Opponents colliding other walls will only be slowed for half the duration."
        }
      ]
    }
  },
  "tristana": {
    "fullName": "Tristana, the Yordle Gunner",
    "title": "the Yordle Gunner",
    "id": "tristana",
    "name": "Tristana",
    "abilities": {
      "P": [
        {
          "name": "Draw a Bead",
          "description": "Increases Tristana's attack range as she levels."
        }
      ],
      "Q": [
        {
          "name": "Rapid Fire",
          "description": "Tristana fires her weapon rapidly, increasing her attack speed for 7 seconds."
        }
      ],
      "W": [
        {
          "name": "Rocket Jump",
          "description": "Tristana fires at the ground to propel herself to a distant location, dealing damage and slowing surrounding units where she lands. Rocket Jump's cooldown resets on kill or assist or whenever Explosive Charge detonates at maximum stacks on champions."
        }
      ],
      "E": [
        {
          "name": "Explosive Charge",
          "description": "When Tristana kills a unit, her cannonballs burst into shrapnel, dealing damage to surrounding enemies. Can be activated to place a bomb on a target enemy that explodes after a short duration dealing damage to surrounding units."
        }
      ],
      "R": [
        {
          "name": "Buster Shot",
          "description": "Tristana loads a massive cannonball into her weapon and fires it at an enemy unit. This deals magic damage and knocks the target back."
        }
      ]
    }
  },
  "trundle": {
    "fullName": "Trundle, the Troll King",
    "title": "the Troll King",
    "id": "trundle",
    "name": "Trundle",
    "abilities": {
      "P": [
        {
          "name": "King's Tribute",
          "description": "Whenever an enemy unit near Trundle dies, he heals for a percentage of its maximum health."
        }
      ],
      "Q": [
        {
          "name": "Chomp",
          "description": "Trundle bites his opponent, dealing damage, briefly slowing and sapping some of their attack damage."
        }
      ],
      "W": [
        {
          "name": "Frozen Domain",
          "description": "Trundle turns target location into his domain, gaining attack speed, movement speed, and increased healing from all sources while on it."
        }
      ],
      "E": [
        {
          "name": "Pillar of Ice",
          "description": "Trundle creates an ice pillar at target location, becoming impassable terrain and slowing all nearby enemy units."
        }
      ],
      "R": [
        {
          "name": "Subjugate",
          "description": "Trundle immediately steals a percentage of his target's health, armor and magic resistance. Over the next 4 seconds the amount of health, armor, and magic resistance stolen is doubled."
        }
      ]
    }
  },
  "tryndamere": {
    "fullName": "Tryndamere, the Barbarian King",
    "title": "the Barbarian King",
    "id": "tryndamere",
    "name": "Tryndamere",
    "abilities": {
      "P": [
        {
          "name": "Battle Fury",
          "description": "Tryndamere's Critical Strike chance increases as he becomes more wounded."
        }
      ],
      "Q": [
        {
          "name": "Bloodlust",
          "description": "Tryndamere thrives on the thrills of combat. Whenever Tryndamere kills a unit or critically strikes, he temporarily gains increased attack damage and critical damage."
        }
      ],
      "W": [
        {
          "name": "Mocking Shout",
          "description": "Tryndamere lets out an insulting cry, decreasing surrounding champions' physical damage. Enemies with their backs turned to Tryndamere also have their movement speed slowed."
        }
      ],
      "E": [
        {
          "name": "Spinning Slash",
          "description": "Tryndamere slices toward a target unit, dealing damage to enemies in his path."
        }
      ],
      "R": [
        {
          "name": "Undying Rage",
          "description": "Tryndamere's lust for battle becomes so strong that he is unable to die, no matter how wounded he becomes."
        }
      ]
    }
  },
  "twisted_fate": {
    "fullName": "Twisted Fate, the Card Master",
    "title": "the Card Master",
    "id": "twisted_fate",
    "name": "Twisted Fate",
    "abilities": {
      "P": [
        {
          "name": "Loaded Dice",
          "description": "Upon killing a unit, Twisted Fate rolls his dice, gaining bonus gold. Naturally, Twisted Fate has a higher chance to receive a larger bonus."
        }
      ],
      "Q": [
        {
          "name": "Wild Cards",
          "description": "Twisted Fate throws three cards, dealing damage to each enemy unit they pass through."
        }
      ],
      "W": [
        {
          "name": "Pick A Card",
          "description": "Twisted Fate chooses a magic card from his deck, and uses that for his next attack, causing bonus effects."
        }
      ],
      "E": [
        {
          "name": "Stacked Deck",
          "description": "Every 4 attacks, Twisted Fate deals bonus damage. In addition, his attack speed is increased."
        }
      ],
      "R": [
        {
          "name": "Destiny",
          "description": "Twisted Fate predicts the fortunes of his foes, revealing all enemy champions and enabling the use of Gate, which teleports Twisted Fate to any target location in 1.5 seconds."
        }
      ]
    }
  },
  "twitch": {
    "fullName": "Twitch, the Plague Rat",
    "title": "the Plague Rat",
    "id": "twitch",
    "name": "Twitch",
    "abilities": {
      "P": [
        {
          "name": "Deadly Venom",
          "description": "Twitch's basic attacks infect the target, dealing true damage each second."
        }
      ],
      "Q": [
        {
          "name": "Ambush",
          "description": "Twitch becomes Camouflaged for a short duration and gains movement speed. When leaving Camouflage, Twitch gains attack speed for a short duration. When an enemy champion with Deadly Venom dies, Ambush's cooldown is reset."
        }
      ],
      "W": [
        {
          "name": "Venom Cask",
          "description": "Twitch hurls a cask of venom that explodes in an area, slowing targets and applying deadly venom to the target."
        }
      ],
      "E": [
        {
          "name": "Contaminate",
          "description": "Twitch wreaks further havoc on poisoned enemies with a blast of his vile diseases."
        }
      ],
      "R": [
        {
          "name": "Spray and Pray",
          "description": "Twitch unleashes the full power of his crossbow, shooting bolts over a great distance that pierce all enemies caught in their path."
        }
      ]
    }
  },
  "udyr": {
    "fullName": "Udyr, the Spirit Walker",
    "title": "the Spirit Walker",
    "id": "udyr",
    "name": "Udyr",
    "abilities": {
      "P": [
        {
          "name": "Bridge Between",
          "description": "Udyr has four basic abilities that swap between Stances and can Recast an ability to renew it with additional benefits. Additionally, after using an ability, Udyr's next two attacks gain attack speed."
        }
      ],
      "Q": [
        {
          "name": "Wilding Claw",
          "description": "Udyr gains attacks and his next two attack deal bonus physical damage. Recast: Gain even more attack speed, and next two attacks call lightning to strike the target."
        }
      ],
      "W": [
        {
          "name": "Iron Mantle",
          "description": "Udyr gains a shield and his next two attacks heal him. Recast: Gain an even bigger shield and heal depending on max health over the next couple seconds."
        }
      ],
      "E": [
        {
          "name": "Blazing Stampede",
          "description": "Udyr gains movement speed and his first attack against each target will stun them. Recast: Gain even more movement speed and immunity to immobilizing effects for a couple seconds."
        }
      ],
      "R": [
        {
          "name": "Wingborne Storm",
          "description": "Udyr surrounds himself in a glacial storm, damaging and slowing nearby enemies. Recast: Empower and unleash the storm, causing it to track enemies and deal additional damage."
        }
      ]
    }
  },
  "urgot": {
    "fullName": "Urgot, the Dreadnought",
    "title": "the Dreadnought",
    "id": "urgot",
    "name": "Urgot",
    "abilities": {
      "P": [
        {
          "name": "Echoing Flames",
          "description": "Urgot's basic attacks and Purge periodically trigger blasts of flame from his legs, dealing physical damage."
        }
      ],
      "Q": [
        {
          "name": "Corrosive Charge",
          "description": "Fires an explosive charge at the target location, dealing physical damage and slowing enemies caught in the explosion."
        }
      ],
      "W": [
        {
          "name": "Purge",
          "description": "Urgot slows himself while he unloads his weapon on nearby enemies. Prioritizes enemy champions Urgot has recently struck with other abilities and triggers Echoing Flames."
        }
      ],
      "E": [
        {
          "name": "Disdain",
          "description": "Urgot charges in a direction, shielding himself and trampling non-champion enemies. If he catches an enemy champion, he will stop and hurl them out of his way."
        }
      ],
      "R": [
        {
          "name": "Fear Beyond Death",
          "description": "Urgot fires a chem-drill that impales the first enemy champion hit. If that champion falls below a health threshold, Urgot judges them weak and can execute them."
        }
      ]
    }
  },
  "varus": {
    "fullName": "Varus, the Arrow of Retribution",
    "title": "the Arrow of Retribution",
    "id": "varus",
    "name": "Varus",
    "abilities": {
      "P": [
        {
          "name": "Living Vengeance",
          "description": "On kill or assist, Varus temporarily gains attack speed. This bonus is larger if the enemy is a champion."
        }
      ],
      "Q": [
        {
          "name": "Piercing Arrow",
          "description": "Varus readies and then fires a powerful shot that gains extra range and damage the longer he spends preparing to fire."
        }
      ],
      "W": [
        {
          "name": "Blighted Quiver",
          "description": "Passive: Varus' basic attacks deal bonus magic damage and apply Blight. Varus' other abilities detonate Blight, dealing magic damage depending on the target's maximum health. Active: Varus empowers his next Piercing Arrow."
        }
      ],
      "E": [
        {
          "name": "Hail of Arrows",
          "description": "Varus fires a hail of arrows that deal physical damage and desecrate the ground. Desecrated ground slows enemies' Movement Speed and reduces their healing and regeneration."
        }
      ],
      "R": [
        {
          "name": "Chain of Corruption",
          "description": "Varus flings out a damaging tendril of corruption that immobilizes the first enemy champion hit and then spreads towards nearby uninfected champions, immobilizing them too on contact."
        }
      ]
    }
  },
  "vayne": {
    "fullName": "Vayne, the Night Hunter",
    "title": "the Night Hunter",
    "id": "vayne",
    "name": "Vayne",
    "abilities": {
      "P": [
        {
          "name": "Night Hunter",
          "description": "Vayne ruthlessly hunts evil-doers. She gains 30 Movement Speed when moving towards an enemy champion."
        }
      ],
      "Q": [
        {
          "name": "Tumble",
          "description": "Vayne tumbles, maneuvering to carefully place her next shot. She rolls toward the cursor and her next attack deals bonus damage."
        }
      ],
      "W": [
        {
          "name": "Silver Bolts",
          "description": "Vayne tips her bolts with a rare metal, toxic to evil things. The third consecutive attack or ability against the same target will deal additional damage plus a percentage of the target's maximum health as bonus true damage."
        }
      ],
      "E": [
        {
          "name": "Condemn",
          "description": "Vayne draws a heavy crossbow from her back, and fires a huge bolt at her target, dealing physical damage and knocking them back. If they collide with terrain, they are impaled, dealing bonus damage and stunning them for 1.5 seconds."
        }
      ],
      "R": [
        {
          "name": "Final Hour",
          "description": "Readying herself for an epic confrontation, Vayne gains increased Attack Damage, Invisibility during Tumble, reduced Tumble cooldown, and more bonus Move Speed from Night Hunter"
        }
      ]
    }
  },
  "veigar": {
    "fullName": "Veigar, the Tiny Master of Evil",
    "title": "the Tiny Master of Evil",
    "id": "veigar",
    "name": "Veigar",
    "abilities": {
      "P": [
        {
          "name": "Phenomenal Evil Power",
          "description": "Striking an enemy champion with an ability grants Veigar a stack of Phenomenal Evil. Takedowns grant an additional 3 stacks. Phenomenal Evil gives Veigar 1 ability power per stack."
        }
      ],
      "Q": [
        {
          "name": "Baleful Strike",
          "description": "Veigar unleashes a bolt of dark energy, dealing magic damage to the first two enemies hit. For each target killed, Veigar gains 1 stack of Phenomenal Evil. This bonus is doubled if the target killed is a large minion or large monster."
        }
      ],
      "W": [
        {
          "name": "Dark Matter",
          "description": "Veigar calls a great mass of dark matter to fall from the sky to the target location, dealing magic damage when it lands."
        }
      ],
      "E": [
        {
          "name": "Event Horizon",
          "description": "After a 0.5 second delay, Veigar twists the edges of space around the target location for 3 seconds, stunning enemies who pass through the perimeter for a short duration."
        }
      ],
      "R": [
        {
          "name": "Primordial Burst",
          "description": "Blasts the target enemy champion with primal magic to deal magic damage, increasing based on the target's missing Health. Damage is maximized against enemies below 33% Health."
        }
      ]
    }
  },
  "velkoz": {
    "fullName": "Vel'Koz, the Eye of the Void",
    "title": "the Eye of the Void",
    "id": "velkoz",
    "name": "Vel'Koz",
    "abilities": {
      "P": [
        {
          "name": "Organic Deconstruction",
          "description": "Vel'Koz's abilities Deconstruct those they strike. After being hit three times by his abilities, minions, monsters and enemy champions are Deconstructed and suffer bonus true damage. Enemies lose their Deconstruction stacks by avoiding Vel'Koz's attacks for a short while."
        }
      ],
      "Q": [
        {
          "name": "Plasma Fission",
          "description": "Vel'Koz fires a plasma bolt that slows and damages the first enemy struck. Once Plasma Fission hits, reaches its maximum range or is reactivated a second time, the bolt splits at a 90 degree angle. The split bolts deal the same damage and apply the same slow. Plasma Fission refunds 50% of its mana cost for each unit killed (up to a maximum of 150%)."
        }
      ],
      "W": [
        {
          "name": "Void Rift",
          "description": "Vel'Koz sends out a straight line blast that tears open a temporary rift to the Void before exploding. Both the initial tear and the delayed explosion damage and apply Deconstruction stacks to caught enemies."
        }
      ],
      "E": [
        {
          "name": "Tectonic Disruption",
          "description": "After a brief delay, Vel'Koz disrupts a nearby area, damaging and launching all enemies caught into the air. Enemies hit that are close to Vel'Koz are also knocked back slightly."
        }
      ],
      "R": [
        {
          "name": "Life Form Disintegration Ray",
          "description": "Passive: Deconstructing enemy Champions Researches them for 7 seconds. Basic attacks and all abilities refresh Research. Active: Vel'Koz channels a ray of infinite energy that follows the cursor for 2.5 seconds, dealing magic damage every 0.25 seconds to all enemies in range and slowing them by 20% for 1 second. Enemies that stay in the beam accumulate 1 stack of Organic Deconstruction every 0.7 seconds (up to 3 stacks). Researched champions take true damage instead. Vel'Koz can cancel the ability early by recasting it."
        }
      ]
    }
  },
  "vex": {
    "fullName": "Vex, the Gloomist",
    "title": "the Gloomist",
    "id": "vex",
    "name": "Vex",
    "abilities": {
      "P": [
        {
          "name": "Doom 'n Gloom",
          "description": "Vex periodically becomes empowered, causing her next basic ability to fear enemies and interrupt dashes. Whenever a nearby enemy dashes, Vex applies a mark that can be consumed for bonus damage that also reduces the cooldown of her empowered state."
        }
      ],
      "Q": [
        {
          "name": "Mistral Bolt",
          "description": "Launch a damaging missile that accelerates mid-flight."
        }
      ],
      "W": [
        {
          "name": "Personal Space",
          "description": "Gain a shield and damage nearby enemies."
        }
      ],
      "E": [
        {
          "name": "Looming Darkness",
          "description": "Summon a damaging and slowing zone that applies Gloom to enemies."
        }
      ],
      "R": [
        {
          "name": "Shadow Surge",
          "description": "Fire a missile that marks an enemy champion. Recast to dash to them and deal damage."
        }
      ]
    }
  },
  "vi": {
    "fullName": "Vi, the Piltover Enforcer",
    "title": "the Piltover Enforcer",
    "id": "vi",
    "name": "Vi",
    "abilities": {
      "P": [
        {
          "name": "Blast Shield",
          "description": "Vi charges a shield over time. The shield can be activated by hitting an enemy with an ability."
        }
      ],
      "Q": [
        {
          "name": "Vault Breaker",
          "description": "Vi charges her gauntlets and unleashes a vault shattering punch, carrying her forward. Enemies she hits are knocked back and receive a stack of Denting Blows."
        }
      ],
      "W": [
        {
          "name": "Denting Blows",
          "description": "Every 3rd attack on the same target deals additional damage equal to a percentage of the target's maximum Health as physical damage, reduces its Armor and grants Vi Attack Speed for a short duration (damage vs. minions and monsters is capped)."
        }
      ],
      "E": [
        {
          "name": "Relentless Force",
          "description": "Causes next basic attack to deal physical damage to the target and enemies behind it. Vi charges a new punch every seconds and can hold 2 charges at once."
        }
      ],
      "R": [
        {
          "name": "Cease and Desist",
          "description": "Vi targets an enemy champion and chases it down, knocking it up for a short duration and dealing physical damage. While charging, Vi is immune to crowd control and will knock aside enemies in the way, dealing the same damage to them. Vi will also remain Unstoppable for the duration of her uppercut."
        }
      ]
    }
  },
  "viego": {
    "fullName": "Viego, The Ruined King",
    "title": "The Ruined King",
    "id": "viego",
    "name": "Viego",
    "abilities": {
      "P": [
        {
          "name": "Sovereign's Domination",
          "description": "Enemies who fall before Viego become wraiths. By attacking a wraith, Viego temporarily seizes control of the dead enemy's body, healing for a percentage of his target's max health and gaining access to their basic abilities and items. He replaces their ultimate with a free cast of his own."
        }
      ],
      "Q": [
        {
          "name": "Blade of the Ruined King",
          "description": "Viego's spectral blade passively deals bonus percent current Health damage On-Hit and strikes twice vs. enemies he recently hit with an Ability, stealing Health. Viego can activate this Ability to thrust his zweihander forward, impaling enemies in front of him."
        }
      ],
      "W": [
        {
          "name": "Spectral Maw",
          "description": "Viego charges up before dashing forward, releasing a ball of concentrated Black Mist that stuns the first enemy hit."
        }
      ],
      "E": [
        {
          "name": "Harrowed Path",
          "description": "Viego commands the Black Mist to haunt and surround a piece of terrain. Viego can hide in the mist as a wraith, gaining camouflage, movement speed, and attack speed."
        }
      ],
      "R": [
        {
          "name": "Heartbreaker",
          "description": "Viego teleports to a nearby location and executes an enemy champion on arrival, piercing their heart and causing a destructive shockwave around them that knocks away their allies."
        }
      ]
    }
  },
  "viktor": {
    "fullName": "Viktor, the Machine Herald",
    "title": "the Machine Herald",
    "id": "viktor",
    "name": "Viktor",
    "abilities": {
      "P": [
        {
          "name": "Glorious Evolution",
          "description": "Viktor can augment his basic abilities when he gets kills on enemies."
        }
      ],
      "Q": [
        {
          "name": "Siphon Power",
          "description": "Viktor blasts an enemy unit dealing magic damage, gaining a shield and empowering his next basic attack. Augment: Siphon Power's shield is increased by 60% and Viktor gains bonus movement speed after casting."
        }
      ],
      "W": [
        {
          "name": "Gravity Field",
          "description": "Viktor conjures a heavy gravitational field that slows enemies in its radius. Enemies who stay within the device for too long are stunned. Augment: Viktor's non-periodic spells apply a slow to enemies."
        }
      ],
      "E": [
        {
          "name": "Death Ray",
          "description": "Viktor uses his robotic arm to fire a chaos beam that cuts across the field in a line, dealing damage to all enemies in its path. Augment: An explosion follows the Death Ray's wake, dealing magic damage."
        }
      ],
      "R": [
        {
          "name": "Chaos Storm",
          "description": "Viktor conjures a singularity on the field which deals magic damage and interrupts enemy channels. The singularity then periodically does magic damage to all nearby enemies. Viktor can redirect the singularity. Augment: The Chaos Storm moves faster."
        }
      ]
    }
  },
  "vladimir": {
    "fullName": "Vladimir, the Crimson Reaper",
    "title": "the Crimson Reaper",
    "id": "vladimir",
    "name": "Vladimir",
    "abilities": {
      "P": [
        {
          "name": "Crimson Pact",
          "description": "Every 30 points of bonus health gives Vladimir ability power and every amount of ability power he gains, gives him increased bonus health."
        }
      ],
      "Q": [
        {
          "name": "Transfusion",
          "description": "Vladimir steals life from the target enemy. When Vladimir's resource is full, Transfusion will benefit from massively increased damage and healing for a brief time."
        }
      ],
      "W": [
        {
          "name": "Sanguine Pool",
          "description": "Vladimir sinks into a pool of blood, becoming untargetable for 2 seconds. Additionally, enemies on the pool are slowed and Vladimir siphons life from them."
        }
      ],
      "E": [
        {
          "name": "Tides of Blood",
          "description": "Vladimir pays his own health to charge up a reservoir of blood which, when released, deals damage in the area around him but can be blocked by enemy units."
        }
      ],
      "R": [
        {
          "name": "Hemoplague",
          "description": "Vladimir infects an area with a virulent plague. Affected enemies take increased damage for the duration. After a few seconds, Hemoplague deals magic damage to infected enemies and heals Vladimir for each enemy champion hit."
        }
      ]
    }
  },
  "volibear": {
    "fullName": "Volibear, the Relentless Storm",
    "title": "the Relentless Storm",
    "id": "volibear",
    "name": "Volibear",
    "abilities": {
      "P": [
        {
          "name": "The Relentless Storm",
          "description": "Volibear's attacks and abilities grant attack speed, and eventually cause his attacks to deal bonus magic damage to nearby enemies."
        }
      ],
      "Q": [
        {
          "name": "Thundering Smash",
          "description": "Volibear gains speed towards enemies, stunning and damaging the first one he attacks."
        }
      ],
      "W": [
        {
          "name": "Frenzied Maul",
          "description": "Volibear damages an enemy, applying on-hit effects and marking them. Casting this ability again on the same target deals bonus damage and Heals Volibear."
        }
      ],
      "E": [
        {
          "name": "Sky Splitter",
          "description": "Volibear summons a lightning bolt at a location, dealing damage and slowing enemies while granting Volibear a shield if he's inside the blast radius."
        }
      ],
      "R": [
        {
          "name": "Stormbringer",
          "description": "Volibear leaps to a target location, slowing and damaging enemies beneath him while gaining bonus health. Enemy towers near his landing location become temporarily disabled."
        }
      ]
    }
  },
  "warwick": {
    "fullName": "Warwick, the Uncaged Wrath of Zaun",
    "title": "the Uncaged Wrath of Zaun",
    "id": "warwick",
    "name": "Warwick",
    "abilities": {
      "P": [
        {
          "name": "Eternal Hunger",
          "description": "Warwick's basic attacks deal bonus magic damage. If Warwick is below half of his health, he heals the same amount. If Warwick is below a quarter of his health, this healing triples."
        }
      ],
      "Q": [
        {
          "name": "Jaws of the Beast",
          "description": "Warwick lunges forward and bites his target, dealing damage based on their maximum health and healing for damage dealt."
        }
      ],
      "W": [
        {
          "name": "Blood Hunt",
          "description": "Warwick senses enemies below a percentage of health, gaining movement speed towards them and attack speed against them. When they fall below a certain percentage of health, he frenzies and these bonuses triple."
        }
      ],
      "E": [
        {
          "name": "Primal Howl",
          "description": "Warwick gains damage reduction for 2.5 seconds. At the end, or if re-activated, he howls, causing nearby enemies to flee for 1 second."
        }
      ],
      "R": [
        {
          "name": "Infinite Duress",
          "description": "Warwick leaps in a direction (scaling with his bonus Move Speed), suppressing the first champion he collides with for 1.5 seconds."
        }
      ]
    }
  },
  "wukong": {
    "fullName": "Wukong, the Monkey King",
    "title": "the Monkey King",
    "id": "wukong",
    "name": "Wukong",
    "abilities": {
      "P": [
        {
          "name": "Stone Skin",
          "description": "Wukong gains stacking armor and max health regeneration while fighting champions and monsters."
        }
      ],
      "Q": [
        {
          "name": "Crushing Blow",
          "description": "Wukong's next attack gains attack range, deals bonus damage, and reduces the target's armor for a few seconds."
        }
      ],
      "W": [
        {
          "name": "Warrior Trickster",
          "description": "Wukong becomes invisible and dashes in a direction, leaving behind a clone that will attack nearby enemies."
        }
      ],
      "E": [
        {
          "name": "Nimbus Strike",
          "description": "Wukong dashes to a targeted enemy and sends out images to attack enemies near his target, dealing damage to each enemy struck."
        }
      ],
      "R": [
        {
          "name": "Cyclone",
          "description": "Wukong's extends his staff and spins it around repeatedly, gaining movement speed. Enemies struck take damage and are knocked up."
        }
      ]
    }
  },
  "xayah": {
    "fullName": "Xayah, the Rebel",
    "title": "the Rebel",
    "id": "xayah",
    "name": "Xayah",
    "abilities": {
      "P": [
        {
          "name": "Clean Cuts",
          "description": "After using an ability, Xayah's next basic attacks will hit all targets along their path and leave a Feather."
        }
      ],
      "Q": [
        {
          "name": "Double Daggers",
          "description": "Xayah throws two damaging daggers that also drop Feathers she can recall."
        }
      ],
      "W": [
        {
          "name": "Deadly Plumage",
          "description": "Xayah creates a storm of blades that increase her attack speed and damage while also granting her movement speed if she attacks a champion."
        }
      ],
      "E": [
        {
          "name": "Bladecaller",
          "description": "Xayah calls back all her dropped Feathers dealing damage and rooting enemies."
        }
      ],
      "R": [
        {
          "name": "Featherstorm",
          "description": "Xayah leaps into the air becoming untargetable and throwing out a fan of daggers, dropping Feathers she can recall."
        }
      ]
    }
  },
  "xerath": {
    "fullName": "Xerath, the Magus Ascendant",
    "title": "the Magus Ascendant",
    "id": "xerath",
    "name": "Xerath",
    "abilities": {
      "P": [
        {
          "name": "Mana Surge",
          "description": "Xerath's basic attacks periodically restore mana."
        }
      ],
      "Q": [
        {
          "name": "Arcanopulse",
          "description": "Fires a long-range beam of energy, dealing magic damage to all targets hit."
        }
      ],
      "W": [
        {
          "name": "Eye of Destruction",
          "description": "Calls down a barrage of arcane energy, slowing and dealing magic damage to all enemies in an area. Targets in the middle receive additional damage and a stronger slow."
        }
      ],
      "E": [
        {
          "name": "Shocking Orb",
          "description": "Deals magic damage to an enemy and stuns them."
        }
      ],
      "R": [
        {
          "name": "Rite of the Arcane",
          "description": "Xerath immobilizes himself and gains numerous long-range barrages."
        }
      ]
    }
  },
  "xin_zhao": {
    "fullName": "Xin Zhao, the Seneschal of Demacia",
    "title": "the Seneschal of Demacia",
    "id": "xin_zhao",
    "name": "Xin Zhao",
    "abilities": {
      "P": [
        {
          "name": "Determination",
          "description": "Every third attack deals bonus damage and heals Xin Zhao."
        }
      ],
      "Q": [
        {
          "name": "Three Talon Strike",
          "description": "Xin Zhao's next 3 standard attacks deal increased damage with the third attack knocking an opponent into the air."
        }
      ],
      "W": [
        {
          "name": "Wind Becomes Lightning",
          "description": "Xin Zhao slashes in front of himself with his spear, then thrusts it forward, slowing affected enemies and marking them as Challenged."
        }
      ],
      "E": [
        {
          "name": "Audacious Charge",
          "description": "Xin Zhao charges to an enemy, gaining increased attack speed and dealing damage to all enemies in the area, slowing them briefly. Audacious Charge gains increased range against Challenged targets."
        }
      ],
      "R": [
        {
          "name": "Crescent Guard",
          "description": "Xin Zhao challenges an enemy he damaged recently. Xin Zhao deals damage to nearby enemies based on their current Health and knocks non-challenged targets back, becoming impervious to damage dealt by champions outside of the circle created."
        }
      ]
    }
  },
  "yasuo": {
    "fullName": "Yasuo, the Unforgiven",
    "title": "the Unforgiven",
    "id": "yasuo",
    "name": "Yasuo",
    "abilities": {
      "P": [
        {
          "name": "Way of the Wanderer",
          "description": "Yasuo's critical strike chance is increased. Additionally, Yasuo builds toward a shield whenever he is moving. The shield triggers when he takes damage from a champion or monster."
        }
      ],
      "Q": [
        {
          "name": "Steel Tempest",
          "description": "Thrusts forward, damaging all enemies in a line. On hit, grants a stack of Gathering Storm for a few seconds. At 2 stacks, Steel Tempest fires a whirlwind that knocks airborne. Steel Tempest is treated as a basic attack and scales with all the same things."
        }
      ],
      "W": [
        {
          "name": "Wind Wall",
          "description": "Creates a moving wall that blocks all enemy projectiles for 4 seconds."
        }
      ],
      "E": [
        {
          "name": "Sweeping Blade",
          "description": "Dashes through target enemy, dealing magic damage. Each cast increases your next dash's base damage, up to a max amount. Cannot be re-cast on the same enemy for a few seconds. If Steel Tempest is cast while dashing, it will strike as a circle."
        }
      ],
      "R": [
        {
          "name": "Last Breath",
          "description": "Blinks to an airbone enemy champion, dealing physical damage and holding all airborne enemies in the area in the air. Grants maximum Flow but resets all stacks of Gathering Storm. For a moderate time afterwards, Yasuo's critical strikes gain significant bonus armor penetration."
        }
      ]
    }
  },
  "yone": {
    "fullName": "Yone, the Unforgotten",
    "title": "the Unforgotten",
    "id": "yone",
    "name": "Yone",
    "abilities": {
      "P": [
        {
          "name": "Way of the Hunter",
          "description": "Yone deals magic damage with every second attack. In addition, his critical strike chance is increased."
        }
      ],
      "Q": [
        {
          "name": "Mortal Steel",
          "description": "Thrusts forward, damaging all enemies in a line. On hit, grants a stack of Gathering Storm for a few seconds. At 2 stacks, Mortal Steel dashes Yone forward with a gust of wind knocking enemies airborne. Mortal Steel is treated as a basic attack and scales with all the same things."
        }
      ],
      "W": [
        {
          "name": "Spirit Cleave",
          "description": "Cleaves forward, damaging all enemies in a cone. Grants a shield to Yone, the value is increased by the number of champions hit by the swipe. Spirit Cleave's cooldown and cast time scale with attack speed."
        }
      ],
      "E": [
        {
          "name": "Soul Unbound",
          "description": "Yone's spirit leaves his body behind, gaining movement speed. When this skill ends, Yone's spirit is forced back to his body and he repeats a portion of the damage he dealt as a spirit."
        }
      ],
      "R": [
        {
          "name": "Fate Sealed",
          "description": "Yone blinks behind the last champion in a line with a slash so powerful it pulls all enemies hit towards him."
        }
      ]
    }
  },
  "yorick": {
    "fullName": "Yorick, Shepherd of Souls",
    "title": "Shepherd of Souls",
    "id": "yorick",
    "name": "Yorick",
    "abilities": {
      "P": [
        {
          "name": "Shepherd of Souls",
          "description": "The Cursed Horde: Yorick can summon Mist Walkers to swarm and attack nearby enemies."
        }
      ],
      "Q": [
        {
          "name": "Last Rites",
          "description": "Yorick deals bonus damage on his next attack and heals himself. If the target dies a grave will be dug."
        }
      ],
      "W": [
        {
          "name": "Dark Procession",
          "description": "Yorick summons a destructible wall at target location that will block enemy movement."
        }
      ],
      "E": [
        {
          "name": "Mourning Mist",
          "description": "Yorick throws a globule of Black Mist that damages, slows and marks enemies."
        }
      ],
      "R": [
        {
          "name": "Eulogy of the Isles",
          "description": "Yorick summons the Maiden of the Mist that causes Yorick's attacks against the Maiden's target to deal bonus damage. The Maiden will also automatically raise Walkers from dead enemies."
        }
      ]
    }
  },
  "yuumi": {
    "fullName": "Yuumi, the Magical Cat",
    "title": "the Magical Cat",
    "id": "yuumi",
    "name": "Yuumi",
    "abilities": {
      "P": [
        {
          "name": "Bop 'n' Block",
          "description": "Periodically, when Yuumi attacks a champion, she restores mana and gains a shield that follows her, protecting her and the ally she's attached to."
        }
      ],
      "Q": [
        {
          "name": "Prowling Projectile",
          "description": "Yuumi fires a missile, dealing damage to the first target hit. It deals bonus damage and slows if it takes at least 1 second to get to its target. While Attached, the missile can be controlled with your cursor."
        }
      ],
      "W": [
        {
          "name": "You and Me!",
          "description": "Passively, Yuumi increases her ally's Adaptive Force and her own. Actively, Yuumi dashes to a target ally, becoming untargetable from everything except turrets."
        }
      ],
      "E": [
        {
          "name": "Zoomies",
          "description": "Heals Yuumi and boosts movement and attack speed. If she's attached, she passes it to her ally instead."
        }
      ],
      "R": [
        {
          "name": "Final Chapter",
          "description": "Yuumi channels seven waves of damage, rooting anyone hit by three or more. Yuumi can move, attach, and cast Zoomies! while channeling."
        }
      ]
    }
  },
  "zac": {
    "fullName": "Zac, the Secret Weapon",
    "title": "the Secret Weapon",
    "id": "zac",
    "name": "Zac",
    "abilities": {
      "P": [
        {
          "name": "Cell Division",
          "description": "Each time Zac hits an enemy with an ability, he sheds a chunk of himself that can be reabsorbed to restore health. Upon taking fatal damage, Zac splits into 4 bloblets that attempt to recombine. If any bloblets remain, he will revive with an amount of health depending on the health of the surviving bloblets. Each bloblet has a percentage of Zac's maximum health, armor and magic resistance. This ability has a 5 minute cooldown."
        }
      ],
      "Q": [
        {
          "name": "Stretching Strikes",
          "description": "Zac stretches an arm, grabbing an enemy. Attacking a different enemy will cause him to throw both targets towards each other."
        }
      ],
      "W": [
        {
          "name": "Unstable Matter",
          "description": "Zac explodes outward towards nearby enemies, dealing a percentage of their maximum health as magic damage."
        }
      ],
      "E": [
        {
          "name": "Elastic Slingshot",
          "description": "Zac attaches his arms to the ground and stretches back, launching himself forward."
        }
      ],
      "R": [
        {
          "name": "Let's Bounce!",
          "description": "Zac bounces four times, knocking up enemies hit and slowing them."
        }
      ]
    }
  },
  "zed": {
    "fullName": "Zed, the Master of Shadows",
    "title": "the Master of Shadows",
    "id": "zed",
    "name": "Zed",
    "abilities": {
      "P": [
        {
          "name": "Contempt for the Weak",
          "description": "Zed's basic attacks against low health targets deals bonus Magic Damage. This effect can only occur once every few seconds against the same enemy champion."
        }
      ],
      "Q": [
        {
          "name": "Razor Shuriken",
          "description": "Zed and his shadows throw their shurikens. Each shuriken deals damage to every enemy hit."
        }
      ],
      "W": [
        {
          "name": "Living Shadow",
          "description": "Passive: Zed gains energy whenever he and his shadows strike an enemy with the same ability. Energy can only be gained once per cast ability. Active: Zed's shadow dashes forward, remaining in place for a few seconds. Reactivating Living Shadow will cause Zed to switch positions with this shadow."
        }
      ],
      "E": [
        {
          "name": "Shadow Slash",
          "description": "Zed and his shadows slash, dealing damage to nearby enemies."
        }
      ],
      "R": [
        {
          "name": "Death Mark",
          "description": "Zed becomes untargetable and dashes to an enemy champion, marking them. After 3 seconds the mark triggers, repeating a portion of all the damage Zed dealt to the target while they were marked."
        }
      ]
    }
  },
  "zeri": {
    "fullName": "Zeri, The Spark of Zaun",
    "title": "The Spark of Zaun",
    "id": "zeri",
    "name": "Zeri",
    "abilities": {
      "P": [
        {
          "name": "Living Battery",
          "description": "Zeri gains movement speed whenever she receives a shield. When she damages an enemy shield she absorbs its energy, shielding herself."
        }
      ],
      "Q": [
        {
          "name": "Burst Fire",
          "description": "Zeri's Attacks are treated as Abilities and Burst Fire is treated as an Attack. Moving and casting Burst Fire stores up energy in Zeri's Sparkpack. When fully charged her next Attack will slow and deal bonus damage. Burst Fire shoots a burst of 7 rounds that deal attack damage to the first enemy hit."
        }
      ],
      "W": [
        {
          "name": "Ultrashock Laser",
          "description": "Zeri fires an electric pulse that slows and damages the first enemy hit. If the pulse hits a wall it expands into a long range laser."
        }
      ],
      "E": [
        {
          "name": "Spark Surge",
          "description": "Zeri dashes a short distance and energizes her next 3 shots of Burst Fire, causing them to pierce through enemies. She will vault and grind over any terrain she touches."
        }
      ],
      "R": [
        {
          "name": "Lightning Crash",
          "description": "Zeri discharges a nova of electricity and overcharges herself, gaining increased damage and stacking movement speed that refreshes and gets stronger every time she hits an enemy champion. While overcharged, Burst fire becomes a faster triple shot that chains lightning between enemies."
        }
      ]
    }
  },
  "ziggs": {
    "fullName": "Ziggs, the Hexplosives Expert",
    "title": "the Hexplosives Expert",
    "id": "ziggs",
    "name": "Ziggs",
    "abilities": {
      "P": [
        {
          "name": "Short Fuse",
          "description": "Periodically, Ziggs' next basic attack deals bonus magic damage. This cooldown is reduced whenever Ziggs uses an ability."
        }
      ],
      "Q": [
        {
          "name": "Bouncing Bomb",
          "description": "Ziggs throws a bouncing bomb that deals magic damage."
        }
      ],
      "W": [
        {
          "name": "Satchel Charge",
          "description": "Ziggs flings an explosive charge that detonates after 4 seconds, or when this ability is activated again. The explosion deals magic damage to enemies, knocking them away. Ziggs is also knocked away, but takes no damage. Ziggs can use the Satchel to hexplode vulnerable enemy turrets."
        }
      ],
      "E": [
        {
          "name": "Hexplosive Minefield",
          "description": "Ziggs scatters proximity mines that detonate on enemy contact, dealing magic damage and slowing. Successive mine detonations on the same target deal reduced damage."
        }
      ],
      "R": [
        {
          "name": "Mega Inferno Bomb",
          "description": "Ziggs deploys his ultimate creation, the Mega Inferno Bomb, hurling it an enormous distance. Enemies in the primary blast zone take more damage than those farther away."
        }
      ]
    }
  },
  "zilean": {
    "fullName": "Zilean, the Chronokeeper",
    "title": "the Chronokeeper",
    "id": "zilean",
    "name": "Zilean",
    "abilities": {
      "P": [
        {
          "name": "Time in a Bottle",
          "description": "Zilean stores time as Experience and can grant it to his allies. When he has enough Experience to finish an ally's level up, he can right-click them to impart it. Zilean receives as much Experience as he gives."
        }
      ],
      "Q": [
        {
          "name": "Time Bomb",
          "description": "Tosses a bomb to target area that sticks to units that come near it (prioritizes Champions). It detonates after 3 seconds, dealing area of effect damage. If a Time Bomb is detonated early by another Time Bomb, it also stuns enemies."
        }
      ],
      "W": [
        {
          "name": "Rewind",
          "description": "Zilean can prepare himself for future confrontations, reducing the cooldowns of his other basic abilities."
        }
      ],
      "E": [
        {
          "name": "Time Warp",
          "description": "Zilean bends time around any unit, decreasing an enemy's movement speed or increasing an ally's movement speed for a short time."
        }
      ],
      "R": [
        {
          "name": "Chronoshift",
          "description": "Zilean places a protective time rune on an allied champion, teleporting the champion back in time if they take lethal damage."
        }
      ]
    }
  },
  "zoe": {
    "fullName": "Zoe, the Aspect of Twilight",
    "title": "the Aspect of Twilight",
    "id": "zoe",
    "name": "Zoe",
    "abilities": {
      "P": [
        {
          "name": "More Sparkles!",
          "description": "Zoe's next basic attack after casting a spell deals bonus magic damage."
        }
      ],
      "Q": [
        {
          "name": "Paddle Star",
          "description": "Zoe fires a missile that she can redirect in flight. Deals more damage the longer it flies in a straight line."
        }
      ],
      "W": [
        {
          "name": "Spell Thief",
          "description": "Zoe can pick up the remnants of enemy summoner spell and active item casts and cast them once herself. Whenever she casts a summoner spell, she gains 3 missiles that fire at the nearest target."
        }
      ],
      "E": [
        {
          "name": "Sleepy Trouble Bubble",
          "description": "Causes the target to become drowsy, then fall asleep. The first source of damage that breaks the sleep is doubled, up to a cap."
        }
      ],
      "R": [
        {
          "name": "Portal Jump",
          "description": "Blink to a nearby position for 1 second. Then blink back."
        }
      ]
    }
  },
  "zyra": {
    "fullName": "Zyra, Rise of the Thorns",
    "title": "Rise of the Thorns",
    "id": "zyra",
    "name": "Zyra",
    "abilities": {
      "P": [
        {
          "name": "Garden of Thorns",
          "description": "Seeds spawn around Zyra periodically, becoming faster with level. Zyra can cast Deadly Spines or Grasping Roots near seeds to grow plants, who fight for Zyra."
        }
      ],
      "Q": [
        {
          "name": "Deadly Spines",
          "description": "Thick vines spread through the ground and explode into spines, dealing magic damage to enemies within the area. If cast near a seed, Deadly Spines grows a Thorn Spitter plant, which fires at enemies from afar."
        }
      ],
      "W": [
        {
          "name": "Rampant Growth",
          "description": "Zyra plants a seed, lasting up to 60 seconds. Deadly Spines and Grasping Roots cast near seeds will turn them into plants who fight for Zyra. Zyra can store multiple seeds at once, and killing enemies reduces Rampant Growth's recharge time."
        }
      ],
      "E": [
        {
          "name": "Grasping Roots",
          "description": "Zyra sends forth vines through the ground to ensnare her target, dealing damage and rooting enemies they come across. If cast near a seed, Grasping Roots grows a Vine Lasher, whose short range attacks reduce enemy movement speed."
        }
      ],
      "R": [
        {
          "name": "Stranglethorns",
          "description": "Zyra summons a twisted thicket at her target location, dealing damage to enemies as it expands and knocking them airborne as it contracts. Plants within the thicket are enraged."
        }
      ]
    }
  }
}